/// AdamStory
const String adamStory = 'هو أول البشر وأول رسول بعث إلى البشرية عاش على الأرض نحو ألف عام ، يدعو ذريته إلى عبادة الله الواحد الصمد ، وجمع الله سبحانه وتعالى لخلقه قبضة من تراب الأرض فيها الأبيض والأسود والأصفر والأحمر ، لهذا جاء الناس ألوانا مختلفة ، فخلقه الله من طين كما جاء فى الآية الكريمة} إذ قال ربك للملائكة إنى خالق بشرا من طين { ونفخ فيه من روحه سبحانه فتحرك جسد آدم ودبت فيه الروح ، وصوره فى أبدع تصوير وجعله على أحسن تقويم. كرمه الله تعالى بكثير من النعم ومنها أنه أسجد له الملائكة ، ثم علمه الأسماء كلها وجعله خليفة له فى أرضه ليعمرها ويملأها خيراُ وبركةحين قرر الله تعالى خلق آدم حدث ملائكته من باب إعلامهم كى يسجدوا له ، حدثهم أنه سيجعل فى الأرض خليفة} إنى جاعل فى الأرض خليفة { وأن هذا الخليفة سوف يكون له ذرية وأحفاد وقامت الحيرة فى نفوس الملائكة الأطهار } أتجعل فيها من يفسد فيها ويسفك الدماء ونحن نسبح بحمدك ونقدس لك { فرد الله عليهم بأنه علام الغيوب الذى لا يخفى عليه شىء فى الأرض ولا فى السماء ، وأنه أعلم ما هو خفي على الملائكة وعلى الخلائق جميعا ، وأن له حكمة من وراء ذلك. وقوله سبحانه وتعالى } وإذ قلنا للملائكة اسجدوا لآدم فسجدوا إلا إبليس أبى واستكبر{ يبين الإكرام العظيم من الله تعالى لآدم عليه السلام وأن الملائكة قد سجدت لآدم تشريفا وتكريما أما إبليس فقد امتنع عن السجود تكبرا وأصبح باستكباره وامتناعه من الكافرين الضالين والحكمة من جعل آدم عليه السلام خليفة لله تعالى فى الأرض هى الرحمة بالعباد إذ هم لا طاقة لهم على تلقى أوامر الله ونواهيه مباشرة ، كذلك كان من إحسان الله أن يرسل الرسل من البشربعد ذلك } وعلم آدم الأسماء كلها { فقد أعطاه الله تعالى القدرة على اختصار الأشياء فى رموز ومسميات وعلمه أن يسمى الأشياء ، وغرس الله فى نفس آدم معرفة لا نهاية لها وحبا للمعرفة لانهاية له. بعد أن تعلم آدم أسماء الأشياء ، عرض الله هذه الأشياء على الملائكة فقال } أنبئونى بأسماء هؤلاء إن كنتم صادقين{ وعندئذ اعترفت الملائكة بعجزها وقصورها فى تسمية الأشياء واستخدام الرموز فى التعبير عنها } قالوا سبحانك لا علم لنا إلا ما علمتنا إنك أنت العليم الحكيم{ وشهدت بأن الله لا تخفى عليه خافية ، وأنه الحكيم الذى لا يفعل إلا ما تقتضيه الحكمة ، ومن الآيات ندرك أن فى إخبار الله تعالى للملائكة عن استخلاف آدم فى الأرض تعليما لعباده الأخذ بالمشاورة فى أمور دنياهم قبل أن يقدموا عليهاأمر الله آدم أن يسكن فى جنة الخلد مع زوجته حواء وأن يأكلا من ثمارها أكلا رغدا من أى مكان ، ونهاهما الله أن يأكلا من شجرة يقال إنها شجرة الكرم كما أشار إلى ذلك ابن عباس رضي الله عنه. وإذا أكلا منها صارا من الظالمين لأنفسهما بمعصية أوامر الله } وقلنا يا آدم اسكن أنت وزوجك الجنة وكلا منها رغدا حيث شئتما ولا تقربا هذه الشجرة فتكونا من الظالمين{ لكن الشيطان أوقعهما فى الخطيئة بسبب الإغواء بالأكل منها ، فأخرجهما الله من نعيم الجنة وأمرهم جميعا بالهبوط إلى أرض فيها الحياة والموت ثم البعث والنشور وجعلهم وذريتهم أعداء لإبليس إلى يوم القيامة ، } فأزلهما الشيطان عنها فأخرجهما مما كانا فيه وقلنا اهبطوا بعضكم لبعض عدو ولكم فى الأرض مستقر ومتاع إلى حين{ خرج آدم وحواء من الجنة وكان آدم حزينا وكانت حواء لا تكف عن البكاء ، } قالا ربنا ظلمنا أنفسنا وإن لم تغفر لنا وترحمنا لنكونن من الخاسرين{ فتقبل الله توبته لأن الله غفور رحيم يقبل التوبة من عباده ويعفو عن التائبين المخلصين وأرسله إلى الأرض أول رسول لأبنائه ولما توفى آدم عليه السلام كان ذلك يوم الجمعة جاءته الملائكة بحنوط وكفن من عند الله - عز وجل - وقيل إنه من الجنة فقبضوه وغسلوه وكفنوه وحنطوه وحفروا له ولحدوه وصلوا عليه فوضعوه فى قبره وعزوا فيه ابنه شيث عليه السلام ، وقال محمد ابن إسحاق: "كسفت الشمس والقمر سبعة أيام بلياليهن واختلف العلماء فى موضع دفنه ، فالمشهور أنه دفن عند الجبل الذى أهبط فيه فى الهند ، وقيل بجبل أبى قبيس بمكة ، ويقال إن سيدنا نوح عليه السلام لما كان زمن الطوفان حمله وحواء فى تابوت فدفنهما ببيت المقدس. حكى ذلك ابن جرير' ;
/// EdrisStory
const String edrisStory =
    "  دائمًا ما يُثار جدال عند الحديث عن الأنبياء، خاصَّةً من لم يرد لهم ذكرٌ وافٍ في القرآن الكريم والسنة النبوية المطهرةوذلك لأنَّ أغلب اعتماد المفسِّرين والمؤرِّخين في هذا الصدد على الإسرائيليَّات والنصوص الأدبيَّة المستمدَّة من تراث الشعوبومن القصص والروايات الأكثر جدلًا وخلافًا منذ أزمان بعيدة -وقد تجلَّت بشدَّة في أيامنا تلك- هي قصَّة نبي الله إدريس عليه السلامفلقد تم تناولها من اتِّجاهات عديدة؛ فهناك من اعتمد في سردها على التراث الإسلامي من كتب المفسرين والمؤرخين، وهناك من تناولها من ناحية روايات الإسرائيليات من كتب العهد القديم والجديد وأقوال علماء اليهود والنصارىوكذلك هناك الجانب الأثري الذي يعتمد على الجانب الحسي الملموس واللغات القديمة في تفسير النصوص والنقوش الموجودة على الآثار والمعابد، بالإضافة إلى التراث الشعب الأدبي المتمثِّل في حكاوى الشارع والقصص الشعبية المتوارثة عبر الأجيال والأساوهي بالطبع لا تُعدُّ مصدرًا يُعتمد عليه في تقصِّي الأخبار والحقائق، مع أنَّها بكلِّ حالٍ من الأحوال كالرماد من النار فإن وُجِد فلا بُدَّ أن يكون له أصلٌ يرتكز عليه، حتى مع ما جرى عليه من تحريف وتبديل بلا ريب من كثرة التداول على الألسنوالإشكالية الكبرى في هذا الصدد أن تخلط كلَّ تلك الأوراق بلا قدرةٍ حقيقيَّةٍ على الربط أو وجود العلم الكافي لذلكحقيقة إدريس عليه السلام وقد رأينا في هذه السطور أن نوجز قصة نبي الله إدريس عليه السلام من المصدر الرئيس الذي هو أصل اعتمادنا ومجال اختصاصنا (البحث في التراث والتاريخ الإسلامي)، وأن نسرد الحقائق المؤكدة من خلال الروايات الصحيحة بغض النظر عن الأمور الخلافية الظنية التي لا دليل عليها لا من الشرع أو التاريخ أو علم الآثار من المؤكد أن إدريس عليه السلام كان نبيًّا وصديقًا وله مكانة رفيعة بين الأنبياء عليهم السلام؛ فقد قال تعالى: {وَاذْكُرْ فِي الْكِتَابِ إِدْرِيسَ إِنَّهُ كَانَ صِدِّيقًا نَبِيًّا (56) وَرَفَعْنَاهُ مَكَانًا عَلِيًّا} [مريم: 56، 57]، وقال سبحانه: {وَإِسْمَاعِيلَ وَإِدْرِيسَ وَذَا الْكِفْلِ كُلٌّ مِنَ الصَّابِرِينَ} [الأنبياء: 85] وإدريس عليه السلام يُعرف في الكتب القديمة بـ 'إخنوخ'، ويرجع نسبه إلى شيث بن آدم عليهما السلام، ونسبه كاملًا كما أورده ابن إسحاق وغيره من أئمة النسب: 'إدريس بْنُ بَرْدَ بْنِ مُهَلْيِلِ بْنِ قَنِينَ بْنِ يَانِشَ بْنِ شيث بن آدم عليهم السَّلَامُ'[1] وقد صحَّ أنه أوَّل من خطَّ بالقلم، وأوَّل من خاط الثياب ولبس المخيط، وأوَّل من نظر في علم النجوم والحساب، وعلَّم الزراعة، وخطَّط المدن، وسكن البيوت وقد أنزل الله على نبيه إدريس عليه السلام صحفًا مقدَّسة قُدِّرت بثلاثين صحيفة، وقيل إنَّه سُمِّي 'إدريس' لكثرة درسه لكتاب الله تعالى وقد أجمعوا أنَّه حذَّر قومه من مخالطة نَسل قابيل، ولكنَّهم عصوه وخالطوهم، وكان هذا سببًا في زلل الكثيرين منهم وبُعدهم عن طريق الصلاح وقد ذكروا نقلًا عن الإنجيل أنه عاش 365 سنة وأنه كان له ابن يُسمَّى 'متوشالح'، وممَّا يُعضِّد صحَّة هذه الرواية أنَّه جاء فيها ما وافق كتاب الله، فتنصُّ على أنَّه: 'عاشَ أخنوخُ خَمسًا وسِتينَ سنَةً، ووَلَدَ مَتوشالَحَ، وسارَ أخنوخُ مع اللهِ بَعدَ ما وَلَدَ مَتوشالَحَ ثَلاثَ مِئَةِ سنَةٍ، ووَلَدَ بَنينَ وبَناتٍ، فكانَتْ كُلُّ أيّامِ أخنوخَ ثَلاثَ مِئَةٍ وخَمسًا وسِتينَ سنَةً، وسارَ أخنوخُ مع اللهِ، ولم يوجَدْ لأنَّ اللهَ أخَذَهُ'[2] فالقول بأنه: 'سارَ أخنوخُ مع اللهِ' يعني أنه كان صالحًا تقيًّا يسير على صراط الله وطريقه، و'ولم يوجَدْ لأنَّ اللهَ أخَذَهُ' يبين أنَّه قد رُفِع بشكلٍ من الأشكال، وهذا موافقٌ لقول الله تعالى في سورة مريم: {وَاذْكُرْ فِي الْكِتَابِ إِدْرِيسَ إِنَّهُ كَانَ صِدِّيقًا نَبِيًّا (56) وَرَفَعْنَاهُ مَكَانًا عَلِيًّا} [مريم: 56، 57] وقد ذكر المفسِّرون عند قوله تعالى: {وَرَفَعْنَاهُ مَكَانًا عَلِيًّا}، روايات عدَّة مختلفة، أقواها أنَّه رفعه الله في السماء الرابعة أو السادسة تحت جناح أحد الملائكة وفيها قُبِضَت روحه وقد اختلفت المصادر في مكان مولد إدريس عليه السلام ولكنَّ المتفق عليه أنَّه عاش في مصر وكان ملكًا عليها"
    " الروايات المشهورة وصحتها"
    " أورد الإمام السيوطي والمقريزي وابن تغري بردي وابن إياس رحمهم الله: أنَّ إدريس عليه السلام مَلَك مصر وكان أول من بنى بها بيوتًا للعبادة، وأنه أول من علَّم الناس الطب، وأنه من بنى الأهرامات وأودعها العلوم التي خشي من ضياعها، أو أنها كانت قبره وقبر جده شيث بن آدم عليهم السلام"
    "وأنَّه لعلمه بالفلك استدلَّ بحركة الكواكب على قرب الطوفان، وأنَّه كان يعيش في أرض بابل ولكنَّه أُوذِي منهم فدعا الله أن يرسله إلى أرض مثلها فأوحى إليه بالذهاب إلى مصر وعاش فيها وملكها"
    "ولكنَّ هذه الروايات أقرب للضعف ولا دليل عليها لا من القرآن والسنة ولا من الآثار المتروكة، ولكن يلاحظ أن كلَّ من ذكرها هم من المؤرخين المصريين أو من نقل عنهم، فالراجح أنها منقولة من التراث الشعبي المصري وهي بالطبع –كما ذكرنا من قبل- لا يمكن بحالٍ من الأحوال أن تُعتَمد كمصادر علميَّة موثوقة يُعتمد عليها"
    "وأمَّا مسألة أن 'أبا الهول' التمثال الشهير هو تجسيد لشخص نبيِّ الله إدريس عليه السلام فليس له ذكرٌ في المصادر الإسلاميَّة القديمة، وربَّما ورد في بعض المؤلفات القريبة، ولكنَّه لا يعدو بحالٍ من الأحوال -كما الروايات السابقة- أنَّه من حكاوى التراث الشعبي، فضلًا عن رأي المتخصصين في علم الآثار الذين يؤكدون بشكلٍ قاطع عدم صحَّة تلك الروايات"
    "وكذلك نجد أن تلك الروايات الشعبيَّة التراثيَّة قد تُخالف في كثيرٍ من الأحوال الشرع قبل العقل؛ فمثلًا نجد أنَّ من أشهر تلك الحكاوى الخاصَّة بقصَّة إدريس عليه السلام أنَّهم جعلوه إلهًا، وهو المعروف بـ 'أوزوريس'، وأنه نزل من السماء ليعيش بأرض مصر ليحكمها ويُعلِّم أهلها فنون الحياة، ثم صعد إلى السماء مرَّةً أخرى"
    "فمن الملاحظ أن القصة بها الكثير من الأصل الذي أوردناه سابقًا استنادًا على القرآن والإسرائيليَّات؛ ولكنَّها طبيعة الشعوب خاصَّةً التي ابتعدت عن الدين فتراتٍ طويلة مثل مصر القديمة (الفرعونية)"
    "فالتناول الشعبي لتاريخ الأشخاص والأحداث أمرٌ واقعٌ مستمر، وقد يشطُّ عن الواقع ويخترق حاجز العقل، ولكنه في أغلب الأحيان يحمل تشابهات قويَّة مع موروثات الأديان الرساليَّة الثلاث: اليهودية والمسيحية والإسلام"
    "فمثلًا في قصَّتنا نجد أنه مع مرور الوقت رفعه الناس من مرتبة النبي الصديق إلى مرتبة الآلهة وحاكوا له أسطورةً تُخلِّده"
    "فالأهمُّ لدينا أنَّه عند الحقائق والبحث العلمي يجب أن يكون الاعتماد الأوَّل والوحيد على المصادر الصحيحة من روايات مدروسة موثَّقة أو أدلَّة ملموسة، ويكون الأمر أهون بالطبع في العلوم الإنسانية كالتاريخ منها في العلوم التطبيقية  ";
/// NoahStory
const String noahStory =
    "هو نوح، بن لامك، بن متوشلخ، بن خنوخ - وهو إدريس - بن يرد، بن مهلاييل، بن قينن، بن أنوش، بن شيث، بن آدم أبي البشر عليه السلام.كان مولده بعد وفاة آدم، بمائة سنة وست وعشرين سنة فيما ذكره ابن جرير وغيرهوعلى تاريخ أهل الكتاب المتقدم، يكون بين مولد نوح، وموت آدم، مائة وست وأربعون سنة، وكان بينهما عشرة قرون، كما قال الحافظ أبو حاتم بن حبان في (صحيحه):حدثنا محمد بن عمر بن يوسف، حدثنا محمد بن عبد الملك بن زنجويه، حدثنا أبو توبة، حدثنا معاوية بن سلام، عن أخيه زيد بن سلام، سمعت أبا سلام، سمعت أبا أمامة، أن رجلًا قال: يا رسول الله: أنبي كان آدم؟قال: نعم مكلم""""قال: فكم كان بينه وبين نوح؟
قال: عشرة قرون.
قلت، وهذا على شرط مسلم، ولم يخرجه.
وفي صحيح البخاري، عن ابن عباس قال: كان بين آدم ونوح، عشرة قرون كلهم على الإسلام، فإن كان المراد بالقرن مائة سنة - كما هو المتبادر عند كثير من الناس - فبينهما ألف سنة لا محالة، لكن لا ينفى أن يكون أكثر، باعتبار ما قيد به ابن عباس بالإسلام، إذ قد يكون بينهما قرون أخر متأخرة، لم يكونوا على الإسلام، لكن حديث أبي أمامة يدل على الحصر في عشرة قرون.
وزادنا ابن عباس أنهم كلهم كانوا على الإسلام. وهذا يرد قول من زعم من أهل التواريخ، وغيرهم من أهل الكتاب، أن قابيل وبنيه، عبدوا النار، والله أعلم.
وإن كان المراد بالقرن، الجيل من الناس، كما في قوله تعالى: { وَكَمْ أَهْلَكْنَا مِنَ الْقُرُونِ مِنْ بَعْدِ نُوحٍ } [الإسراء: 37] .
وقوله: { ثُمَّ أَنْشَأْنَا مِنْ بَعْدِهِمْ قَرْنًا آخَرِينَ } [المؤمنون: 31] .
وقال تعالى: { وَقُرُونًا بَيْنَ ذَلِكَ كَثِيرًا } [الفرقان: 38] .
وقال: { وَكَمْ أَهْلَكْنَا قَبْلَهُمْ مِنْ قَرْنٍ } [مريم: 74] .
وكقوله عليه السلام: « خير القرون قرني... » الحديث.
فقد كان الجيل قبل نوح، يعمرون الدهر الطويلة، فعلى هذا يكون بين آدم ونوح، ألوف من السنين، والله أعلم.
وبالجملة؛ فنوح عليه السلام، إنما بعثه الله تعالى، لما عبدت الأصنام والطواغيت، وشرع الناس في الضلالة والكفر، فبعثه الله رحمة للعباد، فكان أول رسول، بعث إلى أهل الأرض، كما يقول له أهل الموقف يوم القيامة. وكان قومه يقال لهم بنو راسب، فيما ذكره ابن جبير، وغيره.
واختلفوا في مقدار سنه يوم بعث؛ فقيل: كان ابن خمسين سنة.
وقيل: ابن ثلاثمائة وخمسين سنة.
وقيل: ابن أربعمائة وثمانين سنة.
حكاها ابن جرير، وعزا الثالثة منها إلى ابن عباس.
وقد ذكر الله قصته، وما كان من قومه، وما أنزل بمن كفر به من العذاب بالطوفان، وكيف أنجاه وأصحاب السفينة في غير ما موضع من كتابه العزيز.
ففي الأعراف، ويونس، وهود، والأنبياء، والمؤمنون، والشعراء، والعنكبوت، والصافات، واقتربت، وأنزل فيه سورة كاملة، فقال في سورة الأعراف: { لَقَدْ أَرْسَلْنَا نُوحًا إِلَى قَوْمِهِ فَقَالَ يَاقَوْمِ اعْبُدُوا اللَّهَ مَا لَكُمْ مِنْ إِلَهٍ غَيْرُهُ إِنِّي أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ عَظِيمٍ * قَالَ الْمَلَأُ مِنْ قَوْمِهِ إِنَّا لَنَرَاكَ فِي ضَلَالٍ مُبِينٍ * قَالَ يَاقَوْمِ لَيْسَ بِي ضَلَالَةٌ وَلَكِنِّي رَسُولٌ مِنْ رَبِّ الْعَالَمِينَ * أُبَلِّغُكُمْ رِسَالَاتِ رَبِّي وَأَنْصَحُ لَكُمْ وَأَعْلَمُ مِنَ اللَّهِ مَا لَا تَعْلَمُونَ * أَوَعَجِبْتُمْ أَنْ جَاءكُمْ ذِكْرٌ مِنْ رَبِّكُمْ عَلَى رَجُلٍ مِنْكُمْ لِيُنْذِرَكُمْ وَلِتَتَّقُوا وَلَعَلَّكُمْ تُرْحَمُونَ * فَكَذَّبُوهُ فَأَنْجَيْنَاهُ وَالَّذِينَ مَعَهُ فِي الْفُلْكِ وَأَغْرَقْنَا الَّذِينَ كَذَّبُوا بِآيَاتِنَا إِنَّهُمْ كَانُوا قَوْمًا عَمِينَ } [59 - 64] .
وقال في سورة يونس: { وَاتْلُ عَلَيْهِمْ نَبَأَ نُوحٍ إِذْ قَالَ لِقَوْمِهِ يَاقَوْمِ إِنْ كَانَ كَبُرَ عَلَيْكُمْ مَقَامِي وَتَذْكِيرِي بِآيَاتِ اللَّهِ فَعَلَى اللَّهِ تَوَكَّلْتُ فَأَجْمِعُوا أَمْرَكُمْ وَشُرَكَاءكُمْ ثُمَّ لَا يَكُنْ أَمْرُكُمْ عَلَيْكُمْ غُمَّةً ثُمَّ اقْضُوا إِلَيَّ وَلَا تُنْظِرُونِ * فَإِنْ تَوَلَّيْتُمْ فَمَا سَأَلْتُكُمْ مِنْ أَجْرٍ إِنْ أَجْرِيَ إِلَّا عَلَى اللَّهِ وَأُمِرْتُ أَنْ أَكُونَ مِنَ الْمُسْلِمِينَ * فَكَذَّبُوهُ فَنَجَّيْنَاهُ وَمَنْ مَعَهُ فِي الْفُلْكِ وَجَعَلْنَاهُمْ خَلَائِفَ وَأَغْرَقْنَا الَّذِينَ كَذَّبُوا بِآيَاتِنَا فَانْظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُنْذَرِينَ } [71 - 73] .
وقال تعالى في سورة هود:
{ وَلَقَدْ أَرْسَلْنَا نُوحًا إِلَى قَوْمِهِ إِنِّي لَكُمْ نَذِيرٌ مُبِينٌ * أَنْ لَا تَعْبُدُوا إِلَّا اللَّهَ إِنِّي أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ أَلِيمٍ * فَقَالَ الْمَلَأُ الَّذِينَ كَفَرُوا مِنْ قَوْمِهِ مَا نَرَاكَ إِلَّا بَشَرًا مِثْلَنَا وَمَا نَرَاكَ اتَّبَعَكَ إِلَّا الَّذِينَ هُمْ أَرَاذِلُنَا بَادِيَ الرَّأْيِ وَمَا نَرَى لَكُمْ عَلَيْنَا مِنْ فَضْلٍ بَلْ نَظُنُّكُمْ كَاذِبِينَ * قَالَ يَاقَوْمِ أَرَأَيْتُمْ إِنْ كُنْتُ عَلَى بَيِّنَةٍ مِنْ رَبِّي وَآتَانِي رَحْمَةً مِنْ عِنْدِهِ فَعُمِّيَتْ عَلَيْكُمْ أَنُلْزِمُكُمُوهَا وَأَنْتُمْ لَهَا كَارِهُونَ * وَيَا قَوْمِ لَا أَسْأَلُكُمْ عَلَيْهِ مَالًا إِنْ أَجْرِيَ إِلَّا عَلَى اللَّهِ وَمَا أَنَا بِطَارِدِ الَّذِينَ آمَنُوا إِنَّهُمْ مُلَاقُو رَبِّهِمْ وَلَكِنِّي أَرَاكُمْ قَوْمًا تَجْهَلُونَ * وَيَا قَوْمِ مَنْ يَنْصُرُنِي مِنَ اللَّهِ إِنْ طَرَدْتُهُمْ أَفَلَا تَذَكَّرُونَ * وَلَا أَقُولُ لَكُمْ عِنْدِي خَزَائِنُ اللَّهِ وَلَا أَعْلَمُ الْغَيْبَ وَلَا أَقُولُ إِنِّي مَلَكٌ وَلَا أَقُولُ لِلَّذِينَ تَزْدَرِي أَعْيُنُكُمْ لَنْ يُؤْتِيَهُمُ اللَّهُ خَيْرًا اللَّهُ أَعْلَمُ بِمَا فِي أَنْفُسِهِمْ إِنِّي إِذًا لَمِنَ الظَّالِمِينَ * قَالُوا يَانُوحُ قَدْ جَادَلْتَنَا فَأَكْثَرْتَ جِدَالَنَا فَأْتِنَا بِمَا تَعِدُنَا إِنْ كُنْتَ مِنَ الصَّادِقِينَ * قَالَ إِنَّمَا يَأْتِيكُمْ بِهِ اللَّهُ إِنْ شَاءَ وَمَا أَنْتُمْ بِمُعْجِزِينَ * وَلَا يَنْفَعُكُمْ نُصْحِي إِنْ أَرَدْتُ أَنْ أَنْصَحَ لَكُمْ إِنْ كَانَ اللَّهُ يُرِيدُ أَنْ يُغْوِيَكُمْ هُوَ رَبُّكُمْ وَإِلَيْهِ تُرْجَعُونَ * أَمْ يَقُولُونَ افْتَرَاهُ قُلْ إِنِ افْتَرَيْتُهُ فَعَلَيَّ إِجْرَامِي وَأَنَا بَرِيءٌ مِمَّا تُجْرِمُونَ * وَأُوحِيَ إِلَى نُوحٍ أَنَّهُ لَنْ يُؤْمِنَ مِنْ قَوْمِكَ إِلَّا مَنْ قَدْ آمَنَ فَلَا تَبْتَئِسْ بِمَا كَانُوا يَفْعَلُونَ * وَاصْنَعِ الْفُلْكَ بِأَعْيُنِنَا وَوَحْيِنَا وَلَا تُخَاطِبْنِي فِي الَّذِينَ ظَلَمُوا إِنَّهُمْ مُغْرَقُونَ * وَيَصْنَعُ الْفُلْكَ وَكُلَّمَا مَرَّ عَلَيْهِ مَلَأٌ مِنْ قَوْمِهِ سَخِرُوا مِنْهُ قَالَ إِنْ تَسْخَرُوا مِنَّا فَإِنَّا نَسْخَرُ مِنْكُمْ كَمَا تَسْخَرُونَ * فَسَوْفَ تَعْلَمُونَ مَنْ يَأْتِيهِ عَذَابٌ يُخْزِيهِ وَيَحِلُّ عَلَيْهِ عَذَابٌ مُقِيمٌ * حَتَّى إِذَا جَاءَ أَمْرُنَا وَفَارَ التَّنُّورُ قُلْنَا احْمِلْ فِيهَا مِنْ كُلٍّ زَوْجَيْنِ اثْنَيْنِ وَأَهْلَكَ إِلَّا مَنْ سَبَقَ عَلَيْهِ الْقَوْلُ وَمَنْ آمَنَ وَمَا آمَنَ مَعَهُ إِلَّا قَلِيلٌ * وَقَالَ ارْكَبُوا فِيهَا بِسْمِ اللَّهِ مَجْرَاهَا وَمُرْسَاهَا إِنَّ رَبِّي لَغَفُورٌ رَحِيمٌ * وَهِيَ تَجْرِي بِهِمْ فِي مَوْجٍ كَالْجِبَالِ وَنَادَى نُوحٌ ابْنَهُ وَكَانَ فِي مَعْزِلٍ يَابُنَيَّ ارْكَبْ مَعَنَا وَلَا تَكُنْ مَعَ الْكَافِرِينَ * قَالَ سَآوِي إِلَى جَبَلٍ يَعْصِمُنِي مِنَ الْمَاءِ قَالَ لَا عَاصِمَ الْيَوْمَ مِنْ أَمْرِ اللَّهِ إِلَّا مَنْ رَحِمَ وَحَالَ بَيْنَهُمَا الْمَوْجُ فَكَانَ مِنَ الْمُغْرَقِينَ * وَقِيلَ يَاأَرْضُ ابْلَعِي مَاءكِ وَيَا سَمَاءُ أَقْلِعِي وَغِيضَ الْمَاءُ وَقُضِيَ الْأَمْرُ وَاسْتَوَتْ عَلَى الْجُودِيِّ وَقِيلَ بُعْدًا لِلْقَوْمِ الظَّالِمِينَ * وَنَادَى نُوحٌ رَبَّهُ فَقَالَ رَبِّ إِنَّ ابْنِي مِنْ أَهْلِي وَإِنَّ وَعْدَكَ الْحَقُّ وَأَنْتَ أَحْكَمُ الْحَاكِمِينَ * قَالَ يَانُوحُ إِنَّهُ لَيْسَ مِنْ أَهْلِكَ إِنَّهُ عَمَلٌ غَيْرُ صَالِحٍ فَلَا تَسْأَلْنِ مَا لَيْسَ لَكَ بِهِ عِلْمٌ إِنِّي أَعِظُكَ أَنْ تَكُونَ مِنَ الْجَاهِلِينَ * قَالَ رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ وَإِلَّا تَغْفِرْ لِي وَتَرْحَمْنِي أَكُنْ مِنَ الْخَاسِرِينَ * قِيلَ يَانُوحُ اهْبِطْ بِسَلَامٍ مِنَّا وَبَرَكَاتٍ عَلَيْكَ وَعَلَى أُمَمٍ مِمَّنْ مَعَكَ وَأُمَمٌ سَنُمَتِّعُهُمْ ثُمَّ يَمَسُّهُمْ مِنَّا عَذَابٌ أَلِيمٌ * تِلْكَ مِنْ أَنْبَاءِ الْغَيْبِ نُوحِيهَا إِلَيْكَ مَا كُنْتَ تَعْلَمُهَا أَنْتَ وَلَا قَوْمُكَ مِنْ قَبْلِ هَذَا فَاصْبِرْ إِنَّ الْعَاقِبَةَ لِلْمُتَّقِينَ } [هود: 25- 49] .
وقال تعالى في سورة الأنبياء: { وَنُوحًا إِذْ نَادَى مِنْ قَبْلُ فَاسْتَجَبْنَا لَهُ فَنَجَّيْنَاهُ وَأَهْلَهُ مِنَ الْكَرْبِ الْعَظِيمِ * وَنَصَرْنَاهُ مِنَ الْقَوْمِ الَّذِينَ كَذَّبُوا بِآيَاتِنَا إِنَّهُمْ كَانُوا قَوْمَ سَوْءٍ فَأَغْرَقْنَاهُمْ أَجْمَعِينَ } [الأنبياء: 76-77] .
وقال تعالى في سورة قد أفلح المؤمنون: { وَلَقَدْ أَرْسَلْنَا نُوحًا إِلَى قَوْمِهِ فَقَالَ يَاقَوْمِ اعْبُدُوا اللَّهَ مَا لَكُمْ مِنْ إِلَهٍ غَيْرُهُ أَفَلَا تَتَّقُونَ * فَقَالَ الْمَلَأُ الَّذِينَ كَفَرُوا مِنْ قَوْمِهِ مَا هَذَا إِلَّا بَشَرٌ مِثْلُكُمْ يُرِيدُ أَنْ يَتَفَضَّلَ عَلَيْكُمْ وَلَوْ شَاءَ اللَّهُ لَأَنْزَلَ مَلَائِكَةً مَا سَمِعْنَا بِهَذَا فِي آبَائِنَا الْأَوَّلِينَ * إِنْ هُوَ إِلَّا رَجُلٌ بِهِ جِنَّةٌ فَتَرَبَّصُوا بِهِ حَتَّى حِينٍ * قَالَ رَبِّ انْصُرْنِي بِمَا كَذَّبُونِ * فَأَوْحَيْنَا إِلَيْهِ أَنِ اصْنَعِ الْفُلْكَ بِأَعْيُنِنَا وَوَحْيِنَا فَإِذَا جَاءَ أَمْرُنَا وَفَارَ التَّنُّورُ فَاسْلُكْ فِيهَا مِنْ كُلٍّ زَوْجَيْنِ اثْنَيْنِ وَأَهْلَكَ إِلَّا مَنْ سَبَقَ عَلَيْهِ الْقَوْلُ مِنْهُمْ وَلَا تُخَاطِبْنِي فِي الَّذِينَ ظَلَمُوا إِنَّهُمْ مُغْرَقُونَ * فَإِذَا اسْتَوَيْتَ أَنْتَ وَمَنْ مَعَكَ عَلَى الْفُلْكِ فَقُلِ الْحَمْدُ لِلَّهِ الَّذِي نَجَّانَا مِنَ الْقَوْمِ الظَّالِمِينَ * وَقُلْ رَبِّ أَنْزِلْنِي مُنْزَلًا مُبَارَكًا وَأَنْتَ خَيْرُ الْمُنْزِلِينَ * إِنَّ فِي ذَلِكَ لَآيَاتٍ وَإِنْ كُنَّا لَمُبْتَلِينَ } [المؤمنون: 23-30] .
وقال تعالى في سورة الشعراء: { كَذَّبَتْ قَوْمُ نُوحٍ الْمُرْسَلِينَ * إِذْ قَالَ لَهُمْ أَخُوهُمْ نُوحٌ أَلَا تَتَّقُونَ * إِنِّي لَكُمْ رَسُولٌ أَمِينٌ * فَاتَّقُوا اللَّهَ وَأَطِيعُونِ * وَمَا أَسْأَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ إِنْ أَجْرِيَ إِلَّا عَلَى رَبِّ الْعَالَمِينَ * فَاتَّقُوا اللَّهَ وَأَطِيعُونِ * قَالُوا أَنُؤْمِنُ لَكَ وَاتَّبَعَكَ الْأَرْذَلُونَ * قَالَ وَمَا عِلْمِي بِمَا كَانُوا يَعْمَلُونَ * إِنْ حِسَابُهُمْ إِلَّا عَلَى رَبِّي لَوْ تَشْعُرُونَ * وَمَا أَنَا بِطَارِدِ الْمُؤْمِنِينَ * إِنْ أَنَا إِلَّا نَذِيرٌ مُبِينٌ * قَالُوا لَئِنْ لَمْ تَنْتَهِ يَانُوحُ لَتَكُونَنَّ مِنَ الْمَرْجُومِينَ * قَالَ رَبِّ إِنَّ قَوْمِي كَذَّبُونِ * فَافْتَحْ بَيْنِي وَبَيْنَهُمْ فَتْحًا وَنَجِّنِي وَمَنْ مَعِيَ مِنَ الْمُؤْمِنِينَ * فَأَنْجَيْنَاهُ وَمَنْ مَعَهُ فِي الْفُلْكِ الْمَشْحُونِ * ثُمَّ أَغْرَقْنَا بَعْدُ الْبَاقِينَ * إِنَّ فِي ذَلِكَ لَآيَةً وَمَا كَانَ أَكْثَرُهُمْ مُؤْمِنِينَ * وَإِنَّ رَبَّكَ لَهُوَ الْعَزِيزُ الرَّحِيمُ } [الشعراء: 105-122] .
وقال تعالى في سورة العنكبوت: { وَلَقَدْ أَرْسَلْنَا نُوحًا إِلَى قَوْمِهِ فَلَبِثَ فِيهِمْ أَلْفَ سَنَةٍ إِلَّا خَمْسِينَ عَامًا فَأَخَذَهُمُ الطُّوفَانُ وَهُمْ ظَالِمُونَ * فَأَنْجَيْنَاهُ وَأَصْحَابَ السَّفِينَةِ وَجَعَلْنَاهَا آيَةً لِلْعَالَمِينَ } [العنكبوت: 14-15] .
وقال تعالى في سورة الصافات: { وَلَقَدْ نَادَانَا نُوحٌ فَلَنِعْمَ الْمُجِيبُونَ * وَنَجَّيْنَاهُ وَأَهْلَهُ مِنَ الْكَرْبِ الْعَظِيمِ * وَجَعَلْنَا ذُرِّيَّتَهُ هُمُ الْبَاقِينَ * وَتَرَكْنَا عَلَيْهِ فِي الْآخِرِينَ * سَلَامٌ عَلَى نُوحٍ فِي الْعَالَمِينَ * إِنَّا كَذَلِكَ نَجْزِي الْمُحْسِنِينَ * إِنَّهُ مِنْ عِبَادِنَا الْمُؤْمِنِينَ * ثُمَّ أَغْرَقْنَا الْآخَرِينَ } [الصافات: 75-82] .
وقال تعالى في سورة اقتربت: { كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ فَكَذَّبُوا عَبْدَنَا وَقَالُوا مَجْنُونٌ وَازْدُجِرَ * فَدَعَا رَبَّهُ أَنِّي مَغْلُوبٌ فَانْتَصِرْ * فَفَتَحْنَا أَبْوَابَ السَّمَاءِ بِمَاءٍ مُنْهَمِرٍ * وَفَجَّرْنَا الْأَرْضَ عُيُونًا فَالْتَقَى الْمَاءُ عَلَى أَمْرٍ قَدْ قُدِرَ * وَحَمَلْنَاهُ عَلَى ذَاتِ أَلْوَاحٍ وَدُسُرٍ * تَجْرِي بِأَعْيُنِنَا جَزَاءً لِمَنْ كَانَ كُفِرَ * وَلَقَدْ تَرَكْنَاهَا آيَةً فَهَلْ مِنْ مُدَّكِرٍ * فَكَيْفَ كَانَ عَذَابِي وَنُذُرِ * وَلَقَدْ يَسَّرْنَا الْقُرْآنَ لِلذِّكْرِ فَهَلْ مِنْ مُدَّكِرٍ } [القمر: 9-17] .
وقال تعالى بسم الله الرحمن الرحيم: { إِنَّا أَرْسَلْنَا نُوحًا إِلَى قَوْمِهِ أَنْ أَنْذِرْ قَوْمَكَ مِنْ قَبْلِ أَنْ يَأْتِيَهُمْ عَذَابٌ أَلِيمٌ * قَالَ يَاقَوْمِ إِنِّي لَكُمْ نَذِيرٌ مُبِينٌ * أَنِ اعْبُدُوا اللَّهَ وَاتَّقُوهُ وَأَطِيعُونِ * يَغْفِرْ لَكُمْ مِنْ ذُنُوبِكُمْ وَيُؤَخِّرْكُمْ إِلَى أَجَلٍ مُسَمًّى إِنَّ أَجَلَ اللَّهِ إِذَا جَاءَ لَا يُؤَخَّرُ لَوْ كُنْتُمْ تَعْلَمُونَ * قَالَ رَبِّ إِنِّي دَعَوْتُ قَوْمِي لَيْلًا وَنَهَارًا * فَلَمْ يَزِدْهُمْ دُعَائِي إِلَّا فِرَارًا * وَإِنِّي كُلَّمَا دَعَوْتُهُمْ لِتَغْفِرَ لَهُمْ جَعَلُوا أَصَابِعَهُمْ فِي آذَانِهِمْ وَاسْتَغْشَوْا ثِيَابَهُمْ وَأَصَرُّوا وَاسْتَكْبَرُوا اسْتِكْبَارًا * ثُمَّ إِنِّي دَعَوْتُهُمْ جِهَارًا * ثُمَّ إِنِّي أَعْلَنْتُ لَهُمْ وَأَسْرَرْتُ لَهُمْ إِسْرَارًا * فَقُلْتُ اسْتَغْفِرُوا رَبَّكُمْ إِنَّهُ كَانَ غَفَّارًا * يُرْسِلِ السَّمَاءَ عَلَيْكُمْ مِدْرَارًا * وَيُمْدِدْكُمْ بِأَمْوَالٍ وَبَنِينَ وَيَجْعَلْ لَكُمْ جَنَّاتٍ وَيَجْعَلْ لَكُمْ أَنْهَارًا * مَا لَكُمْ لَا تَرْجُونَ لِلَّهِ وَقَارًا * وَقَدْ خَلَقَكُمْ أَطْوَارًا * أَلَمْ تَرَوْا كَيْفَ خَلَقَ اللَّهُ سَبْعَ سَمَوَاتٍ طِبَاقًا * وَجَعَلَ الْقَمَرَ فِيهِنَّ نُورًا وَجَعَلَ الشَّمْسَ سِرَاجًا * وَاللَّهُ أَنْبَتَكُمْ مِنَ الْأَرْضِ نَبَاتًا * ثُمَّ يُعِيدُكُمْ فِيهَا وَيُخْرِجُكُمْ إِخْرَاجًا * وَاللَّهُ جَعَلَ لَكُمُ الْأَرْضَ بِسَاطًا * لِتَسْلُكُوا مِنْهَا سُبُلًا فِجَاجًا * قَالَ نُوحٌ رَبِّ إِنَّهُمْ عَصَوْنِي وَاتَّبَعُوا مَنْ لَمْ يَزِدْهُ مَالُهُ وَوَلَدُهُ إِلَّا خَسَارًا * وَمَكَرُوا مَكْرًا كُبَّارًا * وَقَالُوا لَا تَذَرُنَّ آلِهَتَكُمْ وَلَا تَذَرُنَّ وَدًّا وَلَا سُوَاعًا وَلَا يَغُوثَ وَيَعُوقَ وَنَسْرًا * وَقَدْ أَضَلُّوا كَثِيرًا وَلَا تَزِدِ الظَّالِمِينَ إِلَّا ضَلَالًا * مِمَّا خَطِيئَاتِهِمْ أُغْرِقُوا فَأُدْخِلُوا نَارًا فَلَمْ يَجِدُوا لَهُمْ مِنْ دُونِ اللَّهِ أَنْصَارًا * وَقَالَ نُوحٌ رَبِّ لَا تَذَرْ عَلَى الْأَرْضِ مِنَ الْكَافِرِينَ دَيَّارًا * إِنَّكَ إِنْ تَذَرْهُمْ يُضِلُّوا عِبَادَكَ وَلَا يَلِدُوا إِلَّا فَاجِرًا كَفَّارًا * رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا تَبَارًا } [نوح السورة بتمامها] .
وقد تكلمنا على كل موضع من هذه السورة في التفسير، وسنذكر مضمون القصة مجموعًا من هذه الأماكن المتفرقة، ومما دلت عليه الأحاديث، والآثار.
وقد جرى ذكره أيضًا في مواضع متفرقة من القرآن، فيها مدحه وذم من خالفه.
فقال تعالى في سورة النساء: { إِنَّا أَوْحَيْنَا إِلَيْكَ كَمَا أَوْحَيْنَا إِلَى نُوحٍ وَالنَّبِيِّينَ مِنْ بَعْدِهِ وَأَوْحَيْنَا إِلَى إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ وَيَعْقُوبَ وَالْأَسْبَاطِ وَعِيسَى وَأَيُّوبَ وَيُونُسَ وَهَارُونَ وَسُلَيْمَانَ وَآتَيْنَا دَاوُدَ زَبُورًا * وَرُسُلًا قَدْ قَصَصْنَاهُمْ عَلَيْكَ مِنْ قَبْلُ وَرُسُلًا لَمْ نَقْصُصْهُمْ عَلَيْكَ وَكَلَّمَ اللَّهُ مُوسَى تَكْلِيمًا * رُسُلًا مُبَشِّرِينَ وَمُنْذِرِينَ لِئَلَّا يَكُونَ لِلنَّاسِ عَلَى اللَّهِ حُجَّةٌ بَعْدَ الرُّسُلِ وَكَانَ اللَّهُ عَزِيزًا حَكِيمًا } [النساء: 163-165] .
وقال في سورة الأنعام: { وَتِلْكَ حُجَّتُنَا آتَيْنَاهَا إِبْرَاهِيمَ عَلَى قَوْمِهِ نَرْفَعُ دَرَجَاتٍ مَنْ نَشَاءُ إِنَّ رَبَّكَ حَكِيمٌ عَلِيمٌ * وَوَهَبْنَا لَهُ إِسْحَاقَ وَيَعْقُوبَ كُلًّا هَدَيْنَا وَنُوحًا هَدَيْنَا مِنْ قَبْلُ وَمِنْ ذُرِّيَّتِهِ دَاوُدَ وَسُلَيْمَانَ وَأَيُّوبَ وَيُوسُفَ وَمُوسَى وَهَارُونَ وَكَذَلِكَ نَجْزِي الْمُحْسِنِينَ * وَزَكَرِيَّا وَيَحْيَى وَعِيسَى وَإِلْيَاسَ كُلٌّ مِنَ الصَّالِحِينَ * وَإِسْمَاعِيلَ وَالْيَسَعَ وَيُونُسَ وَلُوطًا وَكُلًّا فَضَّلْنَا عَلَى الْعَالَمِينَ * وَمِنْ آبَائِهِمْ وَذُرِّيَّاتِهِمْ وَإِخْوَانِهِمْ وَاجْتَبَيْنَاهُمْ وَهَدَيْنَاهُمْ إِلَى صِرَاطٍ مُسْتَقِيمٍ } الآيات [الأنعام: 83-87] .
وتقدمت قصته في الأعراف.

وقال في سورة براءة: { أَلَمْ يَأْتِهِمْ نَبَأُ الَّذِينَ مِنْ قَبْلِهِمْ قَوْمِ نُوحٍ وَعَادٍ وَثَمُودَ وَقَوْمِ إِبْرَاهِيمَ وَأَصْحَابِ مَدْيَنَ وَالْمُؤْتَفِكَاتِ أَتَتْهُمْ رُسُلُهُمْ بِالْبَيِّنَاتِ فَمَا كَانَ اللَّهُ لِيَظْلِمَهُمْ وَلَكِنْ كَانُوا أَنْفُسَهُمْ يَظْلِمُونَ } [التوبة:70] .

وتقدمت قصته في يونس، وهود.

وقال في سورة إبراهيم: { أَلَمْ يَأْتِكُمْ نَبَأُ الَّذِينَ مِنْ قَبْلِكُمْ قَوْمِ نُوحٍ وَعَادٍ وَثَمُودَ وَالَّذِينَ مِنْ بَعْدِهِمْ لَا يَعْلَمُهُمْ إِلَّا اللَّهُ جَاءتْهُمْ رُسُلُهُمْ بِالْبَيِّنَاتِ فَرَدُّوا أَيْدِيَهُمْ فِي أَفْوَاهِهِمْ وَقَالُوا إِنَّا كَفَرْنَا بِمَا أُرْسِلْتُمْ بِهِ وَإِنَّا لَفِي شَكٍّ مِمَّا تَدْعُونَنَا إِلَيْهِ مُرِيبٍ } [إبراهيم:9] .

وقال في سورة سبحان: { ذُرِّيَّةَ مَنْ حَمَلْنَا مَعَ نُوحٍ إِنَّهُ كَانَ عَبْدًا شَكُورًا } [الإسراء: 3] .

وقال فيها أيضا: { وَكَمْ أَهْلَكْنَا مِنَ الْقُرُونِ مِنْ بَعْدِ نُوحٍ وَكَفَى بِرَبِّكَ بِذُنُوبِ عِبَادِهِ خَبِيرًا بَصِيرًا } [الإسراء: 17] .

وتقدمت قصته في الأنبياء، والمؤمنون، والشعراء، والعنكبوت.

وقال في سورة الأحزاب: { وَإِذْ أَخَذْنَا مِنَ النَّبِيِّينَ مِيثَاقَهُمْ وَمِنْكَ وَمِنْ نُوحٍ وَإِبْرَاهِيمَ وَمُوسَى وَعِيسَى ابْنِ مَرْيَمَ وَأَخَذْنَا مِنْهُمْ مِيثَاقًا غَلِيظًا } [الأحزاب: 7] .

وقال في سورة ص: { كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَعَادٌ وَفِرْعَوْنُ ذُو الْأَوْتَادِ * وَثَمُودُ وَقَوْمُ لُوطٍ وَأَصْحَابُ الْأَيْكَةِ أُولَئِكَ الْأَحْزَابُ * إِنْ كُلٌّ إِلَّا كَذَّبَ الرُّسُلَ فَحَقَّ عِقَابِ } [ص: 12-14] .

وقال في سورة غافر: { كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَالْأَحْزَابُ مِنْ بَعْدِهِمْ وَهَمَّتْ كُلُّ أُمَّةٍ بِرَسُولِهِمْ لِيَأْخُذُوهُ وَجَادَلُوا بِالْبَاطِلِ لِيُدْحِضُوا بِهِ الْحَقَّ فَأَخَذْتُهُمْ فَكَيْفَ كَانَ عِقَابِ * وَكَذَلِكَ حَقَّتْ كَلِمَةُ رَبِّكَ عَلَى الَّذِينَ كَفَرُوا أَنَّهُمْ أَصْحَابُ النَّارِ } [غافر: 5-6] .

وقال في سورة الشورى: { شَرَعَ لَكُمْ مِنَ الدِّينِ مَا وَصَّى بِهِ نُوحًا وَالَّذِي أَوْحَيْنَا إِلَيْكَ وَمَا وَصَّيْنَا بِهِ إِبْرَاهِيمَ وَمُوسَى وَعِيسَى أَنْ أَقِيمُوا الدِّينَ وَلَا تَتَفَرَّقُوا فِيهِ كَبُرَ عَلَى الْمُشْرِكِينَ مَا تَدْعُوهُمْ إِلَيْهِ اللَّهُ يَجْتَبِي إِلَيْهِ مَنْ يَشَاءُ وَيَهْدِي إِلَيْهِ مَنْ يُنِيبُ } [الشورى: 13] .

وقال تعالى في سورة ق: { كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَأَصْحَابُ الرَّسِّ وَثَمُودُ * وَعَادٌ وَفِرْعَوْنُ وَإِخْوَانُ لُوطٍ * وَأَصْحَابُ الْأَيْكَةِ وَقَوْمُ تُبَّعٍ كُلٌّ كَذَّبَ الرُّسُلَ فَحَقَّ وَعِيدِ } [ق: 12-14] .

وقال في الذاريات: { وَقَوْمَ نُوحٍ مِنْ قَبْلُ إِنَّهُمْ كَانُوا قَوْمًا فَاسِقِينَ } [الذاريات: 46] .

وقال في النجم: { وَقَوْمَ نُوحٍ مِنْ قَبْلُ إِنَّهُمْ كَانُوا هُمْ أَظْلَمَ وَأَطْغَى } [النجم: 52] .

وتقدمت قصته في سورة اقتربت الساعة.

وقال تعالى في سورة الحديد: { وَلَقَدْ أَرْسَلْنَا نُوحًا وَإِبْرَاهِيمَ وَجَعَلْنَا فِي ذُرِّيَّتِهِمَا النُّبُوَّةَ وَالْكِتَابَ فَمِنْهُمْ مُهْتَدٍ وَكَثِيرٌ مِنْهُمْ فَاسِقُونَ } [الحديد: 26] .

وقال تعالى في سورة التحريم: { ضَرَبَ اللَّهُ مَثَلًا لِلَّذِينَ كَفَرُوا اِمْرَأَةَ نُوحٍ وَامْرَأَةَ لُوطٍ كَانَتَا تَحْتَ عَبْدَيْنِ مِنْ عِبَادِنَا صَالِحَيْنِ فَخَانَتَاهُمَا فَلَمْ يُغْنِيَا عَنْهُمَا مِنَ اللَّهِ شَيْئًا وَقِيلَ ادْخُلَا النَّارَ مَعَ الدَّاخِلِينَ } [التحريم: 10] .

وأما مضمون ما جرى له مع قومه مأخوذًا من الكتاب، والسنة، والآثار فقد قدمنا عن ابن عباس أنه كان بين آدم، ونوح عشرة قرون كلهم على الإسلام. رواه البخاري.

وذكرنا أن المراد بالقرن: الجيل، أو المدة على ما سلف، ثم بعد تلك القرون الصالحة حدثت أمور اقتضت أن آل الحال بأهل ذلك الزمان إلى عبادة الأصنام، وكان سبب ذلك ما رواه البخاري من حديث ابن جريج، عن عطاء، عن ابن عباس، عند تفسير قوله تعالى: { وَقَالُوا لَا تَذَرُنَّ آلِهَتَكُمْ وَلَا تَذَرُنَّ وَدًّا وَلَا سُوَاعًا وَلَا يَغُوثَ وَيَعُوقَ وَنَسْرًا } [نوح: 23] .

قال: هذه أسماء رجال صالحين من قوم نوح، فلما هلكوا أوحى الشيطان إلى قومهم أن انصبوا إلى مجالسهم التي كانوا يجلسون فيها أنصابا، وسموها بأسمائهم، ففعلوا فلم تعبد، حتى إذا هلك أولئك، وتنسخ العلم عبدت.

قال ابن عباس: وصارت هذه الأوثان التي كانت في قوم نوح في العرب بعد، وهكذا قال عكرمة، والضحاك، وقتادة، ومحمد بن إسحاق.

وقال ابن جرير في (تفسيره): حدثنا ابن حميد، حدثنا مهران، عن سفيان، عن موسى، عن محمد بن قيس قال: كانوا قوما صالحين بين آدم ونوح، وكان لهم أتباع يقتدون بهم، فلما ماتوا، قال أصحابهم الذين كانوا يقتدون بهم: لو صورناهم كان أشوق لنا إلى العبادة إذا ذكرناهم، فصوروهم، فلما ماتوا وجاء آخرون، دب إليهم إبليس فقال: إنما كانوا يعبدونهم، وبهم يسقون المطر، فعبدوهم.

وروى ابن أبي حاتم، عن عروة بن الزبير أنه قال: ود، ويغوث، ويعوق، وسواع، ونسر: أولاد آدم. وكان ود أكبرهم، وأبرهم به.

وقال ابن أبي حاتم: حدثنا أحمد بن منصور، حدثنا الحسن بن موسى، حدثنا يعقوب، عن أبي المطهر قال:

ذكروا عند أبي جعفر هو الباقر، وهو قائم يصلي يزيد بن المهلب قال:

فلما انفتل من صلاته قال: ذكرتم يزيد بن المهلب، أما إنه قتل في أول أرض عبد فيها غير الله.

قال: ذكر ودًا رجلًا صالحًا، وكان محبوبًا في قومه، فلما مات عكفوا حول قبره في أرض بابل، وجزعوا عليه، فلما رأى إبليس جزعهم عليه تشبه في صورة إنسان.

ثم قال: إني أرى جزعكم على هذا الرجل، فهل لكم أن أصور لكم مثله فيكون في ناديكم فتذكرونه؟

قالوا: نعم.

فصور لهم مثله.

قال: ووضعوه في ناديهم، وجعلوا يذكرونه، فلما رأى ما بهم من ذكره.

قال: هل لكم أن أجعل في منزل كل واحد منكم تمثالًا مثله ليكون له في بيته فتذكرونه؟

قالوا: نعم.

قال: فمثَّل لكل أهل بيت تمثالًا مثله، فأقبلوا فجعلوا يذكرونه به.

قال: وأدرك أبناؤهم، فجعلوا يرون ما يصنعون به، قال: وتناسلوا ودرس أثر ذكرهم إياه، حتى اتخذوه إلهًا يعبدونه من دون الله، أولاد أولادهم، فكان أول ما عبد غير الله (ود) الصنم، الذي سموه ودًا.

ومقتضى هذا السياق: أن كل صنم من هذه، عبده طائفة من الناس. وقد ذكر أنه لما تطاولت العهود والأزمان، جعلوا تلك الصور تماثيل مجسدة ليكون أثبت لهم، ثم عبدت بعد ذلك من دون الله عز وجل.

ولهم في عبادتها مسالك كثيرة جدًا، قد ذكرنها في مواضعها من كتابنا (التفسير)، ولله الحمد والمنة.

وقد ثبت في (الصحيحين) عن رسول الله ﷺ أنه لما ذكرت عنده أم سلمة، وأم حبيبة تلك الكنيسة التي رأينها بأرض الحبشة، يقال لها: مارية، فذكرتا من حسنها وتصاوير فيها، قال:

« أولئك إذا مات فيهم الرجل الصالح بنوا على قبره مسجدًا، ثم صوروا فيه تلك الصورة أولئك شرار الخلق عند الله عز وجل ».

والمقصود أن الفساد لما انتشر في الأرض، وعم البلاد بعبادة الأصنام فيها، بعث الله عبده ورسوله نوحًا عليه السلام، يدعو إلى عبادة الله وحده لا شريك له، وينهى عن عبادة ما سواه.

فكان أول رسول بعثه الله إلى أهل الأرض، كما ثبت في (الصحيحين) من حديث أبي حيان، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، عن النبي ﷺ في حديث الشفاعة قال:

« فيأتون آدم فيقولون: يا آدم أنت أبو البشر، خلقك الله بيده، ونفخ فيك من روحه، وأمر الملائكة فسجدوا لك، وأسكنك الجنة ألا تشفع لنا إلى ربك؟ ألا ترى ما نحن فيه وما بلغنا؟

فيقول: ربي قد غضب غضبًا شديدًا، لم يغضب قبله مثله، ولا يغضب بعده مثله، ونهاني عن الشجرة فعصيت، نفسي نفسي، اذهبوا إلى غيري، اذهبوا إلى نوح.

فيأتون نوحًا فيقولون: يا نوح أنت أول الرسل إلى أهل الأرض، وسماك الله عبدًا شكورًا، ألا ترى إلى ما نحن فيه؟ ألا ترى إلى ما بلغنا؟ ألا تشفع لنا إلى ربك عز وجل؟

فيقول: ربي قد غضب اليوم غضبًا لم يغضب قبله مثله، ولا يغضب بعده مثله، نفسي نفسي... ».

وذكر تمام الحديث بطوله كما أورده البخاري في قصة نوح.

فلما بعث الله نوحًا عليه السلام، دعاهم إلى إفراد العبادة لله وحده، لا شريك له، وأن لا يعبدوا معه صنمًا، ولا تمثالًا، ولا طاغوتًا، وأن يعترفوا بوحدانيته، وأنه لا إله غيره ولا رب سواه، كما أمر الله تعالى من بعده من الرسل، الذين هم كلهم من ذريته.

كما قال تعالى: { وَجَعَلْنَا ذُرِّيَتَهُ هُمُ البَاقِيْن } [الصافات: 77] .

وقال فيه، وفي إبراهيم: { وَجَعَلْنَا فِي ذُرِّيَّتِهِمَا النُّبُوَّةَ وَالْكِتَابَ } [الحديد: 26] . أي: كل نبي من بعد نوح، فمن ذريته وكذلك إبراهيم.

قال الله تعالى: { وَلَقَدْ بَعَثْنَا فِي كُلِّ أُمَّةٍ رَسُولًا أَنِ اُعْبُدُوا اللَّهَ وَاجْتَنِبُوا الطَّاغُوتَ } [النحل: 36] .

وقال تعالى: { وَاسْأَلْ مَنْ أَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رُسُلِنَا أَجَعَلْنَا مِنْ دُونِ الرَّحْمَنِ آلِهَةً يُعْبَدُونَ } [الزخرف: 45] .

وقال تعالى: { وَمَا أَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رَسُولٍ إِلَّا نُوحِي إِلَيْهِ أَنَّهُ لَا إِلَهَ إِلَّا أَنَا فَاعْبُدُونِ } [الأنبياء: 25] .

ولهذا قال نوح لقومه: { اعْبُدُوا اللَّهَ مَا لَكُمْ مِنْ إِلَهٍ غَيْرُهُ إِنِّي أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ عَظِيمٍ } [الأعراف: 59] .

وقال: { أَنْ لَا تَعْبُدُوا إِلَّا اللَّهَ إِنِّي أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ أَلِيمٍ } [هود: 26] .

وقال: { يَاقَوْمِ اعْبُدُوا اللَّهَ مَا لَكُمْ مِنْ إِلَهٍ غَيْرُهُ أَفَلَا تَتَّقُونَ } [المؤمنون: 23] .

وقال: { يَاقَوْمِ إِنِّي لَكُمْ نَذِيرٌ مُبِينٌ * أَنِ اعْبُدُوا اللَّهَ وَاتَّقُوهُ وَأَطِيعُونِ * يَغْفِرْ لَكُمْ مِنْ ذُنُوبِكُمْ وَيُؤَخِّرْكُمْ إِلَى أَجَلٍ مُسَمًّى إِنَّ أَجَلَ اللَّهِ إِذَا جَاءَ لَا يُؤَخَّرُ لَوْ كُنْتُمْ تَعْلَمُونَ * قَالَ رَبِّ إِنِّي دَعَوْتُ قَوْمِي لَيْلًا وَنَهَارًا * فَلَمْ يَزِدْهُمْ دُعَائِي إِلَّا فِرَارًا * وَإِنِّي كُلَّمَا دَعَوْتُهُمْ لِتَغْفِرَ لَهُمْ جَعَلُوا أَصَابِعَهُمْ فِي آذَانِهِمْ وَاسْتَغْشَوْا ثِيَابَهُمْ وَأَصَرُّوا وَاسْتَكْبَرُوا اسْتِكْبَارًا * ثُمَّ إِنِّي دَعَوْتُهُمْ جِهَارًا * ثُمَّ إِنِّي أَعْلَنْتُ لَهُمْ وَأَسْرَرْتُ لَهُمْ إِسْرَارًا * فَقُلْتُ اسْتَغْفِرُوا رَبَّكُمْ إِنَّهُ كَانَ غَفَّارًا * يُرْسِلِ السَّمَاءَ عَلَيْكُمْ مِدْرَارًا * وَيُمْدِدْكُمْ بِأَمْوَالٍ وَبَنِينَ وَيَجْعَلْ لَكُمْ جَنَّاتٍ وَيَجْعَلْ لَكُمْ أَنْهَارًا * مَا لَكُمْ لَا تَرْجُونَ لِلَّهِ وَقَارًا * وَقَدْ خَلَقَكُمْ أَطْوَارًا } [نوح: 2-14] الآيات الكريمات.

فذكر أنه دعاهم إلى الله بأنواع الدعوة في الليل، والنهار، والسر، والإجهار، بالترغيب تارة، والترهيب أخرى. وكل هذا فلم ينجح فيهم بل استمر أكثرهم على الضلالة والطغيان، وعبادة الأصنام والأوثان، ونصبوا له العداوة في كل وقت وأوان، وتنقصوه وتنقصوا من آمن به، وتوعدوهم بالرجم والإخراج، ونالوا منهم وبالغوا في أمرهم.

{ قَالَ المَلأُ مِنْ قَوْمِهِ } أي: السادة الكبراء منهم:

{ إِنَّا لَنَرَاكَ فِي ضَلَالٍ مُبِينٍ * قَالَ يَاقَوْمِ لَيْسَ بِي ضَلَالَةٌ وَلَكِنِّي رَسُولٌ مِنْ رَبِّ الْعَالَمِينَ } [الأعراف:60-61] أي: لست كما تزعمون من أني ضال، بل على الهدى المستقيم، رسول من رب العالمين أي: الذي يقول للشيء كن فيكون.

{ أُبَلِّغُكُمْ رِسَالَاتِ رَبِّي وَأَنْصَحُ لَكُمْ وَأَعْلَمُ مِنَ اللَّهِ مَا لَا تَعْلَمُونَ } [الأعراف: 62] وهذا شأن الرسول أن يكون بليغًا أي فصيحًا ناصحًا، أعلم الناس بالله عز وجل.

وقالوا له فيما قالوا: { فَقَالَ الْمَلَأُ الَّذِينَ كَفَرُوا مِنْ قَوْمِهِ مَا نَرَاكَ إِلَّا بَشَرًا مِثْلَنَا وَمَا نَرَاكَ اتَّبَعَكَ إِلَّا الَّذِينَ هُمْ أَرَاذِلُنَا بَادِيَ الرَّأْيِ وَمَا نَرَى لَكُمْ عَلَيْنَا مِنْ فَضْلٍ بَلْ نَظُنُّكُمْ كَاذِبِينَ } [هود: 27] ، تعجبوا أن يكون بشرًا رسولًا، وتنقصوا بمن اتبعه، ورأوهم أراذلهم.

وقد قيل: إنهم كانوا من أقياد الناس، وهم ضعفاؤهم كما قال هرقل وهم أتباع الرسل، وما ذاك إلا لأنه لا مانع لهم من اتباع الحق.

وقولهم: « بادي الرأي » أي: بمجرد ما دعوتهم استجابوا لك من غير نظر ولا روية، وهذا الذي رموهم به هو عين ما يمدحون بسببه رضي الله عنهم، فإن الحق الظاهر لا يحتاج إلى روية، ولا فكر، ولا نظر، بل يجب اتباعه والانقياد له متى ظهر.

ولهذا قال رسول الله ﷺ مادحًا للصديق:

« ما دعوت أحدًا إلى الإسلام إلا كانت له كبوة غير أبي بكر فإنه لم يتلعثم » ولهذا كانت بيعته يوم السقيفة أيضًا سريعة من غير نظر، ولا روية، لأن أفضليته على من عداه ظاهرة جلية عند الصحابة رضي الله عنهم.

ولهذا قال رسول الله ﷺ لما أراد أن يكتب الكتاب الذي أراد أن ينص فيه على خلافته فتركه، وقال:

« يأبى الله والمؤمنون إلا أبا بكر » رضي الله عنه.

وقول كفرة قوم نوح له ولمن آمن به: { وَمَا نَرَى لَكُمْ عَلَيْنَا مِنْ فَضْلٍ } [هود: 27] أي: لم يظهر لكم أمر بعد اتصافكم بالإيمان، ولا مزية علينا { بَلْ نَظُنُّكُمْ كَاذِبِينَ * قَالَ يَاقَوْمِ أَرَأَيْتُمْ إِنْ كُنْتُ عَلَى بَيِّنَةٍ مِنْ رَبِّي وَآتَانِي رَحْمَةً مِنْ عِنْدِهِ فَعُمِّيَتْ عَلَيْكُمْ أَنُلْزِمُكُمُوهَا وَأَنْتُمْ لَهَا كَارِهُونَ } [هود:27- 28] .

وهذا تلطف في الخطاب معهم، وترفق بهم في الدعوة إلى الحق، كما قال تعالى: { فَقُولَا لَهُ قَوْلًا لَيِّنًا لَعَلَّهُ يَتَذَكَّرُ أَوْ يَخْشَى } [طه: 44] .

وقال تعالى: { ادْعُ إِلَى سَبِيلِ رَبِّكَ بِالْحِكْمَةِ وَالْمَوْعِظَةِ الْحَسَنَةِ وَجَادِلْهُمْ بِالَّتِي هِيَ أَحْسَنُ } [النحل: 125] .

وهذا منه يقول لهم: { أَرَأَيْتُمْ إِنْ كُنْتُ عَلَى بَيِّنَةٍ مِنْ رَبِّي وَآتَانِي رَحْمَةً مِنْ عِنْدِهِ } [هود: 28] أي: النبوة والرسالة.

{ فَعُمِّيَتْ عَلَيْكُمْ } أي: فلم تفهموها، ولم تهتدوا إليها.

{ أَنُلْزِمُكُمُوهَا } أي: أنغصبكم بها، ونجبركم عليها.

{ وَأَنْتُمْ لَهَا كَارِهُونَ } أي: ليس لي فيكم حيلة، والحالة هذه.

{ وَيَا قَوْمِ لَا أَسْأَلُكُمْ عَلَيْهِ مَالًا إِنْ أَجْرِيَ إِلَّا عَلَى } [هود: 29] أي: لست أريد منكم أجرة على إبلاغي إياكم، ما ينفعكم في دنياكم، وأخراكم، إن أطلب ذلك إلا من الله، الذي ثوابه خير لي، وأبقى مما تعطونني أنتم.

وقوله: { اللَّهِ وَمَا أَنَا بِطَارِدِ الَّذِينَ آمَنُوا إِنَّهُمْ مُلَاقُو رَبِّهِمْ وَلَكِنِّي أَرَاكُمْ قَوْمًا } [هود: 29] كأنهم طلبوا منه أن يبعد هؤلاء عنه، ووعدوه أن يجتمعوا به إذا هو فعل ذلك، فأبى عليهم ذلك.

وقال: { إِنَّهُمْ مُلَاقُو رَبِّهِمْ } أي: فأخاف إن طردتهم أن يشكوني إلى الله عز وجل.

ولهذا قال: { وَيَا قَوْمِ مَنْ يَنْصُرُنِي مِنَ اللَّهِ إِنْ طَرَدْتُهُمْ أَفَلَا }

ولهذا لما سأل كفار قريش رسول الله ﷺ، أن يطرد عنه ضعفاء المؤمنين كعمار، وصهيب، وبلال، وخباب، وأشباههم، نهاه الله عن ذلك، كما بيناه في سورتي الأنعام والكهف.

{ وَلَا أَقُولُ لَكُمْ عِنْدِي خَزَائِنُ اللَّهِ وَلَا أَعْلَمُ الْغَيْبَ وَلَا أَقُولُ إِنِّي مَلَكٌ } أي: بل أنا عبد رسول، لا أعلم من علم الله، إلا ما أعلمني به، ولا أقدر إلا على ما أقدرني عليه، ولا أملك لنفسي نفعًا ولا ضرًا إلا ما شاء الله.

{ وَلَا أَقُولُ لِلَّذِينَ تَزْدَرِي أَعْيُنُكُمْ } يعني من أتباعه.

{ لَنْ يُؤْتِيَهُمُ اللَّهُ خَيْرًا اللَّهُ أَعْلَمُ بِمَا فِي أَنْفُسِهِمْ إِنِّي إِذًا لَمِنَ الظَّالِمِينَ } أي: لا أشهد عليهم بأنهم لا خير لهم، عند الله يوم القيامة، الله أعلم بهم، وسيجازيهم على ما في نفوسهم، إن خيرًا فخير، وإن شرًا فشر.

كما قالوا في المواضع الأخر: {..أَنُؤْمِنُ لَكَ وَاتَّبَعَكَ الْأَرْذَلُونَ * قَالَ وَمَا عِلْمِي بِمَا كَانُوا يَعْمَلُونَ * إِنْ حِسَابُهُمْ إِلَّا عَلَى رَبِّي لَوْ تَشْعُرُونَ * وَمَا أَنَا بِطَارِدِ الْمُؤْمِنِينَ * إِنْ أَنَا إِلَّا نَذِيرٌ مُبِينٌ » [الشعراء: 111 - 115] .

وقد تطاول الزمان، والمجادلة بينه وبينهم، كما قال تعالى: { فَلَبِثَ فِيهِمْ أَلْفَ سَنَةٍ إِلَّا خَمْسِينَ عَامًا فَأَخَذَهُمُ الطُّوفَانُ وَهُمْ ظَالِمُونَ } [العنكبوت: 14] .

أي: ومع هذه المدة الطويلة، فما آمن به إلا القليل منهم، وكان كل ما انقرض جيل، وصُّوا من بعدهم بعدم الإيمان به، ومحاربته، ومخالفته.

وكان الوالد إذا بلغ ولده، وعقل عنه كلامه، وصَّاه فيما بينه وبينه، أن لا يؤمن بنوح أبدًا، ما عاش، ودائمًا ما بقي، وكانت سجاياهم تأبى الإيمان، واتباع الحق، ولهذا قال: { وَلَا يَلِدُوْا إِلَّا فَاجِرًَا كَفَّارًَا }.

ولهذا قالوا: { قَالُوا يَانُوحُ قَدْ جَادَلْتَنَا فَأَكْثَرْتَ جِدَالَنَا فَأْتِنَا بِمَا تَعِدُنَا إِنْ كُنْتَ مِنَ الصَّادِقِينَ * قَالَ إِنَّمَا يَأْتِيكُمْ بِهِ اللَّهُ إِنْ شَاءَ وَمَا أَنْتُمْ بِمُعْجِزِينَ } [هود: 32 - 33] .

أي: إنما يقدر على ذلك الله عز وجل، فإنه الذي لا يعجزه شيء، ولا يكترثه أمر، بل هو الذي يقول للشيء كن فيكون.

{ وَلَا يَنْفَعُكُمْ نُصْحِي إِنْ أَرَدْتُ أَنْ أَنْصَحَ لَكُمْ إِنْ كَانَ اللَّهُ يُرِيدُ أَنْ يُغْوِيَكُمْ هُوَ رَبُّكُمْ وَإِلَيْهِ تُرْجَعُونَ } [هود: 34] .

أي: من يرد الله فتنته، فلن يملك أحد هدايته، هو الذي يهدي من يشاء، ويضل من يشاء، وهو الفعال لما يريد، وهو العزيز الحكيم العليم، بمن يستحق الهداية، ومن يستحق الغواية. وله الحكمة البالغة، والحجة الدامغة.

{ وَأُوحِيَ إِلَى نُوحٍ أَنَّهُ لَنْ يُؤْمِنَ مِنْ قَوْمِكَ إِلَّا مَنْ قَدْ آمَنَ } [هود: 36] تسلية له عما كان منهم إليه.

{ فَلَا تَبْتَئِسْ بِمَا كَانُوا يَفْعَلُونَ } وهذه تعزية لنوح عليه السلام، في قومه أنه لن يؤمن منهم إلا من قد آمن أي لا يسوأنك ما جرى؛ فإن النصر قريب والنبأ عجيب.

{ وَاصْنَعِ الْفُلْكَ بِأَعْيُنِنَا وَوَحْيِنَا وَلَا تُخَاطِبْنِي فِي الَّذِينَ ظَلَمُوا إِنَّهُمْ مُغْرَقُونَ } [هود: 37] وذلك أن نوحًا عليه السلام، لما يئس من صلاحهم، وفلاحهم، ورأى أنهم لا خير فيهم، وتوصلوا إلى أذيته ومخالفته، وتكذيبه، بكل طريق من فعال، ومقال، دعا عليهم دعوة غضب، فلبى الله دعوته، وأجاب طلبته، قال الله تعالى: { وَلَقَدْ نَادَانَا نُوحٌ فَلَنِعْمَ الْمُجِيبُونَ * وَنَجَّيْنَاهُ وَأَهْلَهُ مِنَ الْكَرْبِ الْعَظِيمِ } [الصافات: 75 - 76] .

وقال تعالى: { وَنُوحًا إِذْ نَادَى مِنْ قَبْلُ فَاسْتَجَبْنَا لَهُ فَنَجَّيْنَاهُ وَأَهْلَهُ مِنَ الْكَرْبِ الْعَظِيمِ } [الأنبياء: 76] .

وقال تعالى: { قَالَ رَبِّ إِنَّ قَوْمِي كَذَّبُونِ * فَافْتَحْ بَيْنِي وَبَيْنَهُمْ فَتْحًا وَنَجِّنِي وَمَنْ مَعِيَ مِنَ الْمُؤْمِنِينَ } [الشعراء: 117] .

وقال تعالى: { فَدَعَا رَبَّهُ أَنِّي مَغْلُوبٌ فَانْتَصِرْ } [القمر: 10] .

وقال تعالى: { قَالَ رَبِّ انْصُرْنِي بِمَا كَذَّبُونِ } [المؤمنون: 39] .

وقال تعالى: { مِمَّا خَطِيئَاتِهِمْ أُغْرِقُوا فَأُدْخِلُوا نَارًا فَلَمْ يَجِدُوا لَهُمْ مِنْ دُونِ اللَّهِ أَنْصَارًا * وَقَالَ نُوحٌ رَبِّ لَا تَذَرْ عَلَى الْأَرْضِ مِنَ الْكَافِرِينَ دَيَّارًا * إِنَّكَ إِنْ تَذَرْهُمْ يُضِلُّوا عِبَادَكَ وَلَا يَلِدُوا إِلَّا فَاجِرًا كَفَّارًا } [نوح: 25 - 27] .

فاجتمع عليهم خطاياهم من كفرهم، وفجورهم، ودعوة نبيهم عليهم، فعند ذلك أمره الله تعالى أن يصنع الفلك؛ وهي السفينة العظيمة التي لم يكن لها نظير قبلها، ولا يكون بعدها مثلها.

وقدم الله تعالى إليه أنه: إذا جاء أمره، وحلَّ بهم بأسه، الذي لا يرد عن القوم المجرمين، أنه لا يعاوده فيهم، ولا يراجعه، فإنه لعله قد تدركه رقة على قومه عند معاينة العذاب النازل بهم، فإنه ليس الخبر كالمعاينة، ولهذا قال: { وَلَا تُخَاطِبْنِي فِي الَّذِينَ ظَلَمُوا إِنَّهُمْ مُغْرَقُونَ * وَيَصْنَعُ الْفُلْكَ وَكُلَّمَا مَرَّ عَلَيْهِ مَلَأٌ مِنْ قَوْمِهِ سَخِرُوا مِنْهُ } [هود: 37- 38] .

أي: يستهزئون به استعباد الوقوع ما توعدهم به.

{ قَالَ إِنْ تَسْخَرُوا مِنَّا فَإِنَّا نَسْخَرُ مِنْكُمْ كَمَا تَسْخَرُونَ } [هود: 38] .

أي: نحن الذين نسخر منكم، ونتعجب منكم، في استمراركم على كفركم، وعنادكم، الذي يقتضي وقوع العذاب بكم، وحلوله عليكم.

{ فسوف تعلمون من يأتيه عذاب يخزيه، ويحل عليه عذاب مقيم } [هود: 39] .

وقد كانت سجاياهم: الكفر الغليظ، والعناد البالغ في الدنيا. وهكذا في الآخرة، فإنهم يجحدون أيضًا، أن يكون جاءهم رسول.

كما قال البخاري: حدثنا موسى بن إسماعيل، حدثنا عبد الواحد بن زياد، حدثنا الأعمش عن أبي صالح، عن أبي سعيد، قال: قال رسول الله ﷺ:

« يجيء نوح عليه السلام وأمته، فيقول الله عز وجل: هل بلغت؟

فيقول: نعم أي رب.

فيقول لأمته: هل بلغكم؟

فيقولون: لا ما جاءنا من نبي.

فيقول لنوح: من يشهد لك؟

فيقول: محمد وأمته، فتشهد أنه قد بلغ »

وهو قوله: { وَكَذَلِكَ جَعَلْنَاكُمْ أُمَّةً وَسَطًا لِتَكُونُوا شُهَدَاءَ عَلَى النَّاسِ وَيَكُونَ الرَّسُولُ عَلَيْكُمْ شَهِيدًا } [البقرة: 143] .

والوسط: العدل. فهذه الأمة تشهد على شهادة نبيها الصادق، المصدوق، بأن الله قد بعث نوحًا بالحق، وأنزل عليه الحق، وأمره به، وأنه بلغه إلى أمته، على أكمل الوجوه وأتمها، ولم يدع شيئًا مما ينفعهم في دينهم، إلا وقد أمرهم به، ولا شيئًا مما قد يضرهم، إلا وقد نهاهم عنه، وحذرهم منه.

وهكذا شأن جميع الرسل، حتى أنه حذر قومه المسيح الدجال، وإن كان لا يتوقع خروجه في زمانهم، حذرًا عليهم، وشفقة، ورحمة بهم.

كما قال البخاري: حدثنا عبدان، حدثنا عبد الله، عن يونس، عن الزهري، قال سالم: قال ابن عمر: قام رسول الله ﷺ في الناس، فأثنى على الله بما هو أهله، ثم ذكر الدجال، فقال:

« إني لأنذركموه، وما من نبي إلا وقد أنذره قومه. لقد أنذره نوح قومه ولكني أقول لكم فيه قولًا لم يقله نبي لقومه، تعلمون أنه أعور، وأن الله ليس بأعور ».

وهذا الحديث في (الصحيحين) أيضًا، من حديث شيبان بن عبد الرحمن، عن يحيى بن أبي كثير، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، عن النبي ﷺ قال:

« ألا أحدثكم عن الدجال حديثًا، ما حدث به نبي قومه أنه أعور، وأنه يجيء معه بمثال الجنة، والنار، والتي يقول عليها الجنة هي النار، وإني أنذركم كما أنذر به نوح قومه ». لفظ البخاري.

وقد قال بعض علماء السلف: لما استجاب الله له أمره، أن يغرس شجرًا ليعمل منه السفينة، فغرسه وانتظره مائة سنة، ثم نجره في مائة أخرى، وقيل: في أربعين سنة، فالله أعلم.

قال محمد بن إسحق، عن الثوري: وكان من خشب الساج.

وقيل: من الصنوبر. وهو نص التوراة.

قال الثوري: وأمره أن يجعل طولها ثمانين ذراعًا، وعرضها خمسين ذراعاَ، وأن يطلى ظاهرها وباطنها بالقار، وأن يجعل لها جؤجؤًا أزور يشق الماء.

وقال قتادة: كان طولها ثلاثمائة ذراع، في عرض خمسين ذراعًا، وهذا الذي في التوراة، على ما رأيته.

وقال الحسن البصري: ستمائة في عرض ثلاثمائة.

وعن ابن عباس: ألف ومائتا ذراع، في عرض ستمائة ذراع.

وقيل: كان طولها ألفي ذراع، وعرضها مائة ذراع.

قالوا كلهم: وكان ارتفاعها ثلاثين ذراعًا، وكانت ثلاث طبقات، كل واحدة عشر أذرع؛ فالسفلى: للدواب، والوحوش، والوسطى: للناس، والعليا: للطيور. وكان بابها في عرضها، ولها غطاء من فوقها، مطبق عليها.

قال الله تعالى: { قَالَ رَبِّ انْصُرْنِي بِمَا كَذَّبُونِ * فَأَوْحَيْنَا إِلَيْهِ أَنِ اصْنَعِ الْفُلْكَ بِأَعْيُنِنَا وَوَحْيِنَا } [المؤمنون: 26 - 27] .

أي: بأمرنا لك، وبمرأى منا لصنعتك لها، ومشاهدتنا لذلك لنرشدك إلى الصواب في صنعتها.

{ فَإِذَا جَاءَ أَمْرُنَا وَفَارَ التَّنُّورُ فَاسْلُكْ فِيهَا مِنْ كُلٍّ زَوْجَيْنِ اثْنَيْنِ وَأَهْلَكَ إِلَّا مَنْ سَبَقَ عَلَيْهِ الْقَوْلُ مِنْهُمْ وَلَا تُخَاطِبْنِي فِي الَّذِينَ ظَلَمُوا إِنَّهُمْ مُغْرَقُونَ } [المؤمنون: 27] .

فتقدم إليه بأمره العظيم العالي، أنه إذا جاء أمره، وحلَّ بأسه، أن يحمل في هذه السفينة، من كل زوجين اثنين من الحيوانات، وسائر ما فيه روح من المأكولات وغيرها، لبقاء نسلها، وأن يحمل معه أهله، أي أهل بيته إلا من سبق عليه القول منهم: أي إلا من كان كافرًا فإنه قد نفذت فيه الدعوة التي لا ترد، ووجب عليه حلول البأس الذي لا يرد، وأمر أنه لا يراجعه فيهم إذا حل بهم ما يعاينه من العذاب العظيم، الذي قد حتمه عليهم الفعال لما يريد، كما قدمنا بيانه قبل.

والمراد بالتنور عند الجمهور: وجه الأرض أي نبعت الأرض من سائر أرجائها، حتى نبعت التنانير التي هي محال النار.

وعن ابن عباس: التنور عين في الهند.

وعن الشعبي: بالكوفة.

وعن قتادة: بالجزيرة.

وقال علي بن أبي طالب: المراد بالتنور فلق الصبح، وتنوير الفجر، أي إشراقه وضياؤه، أي عند ذلك: فاحمل فيها من كل زوجين اثنين، وهذا قول غريب.

وقوله تعالى: { حَتَّى إِذَا جَاءَ أَمْرُنَا وَفَارَ التَّنُّورُ قُلْنَا احْمِلْ فِيهَا مِنْ كُلٍّ زَوْجَيْنِ اثْنَيْنِ وَأَهْلَكَ إِلَّا مَنْ سَبَقَ عَلَيْهِ الْقَوْلُ وَمَنْ آمَنَ وَمَا آمَنَ مَعَهُ إِلَّا قَلِيلٌ } [هود: 40] .

هذا أمر بأن عند حلول النقمة بهم، أن يحمل فيها من كل زوجين اثنين.

وفي كتاب أهل الكتاب: أنه أُمر أن يحمل من كل ما يؤكل سبعة أزواج، ومما لا يؤكل زوجين ذكرًا وأنثى، وهذا مغاير لمفهوم قوله تعالى في كتابنا الحق اثنين إن جعلنا ذلك مفعولًا به، وأما إن جعلناه توكيدًا لزوجين، والمفعول به محذوف، فلا ينافي، والله أعلم.

وذكر بعضهم، ويروى عن ابن عباس: أن أول ما دخل من الطيور الدرة، وآخر ما دخل من الحيوانات الحمار. ودخل إبليس متعلقًا بذنب الحمار.

وقال ابن أبي حاتم: حدثنا أبي، حدثنا عبد الله بن صالح، حدثني الليث، حدثني هشام بن سعد، عن زيد بن أسلم، عن أبيه، أن رسول الله ﷺ قال:

« لما حمل نوح في السفينة من كل زوجين اثنين، قال أصحابه: وكيف نطمئن، أو كيف تطمئن المواشي ومعنا الأسد؟

فسلط الله عليه الحمى، فكانت أول حمى نزلت في الأرض.

ثم شكوا الفارة، فقالوا: الفويسقة تفسد علينا طعامنا ومتاعنا.

فأوحى الله إلى الأسد فعطس، فخرجت الهرة منه، فتخبأت الفأرة منها ». هذا مرسل.

وقوله { وَأَهْلَكَ إِلَّا مَنْ سَبَقَ عَلَيْهِ الْقَوْلُ } أي: من استجيبت فيهم الدعوة النافذة، ممن كفر، فكان منهم ابنه يام الذي غرق، كما سيأتي بيانه.

{ وَمَنْ آمَنَ } أي: واحمل فيها من آمن بك من أمتك.

قال الله تعالى: { وَمَا آمَنَ مَعَهُ إِلَّا قَلِيلٌ } هذا مع طول المدة والمقام بين أظهرهم، ودعوتهم الأكيدة، ليلًا ونهارًا بضروب المقال، وفنون التلطفات، والتهديد والوعيد تارة، والترغيب والوعد أخرى.

وقد اختلف العلماء في عدة من كان معه في السفينة؛ فعن ابن عباس كانوا ثمانين نفسًا معهم نساؤهم.

وعن كعب الأحبار كانوا اثنين وسبعين نفسًا.

وقيل: كانوا عشرة.

وقيل: إنما كانوا نوحًا وبنيه الثلاثة، وكنائنته الأربع، بامرأة يام، الذي انخزل، وانعزل، وسلل عن طريق النجاة، فما عدل إذ عدل.

وهذا القول فيه مخالفة لظاهر الآية، بل هي نص في أنه قد ركب معه غير أهله، طائفة ممن آمن به.

كما قال: { وَنَجِّنِي وَمَنْ مَعِيَ مِنَ الْمُؤْمِنِينَ } [الشعراء: 118] .

وقيل: كانوا سبعة.

وأما امرأة نوح، وهي أم أولاده كلهم وهم: حام، وسام، ويافث، ويام، وتسميه أهل الكتاب: كنعان، وهو الذي قد غرق، وعابر، وقد ماتت قبل الطوفان.

قيل: إنها غرقت مع من غرق، وكانت ممن سبق عليه القول لكفرها، وعند أهل الكتاب أنها كانت في السفينة، فيحتمل أنها كفرت بعد ذلك، أو أنها أنظرت ليوم القيامة، والظاهر الأول.

قوله: {... لَا تَذَرْ عَلَى الْأَرْضِ مِنَ الْكَافِرِينَ دَيَّارًا }.

قال الله تعالى: { فَإِذَا اسْتَوَيْتَ أَنْتَ وَمَنْ مَعَكَ عَلَى الْفُلْكِ فَقُلِ الْحَمْدُ لِلَّهِ الَّذِي نَجَّانَا مِنَ الْقَوْمِ الظَّالِمِينَ * وَقُلْ رَبِّ أَنْزِلْنِي مُنْزَلًا مُبَارَكًا وَأَنْتَ خَيْرُ الْمُنْزِلِينَ } [المؤمنون: 28 - 29] .

أمره أن يحمد ربه، على ما سخر له من هذه السفينة، فنجاه بها، وفتح بينه وبين قومه، وأقر عينه ممن خالفه وكذبه، كما قال تعالى: { وَالَّذِي خَلَقَ الْأَزْوَاجَ كُلَّهَا وَجَعَلَ لَكُمْ مِنَ الْفُلْكِ وَالْأَنْعَامِ مَا تَرْكَبُونَ * لِتَسْتَوُوا عَلَى ظُهُورِهِ ثُمَّ تَذْكُرُوا نِعْمَةَ رَبِّكُمْ إِذَا اسْتَوَيْتُمْ عَلَيْهِ وَتَقُولُوا سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ * وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ } [الزخرف:12 - 14]

وهكذا يؤمر بالدعاء في ابتداء الأمور، أن يكون على الخير والبركة، وأن تكون عاقبتها محمودة، كما قال تعالى لرسوله ﷺ، حين هاجر: { وَقُلْ رَبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ وَاجْعَلْ لِي مِنْ لَدُنْكَ سُلْطَانًا نَصِيرًا } [الإسراء: 80] .

وقد امتثل نوح عليه السلام هذه الوصية { وَقَالَ ارْكَبُوا فِيهَا بِسْمِ اللَّهِ مَجْرَاهَا وَمُرْسَاهَا إِنَّ رَبِّي لَغَفُورٌ رَحِيمٌ } [هود: 41] .

أي: على اسم الله ابتداء سيرها، وانتهاؤه.

{ إِنَّ رَبِّي لَغَفُورٌ رَحِيمٌ } أي: وذو عقاب أليم، مع كونه غفورًا رحيمًا، لا يرد بأسه عن القوم المجرمين. كما أحل بأهل الأرض، الذين كفروا به، وعبدوا غيره.

قال الله تعالى: { وَهِيَ تَجْرِي بِهِمْ فِي مَوْجٍ كَالْجِبَالِ } وذلك أن الله تعالى أرسل من السماء مطرًا، لم تعهده الأرض قبله، ولا تمطره بعده، كان كأفواه القرب، وأمر الأرض فنبعت من جميع فجاجها، وسائر أرجائها، كما قال تعالى: { فَدَعَا رَبَّهُ أَنِّي مَغْلُوبٌ فَانْتَصِرْ * فَفَتَحْنَا أَبْوَابَ السَّمَاءِ بِمَاءٍ مُنْهَمِرٍ * وَفَجَّرْنَا الْأَرْضَ عُيُونًا فَالْتَقَى الْمَاءُ عَلَى أَمْرٍ قَدْ قُدِرَ * وَحَمَلْنَاهُ عَلَى ذَاتِ أَلْوَاحٍ وَدُسُرٍ } [القمر: 10 - 13] .

والدسر: السائر تجري بأعيننا، أي: بحفظنا، وكلاءتنا، وحراستنا، ومشاهدتنا لها جزاء لمن كان كفر.

وقد ذكر ابن جرير، وغيره، أن الطوفان كان في ثالث عشر، شهر آب، في حساب القبط.

وقال تعالى: { إِنَّا لَمَّا طَغَى الْمَاءُ حَمَلْنَاكُمْ فِي الْجَارِيَةِ } [الحاقة: 11] أي: السفينة.

{ لِنَجْعَلَهَا لَكُمْ تَذْكِرَةً وَتَعِيَهَا أُذُنٌ وَاعِيَةٌ } [الحاقة: 12] .

قال جماعة من المفسرين: ارتفع الماء على أعلى جبل بالأرض، خمسة عشر ذراعًا، وهو الذي عند أهل الكتاب.

وقيل: ثمانين ذراعًا، وعمَّ جميع الأرض طولها والعرض، سهلها، وحزنها، وجبالها، وقفارها، ورمالها، ولم يبق على وجه الأرض، ممن كان بها من الأحياء، عين تطرف، ولا صغير، ولا كبير.

قال الإمام مالك، عن زيد بن أسلم: كان أهل ذلك الزمان، قد ملؤوا السهل، والجبل.

وقال عبد الرحمن بن زيد بن أسلم: لم تكن بقعة في الأرض، إلا ولها مالك، وحائز. رواهما ابن أبي حاتم.

{ وَنَادَى نُوحٌ ابْنَهُ وَكَانَ فِي مَعْزِلٍ يَابُنَيَّ ارْكَبْ مَعَنَا وَلَا تَكُنْ مَعَ الْكَافِرِينَ * قَالَ سَآوِي إِلَى جَبَلٍ يَعْصِمُنِي مِنَ الْمَاءِ قَالَ لَا عَاصِمَ الْيَوْمَ مِنْ أَمْرِ اللَّهِ إِلَّا مَنْ رَحِمَ وَحَالَ بَيْنَهُمَا الْمَوْجُ فَكَانَ مِنَ الْمُغْرَقِينَ } [هود: 42 - 43] .

وهذا الابن هو: يام أخو سام، وحام، ويافث. وقيل اسمه كنعان.

وكان كافرًا عمل عملًا غير صالح، فخالف أباه في دينه ومذهبه، فهلك مع من هلك.

هذا وقد نجا مع أبيه، الأجانب في النسب، لما كانوا موافقين في الدين والمذهب.

{ وَقِيلَ يَاأَرْضُ ابْلَعِي مَاءكِ وَيَا سَمَاءُ أَقْلِعِي وَغِيضَ الْمَاءُ وَقُضِيَ الْأَمْرُ وَاسْتَوَتْ عَلَى الْجُودِيِّ الْجُودِيِّ وَقِيلَ بُعْدًا لِلْقَوْمِ لِلْقَوْمِ الظَّالِمِينَ } [هود: 44] .

أي: لما فرغ من أهل الأرض، ولم يبق منها أحد ممن عبد غير الله عز وجل، أمر الله الأرض أن تبلع ماءها، وأمر السماء أن تقلع أي تمسك عن المطر.

{ وَغِيضَ الْمَاءُ } أي: نقص عما كان.

{ وَقُضِيَ الَأمْرُ } أي: وقع بهم الذي كان قد سبق في علمه، وقدره من إحلاله بهم ما حل بهم.

{ وَقِيلَ بُعْدًا لِلْقَوْمِ الظَّالِمِينَ } أي: نودي عليهم بلسان القدرة بعدًا لهم من الرحمة والمغفرة.

كما قال تعالى: { فَكَذَّبُوهُ فَأَنْجَيْنَاهُ وَالَّذِينَ مَعَهُ فِي الْفُلْكِ وَأَغْرَقْنَا الَّذِينَ كَذَّبُوا بِآيَاتِنَا إِنَّهُمْ كَانُوا قَوْمًا عَمِينَ } [الأعراف: 64] .

وقال تعالى: { فَكَذَّبُوهُ فَنَجَّيْنَاهُ وَمَنْ مَعَهُ فِي الْفُلْكِ وَجَعَلْنَاهُمْ خَلَائِفَ وَأَغْرَقْنَا الَّذِينَ كَذَّبُوا بِآيَاتِنَا فَانْظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُنْذَرِينَ } [يونس: 73] .

وقال تعالى: { وَنَصَرْنَاهُ مِنَ الْقَوْمِ الَّذِينَ كَذَّبُوا بِآيَاتِنَا إِنَّهُمْ كَانُوا قَوْمَ سَوْءٍ فَأَغْرَقْنَاهُمْ أَجْمَعِينَ } [الأنبياء: 77] .

وقال تعالى: { فَأَنْجَيْنَاهُ وَمَنْ مَعَهُ فِي الْفُلْكِ الْمَشْحُونِ * ثُمَّ أَغْرَقْنَا بَعْدُ الْبَاقِينَ * إِنَّ فِي ذَلِكَ لَآيَةً وَمَا كَانَ أَكْثَرُهُمْ مُؤْمِنِينَ * وَإِنَّ رَبَّكَ لَهُوَ الْعَزِيزُ الرَّحِيمُ } [الشعراء: 119-122] .

وقال تعالى: { فأنجيناه وأصحاب السفينة وجعلناها آية للعالمين }

وقال تعالى: { ثُمَّ أَغْرَقْنَا الآخَرِيْنَ }.

وقال: { وَلَقَدْ تَرَكْنَاهَا آيَةً فَهَلْ مِنْ مُدَّكِرٍ * فَكَيْفَ كَانَ عَذَابِي وَنُذُرِ * وَلَقَدْ يَسَّرْنَا الْقُرْآنَ لِلذِّكْرِ فَهَلْ مِنْ مُدَّكِرٍ } [القمر: 15-17] .

وقال تعالى: { مِمَّا خَطِيئَاتِهِمْ أُغْرِقُوا فَأُدْخِلُوا نَارًا فَلَمْ يَجِدُوا لَهُمْ مِنْ دُونِ اللَّهِ أَنْصَارًا * وَقَالَ نُوحٌ رَبِّ لَا تَذَرْ عَلَى الْأَرْضِ مِنَ الْكَافِرِينَ دَيَّارًا * إِنَّكَ إِنْ تَذَرْهُمْ يُضِلُّوا عِبَادَكَ وَلَا يَلِدُوا إِلَّا فَاجِرًا كَفَّارًا } [نوح: 25-27] وقد استجاب الله تعالى - وله الحمد والمنة - دعوته فلم يبق منهم عين تطرف.

وقد روى الإمامان: أبو جعفر بن جرير، وأبو محمد بن أبي حاتم في تفسيريهما من طريق يعقوب بن محمد الزهري، عن قائد مولى عبد الله بن أبي رافع، أن إبراهيم بن عبد الرحمن بن أبي ربيعة أخبره، أن عائشة أم المؤمنين أخبرته، أن رسول الله ﷺ قال:

« فلو رحم الله من قوم نوح أحدًا لرحم أم الصبي ».

قال رسول الله ﷺ:

« مكث نوح عليه السلام في قومه ألف سنة - يعني إلا خمسين عامًا - وغرس مائة سنة الشجر، فعظمت وذهبت كل مذهب، ثم قطعها، ثم جعلها سفينة، ويمرون عليه ويسخرون منه.

ويقولون: تعمل سفينة في البر كيف تجري؟

قال: سوف تعلمون.

فلما فرغ ونبع الماء وصار في السكك، خشيت أم الصبي عليه، وكانت تحبه حبًا شديدًا، خرجت به إلى الجبل حتى بلغت ثلثه، فلما بلغها الماء خرجت به حتى استوت على الجبل، فلما بلغ الماء رقبتها رفعته بيديها فغرقا، فلو رحم الله منهم أحدًا لرحم أم الصبي ». وهذا حديث غريب.

وقد روي عن كعب الأحبار، ومجاهد، وغير واحد شبيه لهذه القصة.

وأحرى بهذا الحديث أن يكون موقوفًا، متلقى عن مثل كعب الأحبار، والله أعلم.

والمقصود: أن الله لم يبقِ من الكافرين ديارًا، فكيف يزعم بعض المفسرين أن عوج بن عنق، ويقال: ابن عناق كان موجودًا من قبل نوح إلى زمان موسى، ويقولون: كان كافرًا متمردًا جبارًا عنيدًا.

ويقولون: كان لغير رشده، بل ولدته أمه عنق بنت آدم من زنا، وإنه كان يأخذ من طوله السمك من قرار البحار، ويشويه في عين الشمس، وإنه كان يقول لنوح وهو في السفينة: ما هذه القصيعة التي لك ويستهزىء به.

ويذكرون أنه كان طوله ثلاثة آلاف ذراع وثلاث مائة وثلاثة وثلاثين ذراعا وثلثًا، إلى غير ذلك من الهذيانات التي لولا أنها مسطرة في كثير من كتب التفاسير، وغيرها من التواريخ، وأيام الناس لما تعرضنا لحكايتها لسقاطتها، وركاكتها، ثم إنها مخالفة للمعقول والمنقول.

أما المعقول: فكيف يسوغ فيه أن يهلك الله ولد نوح لكفره، وأبوه نبي الأمة، وزعيم أهل الإيمان، ولا يهلك عوج بن عنق ويقال عناق وهو أظلم وأطغى على ما ذكروا؟

وكيف لا يرحم الله منهم أحدًا، ولا أم الصبي، ولا الصبي، ويترك هذا الدعي الجبار، العنيد، الفاجر، الشديد، الكافر، الشيطان، المريد على ما ذكروا.

وأما المنقول: فقد قال الله تعالى: { ثُمَّ أَغْرَقْنَا الْآخَرِينَ } [الشعراء: 66] .

وَقَالَ نُوحٌ رَبِّ لَا تَذَرْ عَلَى الْأَرْضِ مِنَ الْكَافِرِينَ دَيَّارًا } [نوح: 26] .

ثم هذا الطول الذي ذكروه مخالف لما في (الصحيحين) عن النبي ﷺ أنه قال:

« إن الله خلق آدم وطوله ستون ذراعًا، ثم لم يزل الخلق ينقص حتى الآن ».

فهذا نص الصادق المصدوق المعصوم الذي لا ينطق عن الهوى { إِنْ هُوَ إِلَّا وَحْيٌ يُوحَى } [النجم: 4] أنه لم يزل الخلق ينقص حتى الآن أي: لم يزل الناس في نقصان في طولهم من آدم إلى يوم اخباره بذلك، وهلم جرا إلى يوم القيامة.

وهذا يقتضي أنه لم يوجد من ذرية آدم من كان أطول منه، فكيف يترك هذا ويذهل عنه، ويصار إلى أقوال الكذبة الكفرة، من أهل الكتاب الذين بدلوا كتب الله المنزلة، وحرفوها، وأولوها، ووضعوها على غير مواضعها، فما ظنك بما هم يستقلون بنقله، أو يؤتمنون عليه، وما أظن أن هذا الخبر عن عوج بن عناق إلا اختلاقًا من بعض زنادقتهم، وفجارهم الذين كانوا أعداء الأنبياء، والله أعلم.

ثم ذكر الله تعالى مناشدة نوح ربه في ولده، وسؤاله له عن غرقه على وجه الاستعلام والاستكشاف. ووجه السؤال: أنك وعدتني بنجاة أهلي معي، وهو منهم.

وقد غرق فأجيب: بأنه ليس من أهلك، أي: الذين وعدت بنجاتهم، أي: أما قلنا لك: { وَأَهْلَكَ إِلَّا مَنْ سَبَقَ عَلَيْهِ الْقَوْلُ }.

فكان هذا ممن سبق عليه القول منهم؛ بأن سيغرق بكفره، ولهذا ساقته الأقدار إلى أن انحاز عن حوزة أهل الإيمان، فغرق مع حزبه أهل الكفر والطغيان.

ثم قال تعالى: { قِيلَ يَانُوحُ اهْبِطْ بِسَلَامٍ مِنَّا وَبَرَكَاتٍ عَلَيْكَ وَعَلَى أُمَمٍ مِمَّنْ مَعَكَ وَأُمَمٌ سَنُمَتِّعُهُمْ ثُمَّ يَمَسُّهُمْ مِنَّا عَذَابٌ أَلِيمٌ } [هود: 48] .

هذا أمر لنوح عليه السلام، لما نضب الماء عن وجه الأرض، وأمكن السعي فيها، والاستقرار عليها، أن يهبط من السفينة التي كانت قد استقرت بعد سيرها العظيم، على ظهر جبل الجودي، وهو جبل بأرض الجزيرة مشهور. وقد قدمنا ذكره عند خلق الجبال.

{ بِسَلَامٍ مِنَّا وَبَرَكَاتٍ } أي: اهبط سالمًا مباركًا عليك، وعلى أمم ممن سيولد بعد، أي من أولادك، فإن الله لم يجعل لأحد ممن كان معه من المؤمنين نسلًا ولا عقبًا سوى نوح عليه السلام.

قال تعالى: { وَجَعَلْنَا ذُرِّيَّتَهُ هُمُ الْبَاقِينَ } [الصافات: 77] فكل من على وجه الأرض اليوم، من سائر أجناس بني آدم، ينسبون إلى أولاد نوح الثلاثة، وهم: سام، وحام، ويافث.

قال الإمام أحمد: حدثنا عبد الوهاب، عن سعيد، عن قتادة، عن الحسن، عن سمرة، أن النبي ﷺ قال: « سام أبو العرب، وحام أبو الحبش، ويافث أبو الروم ».

ورواه الترمذي عن بشر بن معاذ العقدي، عن يزيد بن زريع، عن سعيد بن أبي عروبة، عن قتادة، عن الحسن، عن سمرة، مرفوعًا نحوه.

وقال الشيخ أبو عمرو بن عبد البر. وقد روي عن عمران بن حصين، عن النبي ﷺ مثله.

قال: والمراد بالروم هنا، الروم الأول، وهم اليونان المنتسبون إلى رومي بن لبطي بن يونان بن يافث بن نوح عليه السلام.

ثم روي من حديث إسماعيل بن عياش، عن يحيى بن سعيد، عن سعيد بن المسيب، أنه قال: ولد نوح ثلاثة، سام، ويافث، وحام، وولد كل واحد من هذه الثلاثة ثلاثة، فولد سام: العرب، وفارس، والروم، وولد يافث: الترك، والسقالبة، ويأجوج، ومأجوج، وولد حام: ا، لقبط والسودان، والبربر.

قلت: وقد قال الحافظ أبو بكر البزار في (مسنده): حدثنا إبراهيم بن هانئ، وأحمد بن حسين بن عباد أبو العباس، قالا: حدثنا محمد بن يزيد بن سنان الرهاوي، حدثني أبي، عن يحيى بن سعيد، عن سعيد بن المسيب، عن أبي هريرة قال: قال رسول الله ﷺ:

« ولد لنوح سام، وحام، ويافث، فولد لسام العرب، وفارس، والروم، والخير فيهم. وولد ليافث يأجوج، ومأجوج، والترك، والسقالبة، ولا خير فيهم. وولد لحام القبط، والبربر، والسودان ».

ثم قال: لا نعلم يروى مرفوعًا إلا من هذا الوجه.

تفرد به محمد بن يزيد بن سنان، عن أبيه. وقد حدَّث عنه جماعة من أهل العلم. واحتملوا حديثه.

ورواه غيره عن يحيى بن سعيد مرسلًا، ولم يسنده، وإنما جعله من قول سعيد. قلت: وهذا الذي ذكره أبو عمرو، وهو المحفوظ عن سعيد قوله.

وهكذا روي عن وهب بن منبه مثله. والله أعلم. ويزيد بن سنان أبو فروة الرهاوي ضعيف بمرة لا يعتمد عليه.

وقد قيل: إن نوحًا عليه السلام لم يولد له هؤلاء الثلاثة الأولاد، إلا بعد الطوفان وإنما ولد له قبل السفينة كنعان، الذي غرق، وعابر مات قبل الطوفان. والصحيح أن الأولاد الثلاثة كانوا معه في السفينة، هم ونساؤهم، وأمهم، وهو نص التوراة.

وقد ذكر أن حامًا واقع امرأته في السفينة، فدعا عليه نوح أن تشوه خلقة نطفته، فولد له ولد أسود، وهو كنعان بن حام جد السودان.

وقيل: بل رأى أباه نائمًا، وقد بدت عورته فلم يسترها، وسترها أخواه، فلهذا دعا عليه أن تغير نطفته، وأن يكون أولاده عبيدًا لإخوته.

وذكر الإمام أبو جعفر بن جرير، من طريق علي بن زيد بن جدعان، عن يوسف بن مهران، عن ابن عباس، أنه قال: قال الحواريون لعيسى بن مريم: لو بعثت لنا رجلًا شهد السفينة فحدثنا عنها.قال : فانطلق بهم حتى أتى إلى كثيب من تراب، فأخذ كفًا من ذلك التراب بكفه.قال : أتدرون ما هذا؟قالوا : الله ورسوله أعلم. قال : هذا كعب حام بن نوح. قال: وضرب الكثيب بعصاه. وقال: قم بإذن الله، فإذا هو قائم ينفض التراب عن رأسه، وقد شاب. فقال له عيسى عليه السلام: هكذا هلكت؟ قال: لا، ولكني مت وأنا شاب. ولكني ظننت أنها الساعة، فمن ثم شبت. قال: حدثنا عن سفينة نوح، قال: كان طولها ألف ذراع ومائتي ذراع، وعرضها ستمائة ذراع، وكانت ثلاث طبقات، فطبقة فيها الدواب والوحش، وطبقة فيها الإنس، وطبقة فيها الطير. فلما كثر أرواث الدواب أوحى الله عز وجل إلى نوح عليه السلام، أن اغمز ذنب الفيل فغمزه، فوقع منه خنزير وخنزيرة، فأقبلا على الروث، ولما وقع الفأر يخرز السفينة بقرضه، أوحى الله عز وجل إلى نوح عليه السلام، أن اضرب بين عيني الأسد، فخرج من منخره سنور وسنورة، فأقبلا على الفأر. فقال له عيسى: كيف علم نوح عليه السلام أن البلاد قد غرقت؟ قال: بعث الغراب يأتيه بالخبر، فوجد جيفة فوقع عليها، فدعا عليه بالخوف، فلذلك لا يألف البيوت. قال: ثم بعث الحمامة، فجاءت بورق زيتون بمنقارها، وطين برجلها، فعلم أن البلاد قد غرقت فطوقها الخضرة التي في عنقها، ودعا لها أن تكون في أنس وأمان، فمن ثم تألف البيوت.قال : فقالوا يا رسول الله ألا ننطلق به إلى أهلينا، فيجلس معنا ويحدثنا؟ قال: كيف يتبعكم من لا رزق له. قال: فقال له عد بإذن الله، فعاد ترابًا.وهذا أثر غريب جدًا . و روى غلباء بن أحمر، عن عكرمة، عن ابن عباس، قال: كان مع نوح في السفينة ثمانون رجلًا معهم أهلوهم، وإنهم كانوا في السفينة مائة وخمسين يومًا، وإن الله وجَّه السفينة إلى مكة، فدارت بالبيت أربعين يومًا، ثم وجَّهها إلى الجودي فاستقرت عليه.فبعث نوح عليه السلام الغراب، ليأتيه بخبر الأرض، فذهب فوقع علىالجيف فأبطأ عليه .فبعث الحمامة فأتته بورق الزيتون، ولطخت رجليها بالطين، فعرف نوح أن الماء قد نضب، فهبط إلى أسفل الجودي، فابتنى قرية وسماها ثمانين، فأصحبوا ذات يوم، وقد تبلبلت ألسنتهم على ثمانين لغة، إحداها العربي، وكان بعضهم لا يفقه كلام بعض، فكان نوح عليه السلام يعبر عنهم . وقال قتادة وغيره: ركبوا في السفينة في اليوم العاشر من شهر رجب، فساروا مائة وخمسين يومًا، واستقرت بهم على الجودي شهرًا. وكان خروجهم من السفينة في يوم عاشرواء من المحرم.و قد روى ابن جرير خبرًا مرفوعًا يوافق هذا، وأنهم صاموا يومهم ذلك . وقال الإمام أحمد: حدثنا أبو جعفر، حدثنا عبد الصمد بن حبيب الأزدي، عن أبيه حبيب بن عبد الله عن شبل، عن أبي هريرة قال: مر النبي ﷺ بأناس من اليهود، وقد صاموا يوم عاشوراء، فقال:« ما هذا الصوم؟ »فقالوا : هذا اليوم الذي نجا الله موسى وبني إسرائيل من الغرق، وغرق فيه فرعون، وهذا يوم استوت فيه السفينة على الجودي، فصام نوح وموسى عليهما السلام شكرًا لله عز وجل. فقال النبي ﷺ: « أنا أحق بموسى، وأحق بصوم هذا اليوم، فأمن أصحابه بالصوم، وقال لأصحابه: من كان منكم أصبح صائمًا فليتم صومه، ومن كان منكم قد أصاب من غد أهله، فليتم بقية يومه ». وهذا الحديث له شاهد في الصحيح من وجه آخر، المستغرب ذكر نوح أيضًا، والله أعلم.وأما ما يذكره كثير من الجهلة أنهم أكلوا من فضول أزوادهم، ومن حبوب كانت معهم، قد استصحبوها، وأطحنوا الحبوب يومئذ، واكتحلوا بالإثمد لتقوية أبصارهم، لما انهارت من الضياء، بعد ما كانوا في ظلمة السفينة، فكل هذا لا يصح فيه شيء، وإنما يذكر فيه آثار منقطعة عن بني إسرائيل، لا يعتمد عليها، ولا يقتدى بها، والله أعلم.وقال محمد بن إسحاق: لما أراد الله أن يكف ذلك الطوفان - أرسل ريحًا على وجه الأرض، فسكن الماء، وانسدت ينابيع الأرض، فجعل الماء ينقص، ويغيض، ويدبر، وكان استواء الفلك على الجودي، فيما يزعم أهل التوراة - في الشهر السابع لسبع عشر ليلة مضت منه، وفي أول يوم من الشهر العاشر، رؤيت رؤوس الجبال. فلما مضى بعد ذلك أربعون يومًا، فتح نوح كوة الفلك التي صنع فيها، ثم أرسل الغراب لينظر له ما فعل الماء، فلم يرجع إليه. فأرسل الحمامة فرجعت إليه لم يجد لرجلها موضعًا، فبسط يده للحمامة فأخذها فأدخلها، ثم مضت سبعة أيام، ثم أرسلها لتنظر له ما فعل الماء، فلم ترجع فرجعت حين أمست، وفي فيها ورق زيتونة، فعلم نوح أن الماء قد قل عن وجه الأرض. ثم مكث سبعة أيام، ثم أرسلها فلم ترجع إليه، فعلم نوح أن الأرض قد برزت، فلما كملت السنة فيما بين أن أرسل الله الطوفان، إلى أن أرسل نوح الحمامة، ودخل يوم واحد من الشهر الأول من سنة اثنين، برز وجه الأرض، وظهر البر، وكشف نوح غطاء الفلك.وهذا الذي ذكره ابن إسحاق هو بعينه مضمون سياق التوراة، التي بأيدي أهل الكتاب.قال ابن إسحاق: وفي الشهر الثاني من سنة اثنتين، في ست وعشرين ليلة منه { قِيلَ يَانُوحُ اهْبِطْ بِسَلَامٍ مِنَّا وَبَرَكَاتٍ عَلَيْكَ وَعَلَى أُمَمٍ مِمَّنْ مَعَكَ وَأُمَمٌ سَنُمَتِّعُهُمْ ثُمَّ يَمَسُّهُمْ مِنَّا عَذَابٌ أَلِيمٌ } [هود: 48] .وفيما ذكر أهل الكتاب: أن الله كلم نوحًا قائلًا له: اخرج من الفلك أنت، وامرأتك، وبنوك، ونساء بنيك معك، وجميع الدواب التي معك، ولينموا، وليكبروا في الأرض، فخرجوا وابتنى نوح مذبحًا لله عز وجل، وأخذ من جميع الدواب الحلال، والطير الحلال، فذبحها قربانًا إلى الله عز وجل، وعهد الله إليه أن لا يعيد الطوفان على أهل الأرض.وجعل تذكارًا لميثاقه إليه القوس الذي في الغمام، وهو قوس قزح الذي قدمنا عن ابن عباس أنه أمان من الغرق.قال بعضهم: فيه إشارة إلى أنه قوس بلا وتر، أي أن هذا الغمام لا يوجد منه طوفان كأول مرة.وقد أنكرت طائفة من جهلة الفرس، وأهل الهند، وقوع الطوفان. واعترف به آخرون منهم. وقالوا: إنما كان بأرض بابل، ولم يصل إلينا. قالوا: ولم نزل نتوارث الملك كابرًا عن كابر، من لدن كيو مرث، يعنون آدم إلى زماننا هذا. وهذا قاله من قاله من زنادقة المجوس عباد النيران، وأتباع الشيطان.وهذه سفسطة منهم، وكفر فظيع، وجعل بليغ، ومكابرة للمحسوسات، وتكذيب لرب الأرض والسماوات، وقد أجمع أهل الأديان الناقلون عن رسل الرحمن، مع ما تواتر عند الناس في سائر الأزمان، على وقوع الطوفان، وأنه عم جميع البلاد، ولم يبق الله أحدًا من كفرة العباد استجابة لدعوة نبيه المؤيد المعصوم، وتنفيذًا لما سبق في القدر المحتوى"
  """;
/// hoodStore
const String hoodStore =
""""نبيٌّ أرسله الله إلى قبيلة عاد، وكانت تسكن في بلاد حضرموت، وهي أرض واسعة، ما بين البحر جنوبًا والجبال شمالًا، تسمى الأحقاف، وتتخلل الأرضَ أوديةٌ كثيرة، منها: وادي حضرموت، وبين هود ونوح أربعة أجداد، وقوم هود من العرب، وهم عاد الأولى؛ قال تعالى: ﴿ أَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِعَادٍ * إِرَمَ ذَاتِ الْعِمَادِ * الَّتِي لَمْ يُخْلَقْ مِثْلُهَا فِي الْبِلَادِ ﴾ [الفجر: 6 - 8]، وفُسرت العِماد بالعمد الكثير دليل سكنى الخيام، وبالقوة والشدة، وكانوا أهل أنعام كثيرة دليل بداوتهم، وأهل قرى دليل تحضرهم، فهم على هذا قسمان: بدو، وحضر؛ ﴿ وَاتَّقُوا الَّذِي أَمَدَّكُمْ بِمَا تَعْلَمُونَ * أَمَدَّكُمْ بِأَنْعَامٍ وَبَنِينَ * وَجَنَّاتٍ وَعُيُونٍ ﴾ [الشعراء: 132 - 134]، فماذا فعل قوم عاد؟
قال الله تعالى: ﴿ فَأَمَّا عَادٌ فَاسْتَكْبَرُوا فِي الْأَرْضِ بِغَيْرِ الْحَقِّ وَقَالُوا مَنْ أَشَدُّ مِنَّا قُوَّةً أَوَلَمْ يَرَوْا أَنَّ اللَّهَ الَّذِي خَلَقَهُمْ هُوَ أَشَدُّ مِنْهُمْ قُوَّةً وَكَانُوا بِآيَاتِنَا يَجْحَدُونَ ﴾ [فصلت: 15]، لقد اغتَرَّ القوم بقوتهم، ورأوا أن قوتهم لا تقهر، وبهذه القوة يمكنهم أن يتجبروا ويتكبروا، وأن يفعَلوا ما يحلو لهم، فلا يستطيع أحد أن يصدهم عما هم فيه، وسيحطمون كل من يقف في طريقهم، وهكذا رأى قوم عاد أنهم فوق كل البشر، ونفَث الشيطان فيهم نزعة الشر والكبر والغرور، كما اتخذوا الأصنام آلهة لهم يعبدونها من دون الله، وكانت ثلاثة، هي: صداء وصمود والهباء أو الهناء، وقد ركزت الآيات على صفة القوة التي امتازوا بها، ولكن لم يدركوا أنه ما من قوة بشرية إلا ولها حد تقف عنده بالغة ما بلغت؛ قال الله تعالى: ﴿ أَتَبْنُونَ بِكُلِّ رِيعٍ آيَةً تَعْبَثُونَ * وَتَتَّخِذُونَ مَصَانِعَ لَعَلَّكُمْ تَخْلُدُونَ * وَإِذَا بَطَشْتُمْ بَطَشْتُمْ جَبَّارِينَ ﴾ [الشعراء: 128 - 130]، مصانع بمعنى قصور، وقيل: خزانات مياه أرضية، وقال: ﴿ وَاذْكُرُوا إِذْ جَعَلَكُمْ خُلَفَاءَ مِنْ بَعْدِ قَوْمِ نُوحٍ وَزَادَكُمْ فِي الْخَلْقِ بَسْطَةً فَاذْكُرُوا آلَاءَ اللَّهِ لَعَلَّكُمْ تُفْلِحُونَ ﴾ [الأعراف: 69]، لكن هذه القوة التي فخروا بها وتكبروا بها على الضعفاء جرَّتْهم إلى عصيان الله والشرك به، لكن الله - سبحانه وتعالى - القائل: ﴿ وَمَا كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولًا ﴾ [الإسراء: 15]، اختار مِن بينهم هودًا نبيًّا، فبعثه إليهم هاديًا ومبشرًا ونذيرًا: ﴿ وَإِلَى عَادٍ أَخَاهُمْ هُودًا قَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُمْ مِنْ إِلَهٍ غَيْرُهُ أَفَلَا تَتَّقُونَ * قَالَ الْمَلَأُ الَّذِينَ كَفَرُوا مِنْ قَوْمِهِ إِنَّا لَنَرَاكَ فِي سَفَاهَةٍ وَإِنَّا لَنَظُنُّكَ مِنَ الْكَاذِبِينَ * قَالَ يَا قَوْمِ لَيْسَ بِي سَفَاهَةٌ وَلَكِنِّي رَسُولٌ مِنْ رَبِّ الْعَالَمِينَ * أُبَلِّغُكُمْ رِسَالَاتِ رَبِّي وَأَنَا لَكُمْ نَاصِحٌ أَمِينٌ ﴾ [الأعراف: 65 - 68].
هؤلاء القوم الذين اغتروا بقوتهم المادية والمعنوية، ورفعوا عرانينهم في صلَفٍ للسماء، مَن يستطيع أن يقنعهم بالرجوع عن غيِّهم وضلالهم؛ لهذا كان ردهم على نبيِّهم هود باستخفاف، وقد ورد أن قوم هود هم أول الأقوام التي ضلت وعبدت الأوثان بعد أن أرسى نوحٌ الإسلامَ، وساد المسلمون فترة طويلة بعد الطوفان، حيث اجتث الكفار من على وجه الأرض، فكان هؤلاء الذين ابتدعوا الضلال وشذوا عن الطريق المستقيم، لكن منهج الأنبياء هو الاستمرار بالدعوة وبذل الوسع في ذلك والتنويع بالطرح، وليس من منهجهم الكف بعد الصد، وإنما تكرار المحاولة وعدم اليأس من الأقوام أو الحكم على استجابتهم من خلال الطرح الأول بأن هؤلاء ميئوس منهم، وأعلمهم بأنه لا يطلب أجرًا منهم لهذه المهمة: ﴿ يَا قَوْمِ لَا أَسْأَلُكُمْ عَلَيْهِ أَجْرًا إِنْ أَجْرِيَ إِلَّا عَلَى الَّذِي فَطَرَنِي أَفَلَا تَعْقِلُونَ * وَيَا قَوْمِ اسْتَغْفِرُوا رَبَّكُمْ ثُمَّ تُوبُوا إِلَيْهِ يُرْسِلِ السَّمَاءَ عَلَيْكُمْ مِدْرَارًا وَيَزِدْكُمْ قُوَّةً إِلَى قُوَّتِكُمْ وَلَا تَتَوَلَّوْا مُجْرِمِينَ ﴾ [هود: 51، 52].
وقد ركز هود على أمرين لهما أهمية كبيرة عند قوم هود، هما: القَطْر المدرار، وبلاد الأحقاف بحاجة ماسة إليه، والقوة التي يتفاخرون بها على الأمم الأخرى؛ فالمؤمن المستغفر يلقى المدد من ربه بلا شك، فيزداد بالإيمان قوة إلى قوته، مادية ومعنوية واقتصادية، وهذا أسلوب موفق من هود عليه السلام، فهل اقتنع قوم هود بقوله؟ لقد كان الرد ﴿ قَالُوا يَا هُودُ مَا جِئْتَنَا بِبَيِّنَةٍ وَمَا نَحْنُ بِتَارِكِي آلِهَتِنَا عَنْ قَوْلِكَ وَمَا نَحْنُ لَكَ بِمُؤْمِنِينَ ﴾ [هود: 53]، رفضوا قوله جملة وتفصيلًا، بل طالبوه بالبينة على دعواه، فليس من السهل - كما يزعمون - أن يتخلَّوْا عن دينهم لمجرد أن يأتي فردٌ ليبطله، فما دليلك على صدق دعواك يا هود؟ لم يكن مع هود سوى الحجة والبرهان بعجز آلهتهم، وأنها حجارة لا تضر ولا تنفع، والتذكير بما كان عليه سلفهم نوح وأبناؤه الموحدون، وهم قريبو عهد بهم نسبيًّا، لكن هذا لم يُجِدِ نفعًا مع قومه، بل زادوا على أن اتهموه بالمس والجنون، ﴿ إِنْ نَقُولُ إِلَّا اعْتَرَاكَ بَعْضُ آلِهَتِنَا بِسُوءٍ ﴾ [هود: 54]، فأعطَوا آلهتهم القدرة على الفعل، وهذا دليل عدم اقتناعهم بدعوة هود، وإصرارهم على التمسك بآلهتهم التي يجدون فيها القدرة على فعل الخير أو الشر، لكنَّ هودًا عليه السلام تبرأ مِن قولهم مباشرة؛ كيلا يظنوا أنه جاراهم في قولهم، وأن يعتقدوا للحظة ما أنه صدَّق ما يقولون، فانبرى بشدة للتبرؤ من عقيدتهم، فأشهد الله وأشهدهم على موقفه؛ كيلا يزوروا كلامه، وهذا تعليم لنا بألا نجاري أهل الأهواء في مثل هذه الأمور، ﴿ إِنْ نَقُولُ إِلَّا اعْتَرَاكَ بَعْضُ آلِهَتِنَا بِسُوءٍ قَالَ إِنِّي أُشْهِدُ اللَّهَ وَاشْهَدُوا أَنِّي بَرِيءٌ مِمَّا تُشْرِكُونَ * مِنْ دُونِهِ فَكِيدُونِي جَمِيعًا ثُمَّ لَا تُنْظِرُونِ ﴾ [هود: 54، 55]، ثم بعد تأكُّده مِن صدهم وعنادهم وأنهم صعدوا في التحدي وهددوا بالإيذاء، لم يبالِ بهم، بل تحداهم: ﴿ مِنْ دُونِهِ فَكِيدُونِي جَمِيعًا ثُمَّ لَا تُنْظِرُونِ * إِنِّي تَوَكَّلْتُ عَلَى اللَّهِ رَبِّي وَرَبِّكُمْ مَا مِنْ دَابَّةٍ إِلَّا هُوَ آخِذٌ بِنَاصِيَتِهَا إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ ﴾ [هود: 55، 56].
فلم يؤمِنْ مع هود - بعد هذا الجهد - إلا قليل من المتنورين، متحدين كبار القوم، وهنا وصل الحوار إلى طريق مسدودة، ﴿ قَالُوا سَوَاءٌ عَلَيْنَا أَوَعَظْتَ أَمْ لَمْ تَكُنْ مِنَ الْوَاعِظِينَ ﴾ [الشعراء: 136]، فالملأ مِن قوم عاد متمسكون بصلَفهم ووثنيتهم، ﴿ قَالُوا أَجِئْتَنَا لِتَأْفِكَنَا عَنْ آلِهَتِنَا فَأْتِنَا بِمَا تَعِدُنَا إِنْ كُنْتَ مِنَ الصَّادِقِينَ ﴾ [الأحقاف: 22]، وهكذا أسفَر وجه الطغاة عن صدٍّ وعناد وتحدٍّ لا يخشى العاقبة، ربما ساعد على هذا التحدي ما هم عليه من القوة والبطش، وظنوا أن التحدي مع هود وأتباعه الضعاف، ولم يدُرْ بخَلَدهم أنهم يعاندون الله، وكان بداية عقابهم أخذهم بالسنين، فمنع الله عنهم القطر، وبدأت ينابيعهم غيضًا، وبساتينهم يبسًا، وأنعامهم هزالًا، واستمروا على هذه الحال ثلاث سنين حتى أعيَوْا وأصبحوا ينتظرون المطر بفارغ الصبر، فاغبرت ديارهم، وكلحت وجوههم، ومع ذلك لم تَلِنْ قلوبهم، وورد في بعض الأخبار أنهم أرسلوا وفدًا للاستغاثة بمكة عند الكعبة، لكنهم لهَوْا شهرًا عند معاوية بن بكر يشربون الخمر وتُغنِّيهم الجرادتان - وهما جاريتان اشتهرتا بالغناء - ثم انتبهوا إلى قصدهم وأسرعوا إلى أرض الحرم يدعون ويستسقون، فظهرت لهم ثلاث سحائب سوداء وحمراء وبيضاء، فاختار داعيهم السوداء؛ لأنها أكثر السحاب ماءً، لكنه سمع صوتًا يقول له: اخترت رمادًا رمدًا، لا يبقي من عاد أحدًا، لا والدًا تترك ولا ولدًا، إلا جعلته همدًا.
أقول: وهذا الخبر الذي لخصته هو من وضع الرواة، ولا يعاصر العهد الذي كان في زمن هود، وقد تكون هذه الحادثة في عهد عاد الثانية، وهي بعد هودٍ بمئات السنين.
لقد كان العاديُّون متلهفين للمطر، تشرئبُّ أعناقهم كل يوم نحو السماء ينتظرون المطر بلا جدوى، حتى دب فيها اليأس، وأيقنوا بزوال مدينتهم التي بدأت تتآكل، ومع هذه الحال الصعبة والحرجة التي تلين لها القلوب، ويراجع فيها المعاند قيمه التي تمسَّك بها، ويوازن بينها وبين ما يدعوه إليه نبي الله ليكون على بينة أكثر، فإن العناد استمر، والتمسك بالقيم الزائفة ازداد، والتحدي برز على أشده: ﴿ أَجِئْتَنَا لِنَعْبُدَ اللَّهَ وَحْدَهُ وَنَذَرَ مَا كَانَ يَعْبُدُ آبَاؤُنَا فَأْتِنَا بِمَا تَعِدُنَا إِنْ كُنْتَ مِنَ الصَّادِقِينَ ﴾ [الأعراف: 70]، فكان جوابه: ﴿ قَالَ قَدْ وَقَعَ عَلَيْكُمْ مِنْ رَبِّكُمْ رِجْسٌ وَغَضَبٌ ﴾ [الأعراف: 71]، رِجْس بمعنى: عذاب، فما هو هذا العذاب؟ لقد تعلقت قلوبهم بالمطر، واشرأبت أعناقهم نحو السماء، فأتاهم العذاب من السماء وكانوا ينتظرون منها الغيث: ﴿ فَلَمَّا رَأَوْهُ عَارِضًا مُسْتَقْبِلَ أَوْدِيَتِهِمْ قَالُوا هَذَا عَارِضٌ مُمْطِرُنَا بَلْ هُوَ مَا اسْتَعْجَلْتُمْ بِهِ رِيحٌ فِيهَا عَذَابٌ أَلِيمٌ * تُدَمِّرُ كُلَّ شَيْءٍ بِأَمْرِ رَبِّهَا فَأَصْبَحُوا لَا يُرَى إِلَّا مَسَاكِنُهُمْ كَذَلِكَ نَجْزِي الْقَوْمَ الْمُجْرِمِينَ ﴾ [الأحقاف: 24، 25].
وهكذا انصَبَّ عليهم العذاب صبًّا، ﴿ فَأَرْسَلْنَا عَلَيْهِمْ رِيحًا صَرْصَرًا فِي أَيَّامٍ نَحِسَاتٍ ﴾ [فصلت: 16]، وقال تعالى: ﴿ وَفِي عَادٍ إِذْ أَرْسَلْنَا عَلَيْهِمُ الرِّيحَ الْعَقِيمَ * مَا تَذَرُ مِنْ شَيْءٍ أَتَتْ عَلَيْهِ إِلَّا جَعَلَتْهُ كَالرَّمِيمِ ﴾ [الذاريات: 41، 42]، وفي سورة "الحاقة" صورةٌ واضحة لِما حاق بقوم عاد من عذاب: ﴿ وَأَمَّا عَادٌ فَأُهْلِكُوا بِرِيحٍ صَرْصَرٍ عَاتِيَةٍ * سَخَّرَهَا عَلَيْهِمْ سَبْعَ لَيَالٍ وَثَمَانِيَةَ أَيَّامٍ حُسُومًا فَتَرَى الْقَوْمَ فِيهَا صَرْعَى كَأَنَّهُمْ أَعْجَازُ نَخْلٍ خَاوِيَةٍ * فَهَلْ تَرَى لَهُمْ مِنْ بَاقِيَةٍ ﴾ [الحاقة: 6 - 8]، فعلى هذا فقد كان الغيم العارض الذي رأوه نذيرَ عاصفة عاتية شديدة البرودة، استمرت سبع ليالٍ أو ثمانية أيام حسومًا؛ أي: متتالية، وذلك إذا بدأنا العد ابتداءً باليوم فتليه الليلة وهكذا حتى ننتهي باليوم، فتكون المدة سبع ليال وثمانية أيام، فماذا كانت حالة القوم وهم يتعرضون لهذه الريح العاتية، وهل كانت ريحًا فقط لها عصف وعويل؟ فالعواصف القوية عادةً يرافقها قصف الرعود، وشرر الصواعق؛ لتزيد من الرهبة والخوف؛ ﴿ فَإِنْ أَعْرَضُوا فَقُلْ أَنْذَرْتُكُمْ صَاعِقَةً مِثْلَ صَاعِقَةِ عَادٍ وَثَمُودَ ﴾ [فصلت: 13]، لقد أحدثت عندهم صرعًا ودوارًا، وتغلغلت في أجسامهم حتى تركتها هزيلة خاوية كأنها أعجاز نخل خاوية.
وقد ورد في الحديث الذي يرويه ابن عمر رضي الله عنهما: أن رسولَ الله صلى الله عليه وسلم قال: ((ما فتح الله على عاد من الريح التي أهلكوا بها إلا مثل موضع الخاتم، فمرَّت بأهل البادية فحملتهم ومواشيهم وأموالهم بين السماء والأرض، فلما رأى ذلك أهل الحاضرة من عاد الريح وما فيها، ﴿ قَالُوا هَذَا عَارِضٌ مُمْطِرُنَا ﴾ [الأحقاف: 24]، فألقت أهلَ البادية ومواشيهم على أهل الحاضرة))، وقيل: إن كل هذا التدمير كان يفتح طاقة للريح لم تزد عن فتحة الخاتم، ﴿ وَمَا يَعْلَمُ جُنُودَ رَبِّكَ إِلَّا هُوَ ﴾ [المدثر: 31]، فما بالُك لو فتحت عليهم طاقة أكبر من هذا، لكانت اقتلعت الأرض بمن فيها، وقد ورد في التفاسير أن الريح كانت ترفع الشخص من قوم عاد إلى الأعلى في الهواء، ثم تنكسه على أم رأسه فتشدخه، فيبقى جثة بلا رأس، وهذا تفسير قوله: ﴿ كَأَنَّهُمْ أَعْجَازُ نَخْلٍ خَاوِيَةٍ ﴾ [الحاقة: 7]، وفي سورة القمر: ﴿ تَنْزِعُ النَّاسَ كَأَنَّهُمْ أَعْجَازُ نَخْلٍ مُنْقَعِرٍ ﴾ [القمر: 20]؛ أي: منقطع أو منقلع، و﴿ تَنْزِعُ ﴾ فيها الشدة والقهر، فهي تقتلعهم من أماكنهم بشدة، وترمي بهم على أم رؤوسهم، فيصبح شكلها كجذوع النخل المنقلعة من الأرض والمرمية بشكلها المتهالك، التي تظهر أن كارثة ما قد اجتاحتها، وورد: أن الله لما أهلكهم أرسل عليهم طيورًا سودًا، فنقلتهم إلى البحر وألقتهم فيه، ﴿ فَأَصْبَحُوا لَا يُرَى إِلَّا مَسَاكِنُهُمْ ﴾ [الأحقاف: 25].
♦ ورد في الآية الكريمة: ﴿ أَمَدَّكُمْ بِأَنْعَامٍ وَبَنِينَ ﴾ [الشعراء: 133]؛ فالأنعام بالمقصد الخاص تعني الإبل، ﴿ وَأَنْعَامٌ حُرِّمَتْ ظُهُورُهَا ﴾ [الأنعام: 138]، وبالمعنى العام تعني الإبل والبقر والغنم والماعز؛ ﴿ يَا أَيُّهَا الَّذِينَ آمَنُوا أَوْفُوا بِالْعُقُودِ أُحِلَّتْ لَكُمْ بَهِيمَةُ الْأَنْعَامِ ﴾ [المائدة: 1]، ومِن هذا المعنى العام فإن قوم عاد ملكوا الأنعام التي شملت الأصناف الأربعة.
♦ ﴿ إِرَمَ ذَاتِ الْعِمَادِ ﴾ [الفجر: 7]، ذكر أنها اسم قبيلة عاد الأولى التي تنسب إلى الجد إرم؛ لأن عادًا هو ابن عوص بن إرم بن سام، ووصفت هذه القبيلة بالقوة أو بكثرة الأعمدة، وهذا دليل على كثرة البيوت والسكان، ﴿ الَّتِي لَمْ يُخْلَقْ مِثْلُهَا فِي الْبِلَادِ ﴾ [الفجر: 8]، قيل: مثل قبيلة إرم، حيث القوة والشدة وطول القامات، وقيل: مثل مدينة إرم ذات الأعمدة الكثيرة، حتى جاوز الخيال بعضهم، فقال: هي مدينة مبنية بالذهب والفضة، وحصباؤها من اللؤلؤ، وترابها من المسك، وزعم عبدالله بن قلابة - زمن معاوية - أنه رآها ودخلها، ثم وصفها لمعاوية، ولو دخلها فعلًا لكان من أغنى الأغنياء على ما رأى فيها من الذهب والفضة واللؤلؤ، وقال: هي في أرض عدن، فما الذي جعل معاوية لا يقصدها بعد أن أخبره خبرها؟ ليستفيد من كنوزها في بناء دولته، فهذا زعم باطل، إن هو إلا اختلاق.
♦ هل أتى هود قومه بمعجزة؟ لم يذكر القُرْآن أن هودًا كان معه معجزة ليبرهن على صدق دعواه، وهم قالوا له: ﴿ قَالُوا يَا هُودُ مَا جِئْتَنَا بِبَيِّنَةٍ ﴾ [هود: 53]، ولعل سبب ذلك قربُ عهدهم بنوح، وأن سفينة نوح ما زالت شاهدًا على نجاة المؤمنين وهلاك الكافرين، ﴿ وَلَقَدْ تَرَكْنَاهَا آيَةً فَهَلْ مِنْ مُدَّكِرٍ ﴾ [القمر: 15]، ولو قيل: إن سفينة نوح استقرت على الجودي، وهو جبل في العراق، نقول: إن سيطرة قوم عاد امتدت في فترة من التاريخ إلى ما هو أبعد من الجودي زمن شداد وشديد ابنا عاد.
♦ ﴿ كَذَّبَتْ عَادٌ الْمُرْسَلِينَ ﴾ [الشعراء: 123]، ﴿ وَتِلْكَ عَادٌ جَحَدُوا بِآيَاتِ رَبِّهِمْ وَعَصَوْا رُسُلَهُ ﴾ [هود: 59]، من هم رسل عاد؟ لم يذكر القُرْآن سوى هود، فكذبوه، وهذا على اعتبار أن من يكذب رسولًا فكأنما كذب كل الرسل، السابق منهم واللاحق، ومَن آمن برسول فكأنما آمن بكل الرسل، السابق منهم واللاحق، فأمة محمد صلى الله عليه وسلم آمنت بمحمد، فهي مؤمنة تبعًا لذلك بكل الرسل السابقين له؛ ﴿ آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ﴾ [البقرة: 285].
♦ قيل: إن يوم النحس الذي عنته الآية: ﴿ إِنَّا أَرْسَلْنَا عَلَيْهِمْ رِيحًا صَرْصَرًا فِي يَوْمِ نَحْسٍ مُسْتَمِرٍّ ﴾ [القمر: 19]، هو يوم الأربعاء، وقد رد هذا بعض المفسرين بأن إبادتهم كانت في سبع ليال وثمانية أيام؛ ﴿ سَخَّرَهَا عَلَيْهِمْ سَبْعَ لَيَالٍ وَثَمَانِيَةَ أَيَّامٍ حُسُومًا ﴾ [الحاقة: 7]؛ أي: تشمل كافة أيام الأسبوع، لكن هذا لا يمنع أن العذاب بدأ يوم الأربعاء وانتهى يوم الأربعاء، وقد ورد في أحاديث ليست بالقوية عن جابر بن عبد الله: أن النبي صلى الله عليه وسلم قال: ((يوم الأربعاء يوم نحس مستمر))، وورد عن أنس مرفوعًا: ((أغرق الله فيه فرعون وقومه، وأهلك فيه عادًا وثمود)).
""";

/// SalehStory
const String salehStory =

""""قالوا يا صالح قد كنت فينا مرجواً قبل هذا أتنهانا أن نعبد ما يعبد آباؤنا وإننا لفي شك مما تدعونا إليه مريب
كان سيدنا صالح عليه السلام معروفا بالحكمة والنقاء والخير ، كان قومه يحترمونه قبل أن يوحى الله إليه ويرسله بالدعوة إليهم.
بعد الطوفان الذى أغرق الأرض بادت البشرية ولم يبق من ذرية نوح عليه السلام أحد ومرت سنوات وسنوات وجاء قوم بعد قوم وتكررت قصة العذاب ولكن بشكل مختلف ، ومن أشهر القبائل العربية فى تلك الفترة قبيلة تسمى ثمود ، كان قوم ثمود أشداء أقوياء ، لهم حضارة عمرانية واضحة المعالم ، قد نحتوا فى الجبال بيوتاً وقصوراً للسكنى كأنهم مخلدون فى هذه الحياة الدنيا ، وسوف لا يعتريهم موت أو فناء «واذكروا إذ جعلكم خلفاء من بعد عاد وبؤاكم فى الأرض تتخذون من سهولها قصوراً وتنحتون الجبال بيوتا فاذكروا آلاء الله ولا تعثوا فى الأرض مفسدين» ، أنعم الله عليهم بنعم لا تعد ولا تحصى فأعطاهم الأرض الخصبة والماء العذب والحدائق والنخيل ، لكنهم قابلوا النعمة بالجحود والكفر والعصيان والنكران ، فوسوس لهم الشيطان وكفروا بالله تعالى ، كانوا يعبدون الأصنام من دون الله الواحد الأحد عبدوها وجعلوها شريكة لله. فأراد الله هدايتهم فأرسل لهم نبيا منهم وهو سيدنا صالح عليه السلام ، رجل كريم تقي محبوب لديهم حتى يعظهم ويصلحهم ويدلهم على طريق الحق والهداية.
بدأ سيدنا صالح عليه السلام يدعوهم إلى عبادة الله وحده لا شريك له وترك ما هم فيه من عبادة الأصنام فقال لهم « يا قوم اعبدوا الله ما لكم من إله غيره» بالرغم من نصاعة دعوة سيدنا صالح فقد بدا واضحا أن قومه لا يصدقونه ، وكانوا يشككون فى دعوته ، واعتقدوا أنه مسحور ، وطالبوه بمعجزة تثبت أنه رسول من الله إليهم ، لفتوا نظره إلى صخرة كبيرة كانت قريبة منهم وأشاروا إليها وقالوا إن أنت أخرجت لنا من تلك الصخرة ناقة معلومة لنا لصدقناك.
قام سيدنا صالح عليه السلام إلى مصلاه فصلى ودعا ربه أن يحقق المعجزة ، وتحققت المعجزة وتجلت ظاهرة تدل على صحة نبوته. نظر أهل ثمود إلى الصخرة فوجدوها تنشق وتخرج منها ناقة. حينئذ قال سيدنا صالح لقومه «ويا قوم هذه ناقة الله لكم آية فذروها تأكل فى أرض الله ولا تمسوها بسوء فيأخذكم عذاب قريب» وأصدر الله أمره إلى صالح أن يأمر قومه بعدم المساس بالناقة أو إيذائها أو قتلها ، وأمرهم أن يتركوها تأكل فى أرض الله ولا يمسوها بسوء ، وحذرهم أنهم إذا مدوا أيديهم بالأذى للناقة فسوف يأخذهم عذاب قريب.
فى البداية تعاظمت دهشة قوم ثمود حين خرجت الناقة من صخور الجبل ، فقد كانت ناقة مباركة ، قيل إنها كانت معجزة لأنها إذ تشرب من المياه الموجودة فى الآبار فى يوم لا تقترب منه بقية الحيوانات من المياه فى هذا اليوم ، وقيل إن لبنها كان يكفى آلاف الرجال والنساء والأطفال ، وقيل إنه إذا نامت الناقة فى موضع هجرته كل الحيوانات الأخرى.كان واضحا أنها ليست مجرد ناقة عادية إنما هى آية من الله ووصفها الله سبحانه وتعالى «ناقة الله» ، قال سيدنا صالح عليه السلام لمن لم يؤمن هذه ناقة وهى معجزتي إليكم فاتركوها ولا تتعرضوا لها بسوء ، ثم دار الحوار بين الكافرين الذين أصروا على عنادهم وكفرهم وقتلوا الناقة وتحدوا النبي فى أن يأتيهم العذاب.
علم سيدنا صالح عليه السلام بما حدث فخرج غاضباً على قومه ، وقال لهم ألم أحذركم من أن تمسوا الناقة ، قالوا قتلناها فأتنا بالعذاب ألم تقل إنك من المرسلين، ، قال سيدنا صالح لقومه »تمتعوا فى داركم ثلاثة أيام ذلك وعد غير مكذوب» وبعدها غادر سيدنا صالح عليه السلام قومه ومضى.
انتهى الأمر ووعده الله بهلاكهم بعد ثلاثة أيام ، مرت الثلاثة أيام على الكافرين من قوم صالح وهم يهزءون من العذاب وينتظرون ، وفى فجر اليوم الرابع انشقت السماء عن صيحة جبارة واحدة انقضت الصيحة على الجبال فهلك فيها كل شىء حي ، وارتجفت الأرض رجفة جبارة فهلك فوقها كل شىء حي وقال الله سبحانه وتعالى «إنا أرسلنا عليهم صيحة واحدة فكانوا كهشيم المحتظر» هى صرخة واحدة لم يكد أولها يبدأ وآخرها يجىء حتى كان كفار قوم صالح قد صعقوا جميعا صعقة واحدة قبل أن يدركوا ما حدث.
هكذا نال الكفار جزاءهم من الله على مكرهم وهلكوا جميعا ، أما الذين آمنوا منهم بسيدنا صالح علية السلام فكانوا قد غادروا المكان مع نبيهم ونجوا. وقيل إن صالح عليه السلام عاش نحو ثمانية وخمسين سنة ، ودفن بالأحقاف شمالي حضرموت من بلاد اليمن ، وقيل توفاه الله تعالى بفلسطين.
""" ;

/// IbrahimStory
const String ibrahimStory =
""""هو إبراهيم بن تارخ " 250 " بن ناحور " 148 " بن ساروغ " 230 " بن راغو " 239 " بن فالغ " 439 " بن عابر " 464 " بن شالخ " 433 " بن أرفخشد " 438 " بن سام " 600 " بن نوح عليه السلام . هذا نص أهل الكتاب في كتابهم ، وقد أعلمت على أعمارهم تحت أسمائهم بالهندي ، كما ذكروه من المدد ، وقدمنا الكلام على عمر نوح عليه السلام فأغنى عن إعادته .
وحكى الحافظ ابن عساكر في ترجمة إبراهيم الخليل من تاريخه عن إسحاق بن بشر الكاهلي صاحب كتاب المبتدأ أن اسم أم إبراهيم أميلة ، ثم أورد عنه في خبر ولادتها له حكاية طويلة . وقال الكلبي : اسمها نونا بنت كرنبا بن كوثى من بني أرفخشد بن سام بن نوح .
وروى ابن عساكر من غير وجه ، عن عكرمة أنه قال : كان إبراهيم عليه السلام يكنى أبا الضيفان قالوا : ولما كان عمر تارخ خمسا [ ص: 325 ] وسبعين سنة ولد له إبراهيم عليه السلام ، وناحور ، وهاران ، وولد لهاران لوط . وعندهم أن إبراهيم عليه السلام هو الأوسط ، وأن هاران مات في حياة أبيه في أرضه التي ولد فيها ، وهي أرض الكلدانيين يعنون أرض بابل . وهذا هو الصحيح المشهور عند أهل السير والتواريخ والأخبار ، وصحح ذلك الحافظ ابن عساكر بعدما روى من طريق هشام بن عمار ، عن الوليد ، عن سعيد بن عبد العزيز ، عن مكحول ، عن ابن عباس قال : ولد إبراهيم بغوطة دمشق في قرية يقال لها : برزة في جبل يقال له : قاسيون . ثم قال : والصحيح أنه ولد ببابل ، وإنما نسب إليه هذا المقام ؛ لأنه صلى فيه إذ جاء معينا للوط عليه السلام . قالوا : فتزوج إبراهيم سارة ، وناحور ملكا ابنة هاران ، يعنون بابنة أخيه . قالوا : وكانت سارة عاقرا لا تلد . قالوا : وانطلق تارخ بابنه إبراهيم ، وامرأته سارة ، وابن أخيه لوط بن هاران ، فخرج بهم من أرض الكلدانيين إلى أرض الكنعانيين ، فنزلوا حران ، فمات فيها تارخ وله مائتان وخمسون سنة . وهذا يدل على أنه لم يولد بحران ، وإنما مولده بأرض الكلدانيين ، وهي أرض بابل وما والاها . ثم ارتحلوا قاصدين أرض الكنعانيين ، وهي بلاد بيت المقدس فأقاموا بحران ، وهي أرض الكشدانيين في ذلك الزمان ، وكذلك أرض الجزيرة والشام أيضا ، وكانوا يعبدون الكواكب السبعة ، والذين عمروا مدينة دمشق كانوا على هذا الدين يستقبلون القطب الشمالي ، ويعبدون الكواكب السبعة بأنواع من الفعال والمقال ؛ ولهذا كان على كل باب من أبواب دمشق السبعة [ ص: 326 ] القديمة هيكل لكوكب منها ، ويعملون لها أعيادا وقرابين . وهكذا كان أهل حران يعبدون الكواكب والأصنام ، وكل من كان على وجه الأرض كانوا كفارا سوى إبراهيم الخليل ، وامرأته ، وابن أخيه لوط عليهم السلام . وكان الخليل عليه السلام هو الذي أزال الله به تلك الشرور ، وأبطل به ذاك الضلال . فإن الله سبحانه وتعالى آتاه رشده في صغره ، وابتعثه رسولا ، واتخذه خليلا في كبره . قال تعالى : ولقد آتينا إبراهيم رشده من قبل وكنا به عالمين [ الأنبياء : 51 ] . أي كان أهلا لذلك . وقال تعالى : وإبراهيم إذ قال لقومه اعبدوا الله واتقوه ذلكم خير لكم إن كنتم تعلمون إنما تعبدون من دون الله أوثانا وتخلقون إفكا إن الذين تعبدون من دون الله لا يملكون لكم رزقا فابتغوا عند الله الرزق واعبدوه واشكروا له إليه ترجعون وإن تكذبوا فقد كذب أمم من قبلكم وما على الرسول إلا البلاغ المبين أو لم يروا كيف يبدئ الله الخلق ثم يعيده إن ذلك على الله يسير قل سيروا في الأرض فانظروا كيف بدأ الخلق ثم الله ينشئ النشأة الآخرة إن الله على كل شيء قدير يعذب من يشاء ويرحم من يشاء وإليه تقلبون وما أنتم بمعجزين في الأرض ولا في السماء وما لكم من دون الله من ولي ولا نصير والذين كفروا بآيات الله ولقائه أولئك يئسوا من رحمتي وأولئك لهم عذاب أليم فما كان جواب قومه إلا أن قالوا اقتلوه أو حرقوه فأنجاه الله من النار إن في ذلك لآيات لقوم يؤمنون وقال إنما اتخذتم من دون الله أوثانا مودة بينكم في الحياة الدنيا ثم يوم القيامة يكفر بعضكم ببعض ويلعن بعضكم بعضا ومأواكم النار وما لكم من ناصرين فآمن له لوط وقال إني مهاجر إلى ربي إنه هو العزيز الحكيم ووهبنا له إسحاق ويعقوب وجعلنا في ذريته النبوة والكتاب وآتيناه أجره في الدنيا وإنه في الآخرة لمن الصالحين [ العنكبوت : 16 - 27 ] [ ص: 327 ] ثم ذكر تعالى مناظرته لأبيه وقومه ، كما سنذكره إن شاء الله تعالى ، وكان أول دعوته لأبيه ، وكان أبوه ممن يعبد الأصنام ؛ لأنه أحق الناس بإخلاص النصيحة له ، كما قال تعالى : واذكر في الكتاب إبراهيم إنه كان صديقا نبيا إذ قال لأبيه يا أبت لم تعبد ما لا يسمع ولا يبصر ولا يغني عنك شيئا يا أبت إني قد جاءني من العلم ما لم يأتك فاتبعني أهدك صراطا سويا يا أبت لا تعبد الشيطان إن الشيطان كان للرحمن عصيا يا أبت إني أخاف أن يمسك عذاب من الرحمن فتكون للشيطان وليا قال أراغب أنت عن آلهتي يا إبراهيم لئن لم تنته لأرجمنك واهجرني مليا قال سلام عليك سأستغفر لك ربي إنه كان بي حفيا وأعتزلكم وما تدعون من دون الله وأدعو ربي عسى ألا أكون بدعاء ربي شقيا [ مريم : 41 - 48 ] . يذكر تعالى ما كان بينه وبين أبيه من المحاورة والمجادلة ، وكيف دعا أباه إلى الحق بألطف عبارة وأحسن إشارة ، بين له بطلان ما هو عليه من عبادة الأصنام التي لا تسمع دعاء عابدها ولا تبصر مكانه ، كيف تغني عنه شيئا أو تفعل به خيرا من رزق أو نصر ؟ [ ص: 328 ] ثم قال منبها على ما أعطاه الله من الهدى والعلم النافع ، وإن كان أصغر سنا من أبيه يا أبت إني قد جاءني من العلم ما لم يأتك فاتبعني أهدك صراطا سويا . أي مستقيما واضحا سهلا حنيفا ، يفضي بك إلى الخير في دنياك وأخراك ، فلما عرض هذا الرشد عليه ، وأهدى هذه النصيحة إليه لم يقبلها منه ، ولا أخذها عنه بل تهدده وتوعده قال أراغب أنت عن آلهتي يا إبراهيم لئن لم تنته لأرجمنك . قيل : بالمقال . وقيل : بالفعال واهجرني مليا أي واقطعني وأطل هجراني فعندها قال له إبراهيم : سلام عليك أي لا يصلك مني مكروه ، ولا ينالك مني أذى ، بل أنت سالم من ناحيتي ، وزاده خيرا فقال : سأستغفر لك ربي إنه كان بي حفيا . قال ابن عباس وغيره : أي لطيفا . يعني في أن هداني لعبادته والإخلاص له ؛ ولهذا قال : وأعتزلكم وما تدعون من دون الله وأدعو ربي عسى ألا أكون بدعاء ربي شقيا . وقد استغفر له إبراهيم عليه السلام ، كما وعده في أدعيته ، فلما تبين له أنه عدو لله تبرأ منه ، كما قال تعالى : وما كان استغفار إبراهيم لأبيه إلا عن موعدة وعدها إياه فلما تبين له أنه عدو لله تبرأ منه إن إبراهيم لأواه حليم [ التوبة : 114 ] .
وقال البخاري : حدثنا إسماعيل بن عبد الله ، حدثني أخي عبد الحميد ، عن ابن أبي ذئب ، عن سعيد المقبري ، عن أبي هريرة ، عن النبي صلى الله عليه وسلم قال : يلقى إبراهيم أباه آزر يوم القيامة ، وعلى وجه آزر قترة وغبرة . فيقول له إبراهيم : ألم أقل لك لا تعصني . فيقول له أبوه : فاليوم [ ص: 329 ] لا أعصيك . فيقول إبراهيم : يا رب إنك وعدتني أن لا تخزني يوم يبعثون ، وأي خزي أخزى من أبي الأبعد . فيقول الله : إني حرمت الجنة على الكافرين ، ثم يقال : يا إبراهيم ما تحت رجليك ، فينظر فإذا هو بذيخ متلطخ فيؤخذ بقوائمه فيلقى في النار . هكذا رواه في قصة إبراهيم منفردا .
وقال في التفسير . وقال إبراهيم بن طهمان ، عن ابن أبي ذئب ، عن سعيد بن أبي سعيد المقبري ، عن أبيه ، عن أبي هريرة . وهكذا رواه النسائي ، عن أحمد بن حفص بن عبد الله ، عن أبيه ، عن إبراهيم بن طهمان به . وقد رواه البزار من حديث حماد بن سلمة ، عن أيوب ، عن محمد بن سيرين ، عن أبي هريرة ، عن النبي صلى الله عليه وسلم بنحوه . وفي سياقه غرابة . ورواه أيضا من حديث قتادة ، عن عقبة بن عبد الغافر ، عن أبي سعيد ، عن النبي صلى الله عليه وسلم بنحوه . وقال تعالى : وإذ قال إبراهيم لأبيه آزر أتتخذ أصناما آلهة إني أراك وقومك في ضلال مبين . هذا يدل على أن اسم أبي إبراهيم آزر . وجمهور أهل النسب منهم ابن عباس على أن اسم أبيه تارح . وأهل الكتاب يقولون : تارخ بالخاء المعجمة . فقيل : إنه لقب بصنم كان يعبده اسمه آزر .
[ ص: 330 ] وقال ابن جرير : والصواب أن اسمه آزر ، ولعل له اسمان علمان أو أحدهما لقب ، والآخر علم ، وهذا الذي قاله محتمل ، والله أعلم .
ثم قال تعالى : وكذلك نري إبراهيم ملكوت السماوات والأرض وليكون من الموقنين فلما جن عليه الليل رأى كوكبا قال هذا ربي فلما أفل قال لا أحب الآفلين فلما رأى القمر بازغا قال هذا ربي فلما أفل قال لئن لم يهدني ربي لأكونن من القوم الضالين فلما رأى الشمس بازغة قال هذا ربي هذا أكبر فلما أفلت قال ياقوم إني بريء مما تشركون إني وجهت وجهي للذي فطر السماوات والأرض حنيفا وما أنا من المشركين وحاجه قومه قال أتحاجوني في الله وقد هداني ولا أخاف ما تشركون به إلا أن يشاء ربي شيئا وسع ربي كل شيء علما أفلا تتذكرون وكيف أخاف ما أشركتم ولا تخافون أنكم أشركتم بالله ما لم ينزل به عليكم سلطانا فأي الفريقين أحق بالأمن إن كنتم تعلمون الذين آمنوا ولم يلبسوا إيمانهم بظلم أولئك لهم الأمن وهم مهتدون وتلك حجتنا آتيناها إبراهيم على قومه نرفع درجات من نشاء إن ربك حكيم عليم [ الأنعام : 75 - 83 ] . وهذا المقام مقام مناظرة لقومه ، وبيان لهم أن هذه الأجرام المشاهدة من الكواكب النيرة لا تصلح للألوهية ، ولا أن تعبد مع الله عز وجل ؛ لأنها مخلوقة مربوبة مصنوعة مدبرة مسخرة تطلع تارة وتأفل أخرى ، فتغيب عن هذا العالم ، والرب تعالى لا يغيب عنه شيء . ولا تخفى عليه خافية [ ص: 331 ] ، بل هو الدائم الباقي بلا زوال لا إله إلا هو ، ولا رب سواه فبين لهم أولا عدم صلاحية الكوكب - قيل : هو الزهرة - لذلك ترقى منها إلى القمر الذي هو أضوأ منها وأبهى من حسنها ، ثم ترقى إلى الشمس التي هي أشد الأجرام المشاهدة ضياء وسناء وبهاء ، فبين أنها مسخرة مسيرة مقدرة مربوبة ، كما قال تعالى : ومن آياته الليل والنهار والشمس والقمر لا تسجدوا للشمس ولا للقمر واسجدوا لله الذي خلقهن إن كنتم إياه تعبدون [ فصلت : 37 ] . ولهذا قال : فلما رأى الشمس بازغة . أي طالعة قال هذا ربي هذا أكبر فلما أفلت قال يا قوم إني بريء مما تشركون إني وجهت وجهي للذي فطر السماوات والأرض حنيفا وما أنا من المشركين وحاجه قومه قال أتحاجوني في الله وقد هدان ولا أخاف ما تشركون به إلا أن يشاء ربي شيئا . أي لست أبالي في هذه الآلهة التي تعبدونها من دون الله فإنها لا تنفع شيئا ولا تسمع ولا تعقل ، بل هي مربوبة مسخرة كالكواكب ونحوها ، أو مصنوعة منحوتة منجورة .
والظاهر أن موعظته هذه في الكواكب لأهل حران فإنهم كان يعبدونها ، وهذا يرد قول من زعم أنه قال هذا حين خرج من السرب لما كان صغيرا ، كما ذكره ابن إسحاق وغيره ، وهو مستند إلى أخبار إسرائيلية لا يوثق بها ، ولا سيما إذا خالفت الحق ، وأما أهل بابل فكانوا يعبدون الأصنام ، وهم الذين ناظرهم في عبادتها ، وكسرها عليهم وأهانها وبين بطلانها ، كما قال تعالى : وقال إنما اتخذتم من دون الله أوثانا مودة بينكم في الحياة الدنيا ثم يوم القيامة يكفر بعضكم ببعض ويلعن بعضكم بعضا ومأواكم النار وما لكم من ناصرين . [ ص: 332 ] وقال في سورة الأنبياء : ولقد آتينا إبراهيم رشده من قبل وكنا به عالمين إذ قال لأبيه وقومه ما هذه التماثيل التي أنتم لها عاكفون قالوا وجدنا آباءنا لها عابدين قال لقد كنتم أنتم وآباؤكم في ضلال مبين قالوا أجئتنا بالحق أم أنت من اللاعبين قال بل ربكم رب السماوات والأرض الذي فطرهن وأنا على ذلكم من الشاهدين وتالله لأكيدن أصنامكم بعد أن تولوا مدبرين فجعلهم جذاذا إلا كبيرا لهم لعلهم إليه يرجعون قالوا من فعل هذا بآلهتنا إنه لمن الظالمين قالوا سمعنا فتى يذكرهم يقال له إبراهيم قالوا فأتوا به على أعين الناس لعلهم يشهدون قالوا أأنت فعلت هذا بآلهتنا ياإبراهيم قال بل فعله كبيرهم هذا فاسألوهم إن كانوا ينطقون فرجعوا إلى أنفسهم فقالوا إنكم أنتم الظالمون ثم نكسوا على رءوسهم لقد علمت ما هؤلاء ينطقون قال أفتعبدون من دون الله ما لا ينفعكم شيئا ولا يضركم أف لكم ولما تعبدون من دون الله أفلا تعقلون قالوا حرقوه وانصروا آلهتكم إن كنتم فاعلين قلنا يانار كوني بردا وسلاما على إبراهيم وأرادوا به كيدا فجعلناهم الأخسرين [ الأنبياء : 51 - 70 ] . وقال في سورة الشعراء : واتل عليهم نبأ إبراهيم إذ قال لأبيه وقومه ما تعبدون قالوا نعبد أصناما فنظل لها عاكفين قال هل يسمعونكم إذ تدعون أو ينفعونكم أو يضرون قالوا بل وجدنا آباءنا كذلك يفعلون قال أفرأيتم ما كنتم تعبدون أنتم وآباؤكم الأقدمون فإنهم عدو لي إلا رب العالمين الذي خلقني فهو يهدين والذي هو يطعمني ويسقين وإذا مرضت فهو يشفين والذي يميتني ثم يحيين والذي أطمع أن يغفر لي خطيئتي يوم الدين رب هب لي حكما وألحقني بالصالحين [ الشعراء : 69 - 83 ] . [ ص: 333 ] وقال تعالى في سورة الصافات : وإن من شيعته لإبراهيم إذ جاء ربه بقلب سليم إذ قال لأبيه وقومه ماذا تعبدون أئفكا آلهة دون الله تريدون فما ظنكم برب العالمين فنظر نظرة في النجوم فقال إني سقيم فتولوا عنه مدبرين فراغ إلى آلهتهم فقال ألا تأكلون ما لكم لا تنطقون فراغ عليهم ضربا باليمين فأقبلوا إليه يزفون قال أتعبدون ما تنحتون والله خلقكم وما تعملون قالوا ابنوا له بنيانا فألقوه في الجحيم فأرادوا به كيدا فجعلناهم الأسفلين [ الصافات : 83 - 98 ] .
يخبر الله تعالى عن إبراهيم خليله عليه السلام أنه أنكر على قومه عبادة الأوثان ، وحقرها عندهم ، وصغرها ، وتنقصها فقال : ما هذه التماثيل التي أنتم لها عاكفون . أي معتكفون عندها وخاضعون لها قالوا وجدنا آباءنا لها عابدين . ما كان حجتهم إلا صنيع الآباء والأجداد ، وما كانوا عليه من عبادة الأنداد قال لقد كنتم أنتم وآباؤكم في ضلال مبين . كما قال تعالى : إذ قال لأبيه وقومه ماذا تعبدون أئفكا آلهة دون الله تريدون فما ظنكم برب العالمين . قال قتادة : فما ظنكم به أنه فاعل بكم إذا لقيتموه وقد عبدتم غيره . وقال لهم : هل يسمعونكم إذ تدعون أو ينفعونكم أو يضرون قالوا بل وجدنا آباءنا كذلك يفعلون . سلموا [ ص: 334 ] له أنها لا تسمع داعيا ولا تنفع ولا تضر شيئا ، وإنما الحامل لهم على عبادتها الاقتداء بأسلافهم ، ومن هو مثلهم في الضلال من الآباء الجهال ؛ ولهذا قال لهم : أفرأيتم ما كنتم تعبدون أنتم وآباؤكم الأقدمون فإنهم عدو لي إلا رب العالمين . وهذا برهان قاطع على بطلان إلهية ما ادعوه من الأصنام ؛ لأنه تبرأ منها وتنقص بها ، فلو كانت تضر لضرته أو تؤثر لأثرت فيه قالوا أجئتنا بالحق أم أنت من اللاعبين . يقولون : هذا الكلام الذي تقوله لنا ، وتنتقص به آلهتنا ، وتطعن بسببه في آبائنا تقوله محقا جادا فيه أم لاعبا قال : بل ربكم رب السماوات والأرض الذي فطرهن وأنا على ذلكم من الشاهدين . يعني : بل أقول لكم ذلك جادا محقا ، وإنما إلهكم الله الذي لا إله إلا هو ربكم ، ورب كل شيء فاطر السماوات والأرض الخالق لهما على غير مثال سبق ، فهو المستحق للعبادة وحده لا شريك له ، وأنا على ذلكم من الشاهدين . وقوله : وتالله لأكيدن أصنامكم بعد أن تولوا مدبرين . أقسم ليكيدن هذه الأصنام التي يعبدونها بعد أن تولوا مدبرين إلى عيدهم . قيل : إنه قال هذا خفية في نفسه . وقال ابن مسعود : سمعه بعضهم . وكان لهم عيد يذهبون إليه في كل عام مرة إلى ظاهر البلد فدعاه أبوه ليحضره ، فقال : إني سقيم كما قال تعالى : فنظر نظرة في النجوم فقال إني سقيم . عرض لهم في الكلام حتى توصل إلى مقصوده من إهانة أصنامهم ، ونصرة دين الله الحق في بطلان ما هم عليه من عبادة الأصنام التي تستحق أن تكسر ، وأن تهان غاية الإهانة ، فلما خرجوا إلى عيدهم ، واستقر هو في بلدهم فراغ إلى آلهتهم . أي ذهب إليها مسرعا مستخفيا [ ص: 335 ] فوجدها في بهو عظيم ، وقد وضعوا بين أيديها أنواعا من الأطعمة قربانا إليها ، فقال لها على سبيل التهكم والازدراء : ألا تأكلون ما لكم لا تنطقون فراغ عليهم ضربا باليمين ؛ لأنها أقوى وأبطش وأسرع وأقهر ، فكسرها بقدوم في يده ، كما قال تعالى : فجعلهم جذاذا أي حطاما كسرها كلها إلا كبيرا لهم لعلهم إليه يرجعون . قيل : إنه وضع القدوم في يد الكبير إشارة إلى أنه غار أن تعبد معه هذه الصغار ، فلما رجعوا من عيدهم ، ووجدوا ما حل بمعبودهم قالوا من فعل هذا بآلهتنا إنه لمن الظالمين .
وهذا فيه دليل ظاهر لهم لو كانوا يعقلون ، وهو ما حل بآلهتهم التي كانوا يعبدونها ، فلو كانت آلهة لدفعت عن أنفسها من أرادها بسوء لكنهم قالوا من جهلهم ، وقلة عقلهم ، وكثرة ضلالهم ، وخبالهم : من فعل هذا بآلهتنا إنه لمن الظالمين قالوا سمعنا فتى يذكرهم يقال له إبراهيم . أي يذكرها بالعيب ، والتنقص لها ، والازدراء بها فهو المقيم عليها ، والكاسر لها ، وعلى قول ابن مسعود أي يذكرهم بقوله : وتالله لأكيدن أصنامكم بعد أن تولوا مدبرين . قالوا فأتوا به على أعين الناس لعلهم يشهدون . أي في الملأ الأكبر على رءوس الأشهاد لعلهم يشهدون مقالته ، ويسمعون كلامه ، ويعاينون ما يحل به من الاقتصاص منه ، وكان هذا أكبر مقاصد الخليل عليه السلام أن يجتمع الناس كلهم فيقيم على جميع عباد الأصنام الحجة على بطلان ما هم عليه ، كما قال موسى عليه السلام لفرعون : موعدكم يوم الزينة وأن يحشر الناس ضحى . [ ص: 336 ] فلما اجتمعوا وجاءوا به . كما ذكروا : قالوا أأنت فعلت هذا بآلهتنا يا إبراهيم قال بل فعله كبيرهم هذا . قيل : معناه هو الحامل لي على تكسيرها ، وإنما عرض لهم في القول فاسألوهم إن كانوا ينطقون . وإنما أراد بقوله هذا أن يبادروا إلى القول أن هذه لا تنطق فيعترفوا بأنها جماد كسائر الجمادات فرجعوا إلى أنفسهم فقالوا إنكم أنتم الظالمون . أي فعادوا على أنفسهم بالملامة فقالوا : إنكم أنتم الظالمون . أي في تركها لا حافظ لها ، ولا حارس عندها ثم نكسوا على رءوسهم . قال السدي : أي ثم رجعوا إلى الفتنة فعلى هذا يكون قوله : إنكم أنتم الظالمون . أي في عبادتها . وقال قتادة أدركت القوم حيرة سوء أي فأطرقوا ، ثم قالوا : لقد علمت ما هؤلاء ينطقون . أي لقد علمت يا إبراهيم أن هذه لا تنطق فكيف تأمرنا بسؤالها فعند ذلك قال لهم الخليل عليه السلام : أفتعبدون من دون الله ما لا ينفعكم شيئا ولا يضركم أف لكم ولما تعبدون من دون الله أفلا تعقلون . كما قال : فأقبلوا إليه يزفون . قال مجاهد : يسرعون . قال أتعبدون ما تنحتون . أي كيف تعبدون أصناما أنتم تنحتونها من الخشب والحجارة ، وتصورونها وتشكلونها كما تريدون والله خلقكم وما تعملون ؟ وسواء كانت ما مصدرية أو بمعنى الذي فمقتضى الكلام أنكم مخلوقون وهذه الأصنام مخلوقة ، فكيف يعبد مخلوق مخلوقا مثله فإنه ليس عبادتكم [ ص: 337 ] لها بأولى من عبادتها لكم ، وهذا باطل فالآخر باطل للتحكم ؛ إذ ليست العبادة تصلح ولا تجب إلا للخالق وحده لا شريك له . قالوا ابنوا له بنيانا فألقوه في الجحيم فأرادوا به كيدا فجعلناهم الأسفلين . عدلوا عن الجدال والمناظرة لما انقطعوا وغلبوا ، ولم تبق لهم حجة ولا شبهة ، إلى استعمال قوتهم وسلطانهم ، لينصروا ما هم عليه من سفههم وطغيانهم ، فكادهم الرب جل جلاله ، وأعلى كلمته ودينه وبرهانه ، كما قال تعالى : قالوا حرقوه وانصروا آلهتكم إن كنتم فاعلين قلنا يانار كوني بردا وسلاما على إبراهيم وأرادوا به كيدا فجعلناهم الأخسرين . وذلك أنهم شرعوا يجمعون حطبا من جميع ما يمكنهم من الأماكن ، فمكثوا مدة يجمعون له حتى إن المرأة منهم كانت إذا مرضت تنذر لئن عوفيت لتحملن حطبا لحريق إبراهيم ، ثم عمدوا إلى جوبة عظيمة فوضعوا فيها ذلك الحطب ، وأطلقوا فيه النار فاضطرمت وتأججت والتهبت ، وعلاها شرر لم ير مثله قط ، ثم وضعوا إبراهيم عليه السلام في كفة منجنيق صنعه لهم رجل من الأكراد يقال له هيزن ، وكان أول من صنع المجانيق فخسف الله به الأرض فهو يتجلجل فيها إلى يوم القيامة ، ثم أخذوا يقيدونه ويكتفونه ، وهو يقول : لا إله إلا أنت سبحانك ، لك الحمد ولك الملك لا شريك لك . فلما وضع الخليل عليه السلام في كفة المنجنيق مقيدا مكتوفا ، ثم ألقوه [ ص: 338 ] منه إلى النار قال : حسبنا الله ، ونعم الوكيل . كما روى البخاري ، عن ابن عباس أنه قال : حسبنا الله ونعم الوكيل . قالها إبراهيم حين ألقي في النار ، وقالها محمد حين قيل له : إن الناس قد جمعوا لكم فاخشوهم فزادهم إيمانا وقالوا حسبنا الله ونعم الوكيل فانقلبوا بنعمة من الله وفضل لم يمسسهم سوء [ آل عمران : 173 - 174 ] . الآية .
وقال أبو يعلى : حدثنا أبو هشام الرفاعي ، حدثنا إسحاق بن سليمان ، عن أبي جعفر الرازي ، عن عاصم بن أبي النجود ، عن أبي صالح ، عن أبي هريرة قال : قال صلى الله عليه وسلم : لما ألقي إبراهيم في النار قال : اللهم إنك في السماء واحد ، وأنا في الأرض واحد أعبدك .
وذكر بعض السلف أن جبريل عرض له في الهواء فقال : ألك حاجة ؟ فقال : أما إليك فلا . ويروى عن ابن عباس ، وسعيد بن جبير أنه قال : جعل ملك المطر يقول : متى أومر فأرسل المطر ؟ فكان أمر الله أسرع قلنا يا نار كوني بردا وسلاما على إبراهيم . قال علي بن أبي طالب أي لا تضريه ، وقال ابن عباس وأبو العالية : لولا أن الله قال : وسلاما على إبراهيم لأذى إبراهيم بردها . وقال كعب الأحبار : لم ينتفع أهل الأرض يومئذ بنار ، ولم يحرق منه سوى وثاقه . وقال الضحاك : يروى أن جبريل عليه السلام كان معه يمسح العرق عن وجهه لم يصبه منها شيء غيره . وقال السدي : كان معه أيضا ملك الظل . وصار إبراهيم [ ص: 339 ] عليه السلام في مثل الجونة حوله النار ، وهو في روضة خضراء ، والناس ينظرون إليه لا يقدرون على الوصول إليه ، ولا هو يخرج إليهم فعن أبي هريرة أنه قال : أحسن كلمة قالها أبو إبراهيم إذ قال لما رأى ولده على تلك الحال : نعم الرب ربك يا إبراهيم .
وروى ابن عساكر ، عن عكرمة : أن أم إبراهيم نظرت إلى ابنها عليه السلام فنادته : يا بني إني أريد أن أجيء إليك ، فادع الله أن ينجيني من حر النار حولك . فقال : نعم . فأقبلت إليه لا يمسها شيء من حر النار ، فلما وصلت إليه اعتنقته ، وقبلته ، ثم عادت . وعن المنهال بن عمرو أنه قال : أخبرت أن إبراهيم مكث هناك إما أربعين ، وإما خمسين يوما ، وأنه قال : ما كنت أياما وليالي أطيب عيشا إذ كنت فيها ، ووددت أن عيشي وحياتي كلها مثل إذ كنت فيها . صلوات الله وسلامه عليه .
فأرادوا أن ينتصروا فخذلوا ، وأرادوا أن يرتفعوا فاتضعوا ، وأرادوا أن يغلبوا فغلبوا قال الله تعالى : وأرادوا به كيدا فجعلناهم الأخسرين . وفي الآية الأخرى : الأسفلين ففازوا بالخسارة والسفال هذا في الدنيا ، وأما في الآخرة فإن نارهم لا تكون عليهم بردا ولا سلاما ، ولا يلقون فيها تحية ولا سلاما ، بل هي كما قال تعالى : إنها ساءت مستقرا ومقاما .
قال البخاري : حدثنا عبيد الله بن موسى أو ابن سلام عنه ، [ ص: 340 ] أنبأنا ابن جريج ، عن عبد الحميد بن جبير ، عن سعيد بن المسيب ، عن أم شريك أن رسول الله صلى الله عليه وسلم أمر بقتل الوزغ . وقال كان ينفخ على إبراهيم . ورواه مسلم من حديث ابن جريج ، وأخرجاه ، والنسائي ، وابن ماجه من حديث سفيان بن عيينة ، كلاهما عن عبد الحميد بن جبير بن شيبة به . وقال أحمد : حدثنا محمد بن بكر ، حدثنا ابن جريج أخبرني عبد الله بن عبد الرحمن بن أبي أمية أن نافعا مولى ابن عمر أخبره أن عائشة أخبرته أن رسول الله صلى الله عليه وسلم قال : اقتلوا الوزغ فإنه كان ينفخ على إبراهيم النار . قال : فكانت عائشة تقتلهن . وقال أحمد : حدثنا إسماعيل ، حدثنا أيوب ، عن نافع أن امرأة دخلت على عائشة ، فإذا رمح منصوب فقالت : ما هذا الرمح؟ فقالت : نقتل به الأوزاغ ، ثم حدثت عن رسول الله صلى الله عليه وسلم : أن إبراهيم لما ألقي في النار جعلت الدواب كلها تطفئ عنه إلا الوزغ فإنه جعل ينفخها عليه . تفرد به أحمد من هذين الوجهين .
وقال أحمد : حدثنا عفان ، حدثنا جرير ، حدثنا نافع حدثتني سائبة مولاة الفاكه بن المغيرة قالت دخلت على عائشة [ ص: 341 ] فرأيت في بيتها رمحا موضوعا فقلت : يا أم المؤمنين ما تصنعين بهذا الرمح ؟ قالت : هذا لهذه الأوزاغ نقتلهن به فإن رسول الله صلى الله عليه وسلم ، حدثنا أن إبراهيم حين ألقي في النار لم تكن في الأرض دابة إلا تطفئ عنه النار غير الوزغ كان ينفخ عليه . فأمرنا رسول الله صلى الله عليه وسلم بقتله . ورواه ابن ماجه ، عن أبي بكر بن أبي شيبة ، عن يونس بن محمد ، عن جرير بن حازم به .""";

/// LootStory
const String lootStory =

""""يقول المولى عز وجل فى كتابه العزيز :"نحن نقص عليك أحسن القصص بما أوحينا إليك هذا القرآن وإن كنت من قبله لمن الغافلين" ( يوسف - 30). من يتدبر آيات القرآن الكريم يرى أنها اشتملت على قصص الأنبياء عليهم الصلاة والسلام ، مثل قصة آدم ونوح وصالح وإبراهيم عليهم السلام وغيرهم الكثير.
والمتتبع لآيات الذكر الحكيم يجد أنها تناولت قصصاً كثيرة منها قصص الأنبياء التي تكررت في أكثر من موضع وذلك لحكمة ولزيادة العبر والعظات وتذكير المؤمن دائما بعاقبة المكذبين من الأمم السابقة ، وليبقى في حالة خشية من الله تعالى وخوف من عذابه.
وفي سلسلة من الحلقات نتوقف مع أشهر القصص في القرآن ، ونلقى الضوء عليها ونبين الحكمة والعظة والعبرة من ذكرها ونسردها بأسلوب شائق هذه القصص.
إعداد: منى الحسينى
"كذبت قوم لوط المرسلينہ إذ قال لهم أخوهم لوط ألا تتقون ہ إني لكم رسول أمين".
سيدنا لوط عليه السلام هو أول من آمن برسالة أبى الأنبياء إبراهيم عليه السلام ، وهو ابن أخيه أرسله الله سبحانه وتعالى إلى قومه بأرض سدوم بالأردن ، كان القوم الذين بعث إليهم لوط عليه السلام يرتكبون أفظع القبائح وأنكرها ، كانوا يقطعون الطريق ويخونون الرفيق ويتواصون بالإثم ، ولا يتناهون عن منكر ، كانوا يفعلون جريمة لم يسبقهم بها أحد على الأرض ، كانوا يأتون الرجال شهوة من دون النساء « ولوطا إذ قال لقومه أتأتون الفاحشة وأنتم تبصرونہ أئنكم لتأتون الرجال شهوة من دون النساء بل أنتم قوم تجهلون)
أرسل الله لهم سيدنا لوط عليه السلام لكى يدعوهم إلى عبادة الله وحده لا شريك له وينهاهم عن المحرمات والفواحش ، جاهدهم لوط جهادا عظيما وأقام عليهم حجته ، مرت شهور وسنوات وهو مستمر فى دعوته بغير أن يؤمن معه أحد ، لم يؤمن به سوى أهل بيته عدا زوجته كانت كافرة «ضرب الله مثلا للذين كفروا امرأة نوح امرأة لوط ، استمر قوم لوط على كفرهم وفجورهم ، فتمادوا فى ضلالهم وطغيانهم ، كان سيدنا لوط صابرا على قومه لسنوات عديدة ، ولم يؤمن به أحد ، بل راحوا يهزأون برسالته ويقولون له «إلا أن قالوا ائتنا بعذاب الله إن كنت من الصادقين لما وقع هذا يئس لوط عليه السلام منهم ودعا الله أن ينصره ويهلك المفسدين ، فأحل الله بهم من البأس الذى لا يرد ما لم يكن فى حسبانهم وجعلهم عبرة يتعظ منها الناس.
بعدها أرسل الله له ثلاثة من الملائكة فى صورة رجال وقصدوا منزل سيدنا لوط عليه السلام سألهم من أين جاءوا وما هى وجهتهم ، فصمتوا عن إجابته وسألوه أن يستضيفهم ، وهنا استحى وقال لهم لا يوجد على سطح الأرض أخبث من أهل هذا البلد لكى يصرفهم عن المبيت فى هذه القرية ، وحدثهم أنهم خبثاء ويخذون ضيوفهم ، كان بداخله صراع محاولا التوفيق بين صرف ضيوفه عن المبيت فى القرية دون إحراجهم ، وعدم الإخلال بكرم الضيافة وحاول التلميح لهم أن يستمروا فى رحلتهم دون النزول بهذه القرية ، فلما رأى سيدنا لوط إصرارهم على المبيت فى القرية اقترح عليهم أن ينتظروا حتى يأتى المغرب وتنزل العتمة على المدينة كى لا يراهم أحد من أهل القرية ، حل الليل على المدينة وصحب سيدنا لوط ضيوفه إلى بيته ولم يرهم أحد من أهل المدينة ، ولكن ما أن شاهدت زوجته الضيوف حتى تسللت خارج المنزل دون أن يدرى وأسرعت إلى قومها وأخبرتهم الخبر ، انتشر الخبر فى المدينة وهرع قومه إليه «وجاءه قومه يهرعون إليه ومن قبل كانوا يعملون السيئات ، وتحققت نبوءة سيدنا لوط وبدأ اليوم العصيب «وقال هذا يوم عصيب وقف القوم على باب بيت سيدنا لوط وخرج إليهم متعلقا بأمل أخير ، وأن يبين لهم أن النساء أطهر من الرجال إلى الرجال « قال يا قوم هؤلاء بناتى هن أطهر لكم فاتقوا الله ولا تخزون فى ضيفى أليس منكم رجل رشيد ، كان سيدنا لوط يحاول أن يلمس نفوسهم من جانب التقوى والفطرة وأن يتقوا الله ، ويحاول أن يحثهم على أنه ينبغى عليهم إكرام الضيف لا فضحه.
انتظر قومه حتى انتهى من موعظته القصيرة ، وظلوا يضحكون ولم تؤثر فيهم كلمه واحدة مما قالها لهم سيدنا لوط عليه السلام. « قالوا لقد علمت ما لنا فى بناتك من حق وإنك لتعلم ما نريد دخل لوط عليه السلام غاضبا وأغلق باب بيته ، ووقف يستمع إلى الضحكات والضربات التى تنهال على الباب ، ويرتعد وراء الباب خجلا وحزنا وأسفا ، لكن كان الغرباء يجلسون فى هدوء ، ودهش سيدنا لوط من هدوئهم ، وبدأت أخشاب الباب أن تتقوس وصرخ سيدنا لوط فى لحظة يأس « قال لو أن لى بكم قوة أو آوى إلى ركن رشيد ، حين قال نبى الله لوط هذه الكلمات تحرك ضيوفه ونهضوا فجأه ، وأفهموه أنه يأوى إلى ركن شديد وهوالله « قالوا يا لوط إنا رسل ربك لن يصلوا إليك ، ولا تخف يا لوط نحن من الملائكة قيل إنهم جبريل وميكائيل وإسرافيل ولن يصل إليك هؤلاء القوم. وفجأة انكسر الباب واندفع القوم داخل بيت سيدنا لوط ، ونهض جبريل عليه السلام وأشار بطرف جناحه فطمست أعينهم « ولقد راودوه عن ضيفه فطمسنا أعينهم فذوقوا عذابى ونذر ، أمر الملائكة بعدها سيدنا لوط أن يصحب أهله أثناء اليل ويخرج ، وأنهم سيسمعون أصواتاً تزلزل الجبال لا يلتفت أحد إليها ، كى لا يصيبه ما يصيب القوم ، فهو عذاب يكفى لوقوعه للمرء مجرد النظر إليه ، وأفهموه أن امرأته كافرة مثلهم وستلتفت خلفها فيصيبها ما أصابهم ، وأنبأوه أن موعد العذاب هو الصبح «فأسر بأهلك بقطع من الليل ولايلتفت منكم أحد إلا امرأتك إنه مصيبها ما أصابهم إن موعدهم الصبح أليس الصبح بقريب ، ولما جاء أمر الله قيل إن جبريل عليه السلام اقتلع بطرف جناحه مدنها السبع بمن فيهن من الأمم وما معهم من الحيوانات فرفعها حتى بلغت عنان السماء حتى سمعت الملائكة أصوات ديكتهم ونباح كلابهم ثم قلبها عليهم فجعل عاليها سافلها ، وأثناء السقوط كانت السماء تمطرهم بحجارة من الجحيم « فلما جاء أمرنا جعلنا عاليها سافلها وأمطرنا عليها حجارة من سجيل منضودھمسومة عند ربك وما هى من الظالمين ببعيد ، وانتهى قوم لوط تماما.
""";

/// IsmailStory
const String ismailStory =
"""   " واذكر في الكتاب إسماعيل إنه كان صادق الوعد وكان رسولا نبيا"
التقى سيدنا إسماعيل بأول محنة وهو طفل تركه والده سيدنا إبراهيم عليه السلام هو وأمه هاجر فى الوادي وكان طفلا رضيعا لم يفطم بعد ، كان الوادي يخلو تماما من علامات الحياة وبعد يومين انتهى الماء والطعام وأحست هاجر وإسماعيل بالعطش ، بدأ إسماعيل يبكى من العطش. تركته أمه وراحت تمشى مسرعة تبحث عن ماء حتى وصلت إلى جبل اسمه (الصفا) وراحت تبحث عن بئر لكن لم يكن هناك شيء ونزلت مسرعة من الصفا حتى وصلت إلى جبل اسمه (المروة) فلم تجد شيئا أيضا ، ظلت تذهب وتجيء سبع مرات بين الجبلين ، عادت هاجر بعد المرة السابعة وهى مجهدة ومتعبة وجلست بجوار ابنها الذى كان قد بح صوته من البكاء والعطش.وفى هذه اللحظة اليائسة أدركتها رحمة الله وضرب إسماعيل بقدمه الأرض وهو يبكى فانفجرت تحت قدمه بئر زمزم « ربنا إنى أسكنت من ذريتى بواد غير ذى زرع عند بيتك المحرم ربنا ليقيموا الصلاة فاجعل أفئدة من الناس تهوى إليهم وارزقهم من الثمرات لعلهم يشكرون وراحت الأم تشكر ربها وصدق ظنها حين قالت لن نضيع مادام الله معنا .
التقى سيدنا إسماعيل بالمحنة الثانية فى حياته وهو شاب عندما أوحى الله سبحانه وتعالى إلى سيدنا إبراهيم أن يذبحه « فلما بلغ معه السعي قال يابنى إني أرى فى المنام أنى أذبحك فانظر ماذا ترى فقال له إسماعيل عليه السلام إن هذا أمر يا أبى فبادر بتنفيذه « يأبت أفعل ما تؤمر ستجدنى إن شاء الله من الصابرين ، وها هو إبراهيم عليه السلام يكتشف أن ابنه ينافسه فى حب الله ولا نعرف أى مشاعر جاشت فى نفس إبراهيم بعد استسلام ابنه الصابر . ينقلنا الحق تبارك وتعالى نقلة خاطفة فإذا إسماعيل راقداً على الأرض ووجهه فى الأرض كى لا يرى نفسه وهو يذبح . وإذا بإبراهيم عليه السلام يرفع يده بالسكين عندئذ فقط وفى اللحظة التى كان السكين فيها يتهيأ لإمضاء أمره نادى الله إبراهيم وانتهى الاختبار وفدى الله إسماعيل بذبح عظيم « وفديناه بذبح عظيم .
وجمع الله لسيدنا إسماعيل بين الرسالة والنبوة وشرفه أعظم تشريف حين جاء من نسله خاتم المرسلين سيدنا محمد صلى الله عليه وسلم ، وقيل إن إسماعيل أول من نطق بالعربية البينة وهو ابن أربعة عشر عاما وأول من ركب الخيل واستأنسها .وبرع في رمى السهام وسهل اللغة فكان أول من نطق بالعربية الفصحى. كان إسماعيل عليه السلام نبيا صالحاً يحث أهله على طاعة الله وخصوصا أداء الصلاة التى هى عماد الدين وأساسه ، ويحثهم أيضا على أداء الزكاة ، ولهذا رضى الله عنه «واذكر فى الكتاب إسماعيل إنه كان صادق الوعد وكان رسولا نبيا - وكان يأمر أهله بالصلاة والزكاة وكان عند ربه مرضيا.
عاش سيدنا إسماعيل فى شبه الجزيرة العربية ، وساعدت مياه زمزم على سكنى المنطقة وتعميرها. كبر سيدنا إسماعيل وبلغ أشده ، وقتها رجع إبراهيم عليه السلام إلى مكة بعد مرور أعوام كثيرة ليبحث عن زوجته وولده إسماعيل ، وبعد معرفته مكانهما لقى ولده شب على الصلاح وحسن الخلق والطاعة ، وكان رجوع إبراهيم بأمر من الله وقال لولده إسماعيل إن الله أمرني أن ابني هنا بيتا ، وها هو قد صدر الأمر الإلهي ببناء بيت الله الحرام فى نفس المكان الذى ترك فيه إبراهيم عليه السلام سيدنا إسماعيل وهو طفل رضيع مع أمه هاجر. وهو أول بيت وضع للناس فى الأرض ، هو أول مكان يعبد فيه الإنسان ربه ، وبدأ بناء الكعبة.
وقد قام إبراهيم وإسماعيل عليهما السلام ببناء الكعبة وحدهما وبذلا جهدا استحالت بعد ذلك محاكاته على آلاف الرجال ، أى جهد بذله النبيان الكريمان وحدهما فى بناء بيت الله ، لكنهما كان يشغلهما أمر العقيدة «وإذ يرفع إبراهيم القواعد من البيت وإسماعيل ربنا تقبل منا إنك أنت السميع العليم - ربنا واجعلنا مسلمين لك ومن ذريتنا أمة مسلمة لك وأرنا مناسكنا وتب علينا إنك أنت التواب الرحيم وانتهى بناء البيت وأراد إبراهيم أن يضع حجرا مميزا يكون علامة خاصة يبدأ منها الطواف حول الكعبة.أمر إسماعيل أن يأتيه بحجر مميز يختلف عن لون الحجارة المستخدمة فى البناء وسار إسماعيل عليه السلام على قدر ما فى وسعه من جهد وذلك تلبيه لأمر أبيه ، وحين عاد كان سيدنا إبراهيم قد وضع الحجر الأسود فى مكانه فقال له إسماعيل عليه السلام من الذى أحضره إليك؟ قال أحضره جبريل عليه السلام . وانتهى بناء الكعبة وبدأ طواف الموحدين والمسلمين.
 """ ;

/// IshaqStory
const String ishaqStory =
"""
قال الله تبارك وتعالى عن نبيه اسحاق فى صورة الصافات :{وَبَشَّرْنَاهُ بِإِسْحَاقَ نَبِيًّا مِّنَ الصَّالِحِينَ * وَبَارَكْنَا عَلَيْهِ وَعَلَى إِسْحَاقَ وَمِن ذُرِّيَّتِهِمَا مُحْسِنٌ وَظَالِمٌ لِّنَفْسِهِ مُبِينٌ}.
نسب سيدنا اسحاق عليه السلام:
هو إسحاق ابن إبراهيم عليهما افضل الصلاة وأتم التسليم، وهو الابن الثاني لإبراهيم والذي كانت الملائكة قد بشرته به.
وقيل فى ذلك ان عمر سيدنا إبراهيم فى ال 120 من العمر حين وضعت زوجته سارة حملها فى نبى الله اسحاق مائة وعشرين سنة وكانت امنا سارة فى ال90 من عمرها. وهو الارجح فى اقوال العلماء.
سيدنا اسحاق عليه السلام هو أحد الأنبياء الأربعة المتناسلون، وهم من ترتيب الابناء ثم الاباء كالتالى: يوسف ابن يعقوب  ابن إسحاق ابن إبراهيم عليهم الصلاة والسلام.
رسالته ونبوته:
كانت رسالة نبى الله إسحاق بن إبراهيم تدعو بالطبع الى دين الاسلام والتوحيد، وقد أُنزل إليه الوحى بشريعة مبنياً على مبادئ الإسلام ليعلمها للناس. وقد أُرسل إلى قوم يدعون الكنعانيين كانوا يسكنون في بلاد الشام وومناطق فلسطين حاليا وقد كان يعيش بينهم.
وقد أوصى إبراهيم عليه السلام ابنه إسحاق ألا يتخذ زوجة الا من أهل أبيه، وبالفعل فقد تزوج إسحاق السيدة رفقة بنت ابن عمه، وكانت عاقرًا لا تستطيع الانجاب فدعا الله فاستجاب له ورزقهما بتوأمين هما العيص، و يعقوب نبي الله إسرائيل عليهم السلام جميعا.
اضغط هنا لقراءة تاريخ بنى اسرائيل كاملا
قد قال رسول الله صلى الله عليه وسلم فى ذكر سيدنا إسحاق عليه السلام قائلا: “إنَّ الكريم ابن الكريم ابن الكريم ابن الكريم يوسف بن يعقوب بن إسحاق بن إبراهيم”.
وقد تقدم في قصة إبراهيم عليه السلام كيف بشرت الملائكة إبراهيم الخليل بإسحاق.
وفاته:
وارجح الاقوال أن نبي الله إسحاق عليه السلام عاش 180 عاما ثم مات في قرية تسمى حبرون بفلسطين ومكانها مدينة الخليل اليوم وهى ايضا موطن سيدنا إبراهيم عليه السلام، وقد قام بدفنه ولداه العيص ويعقوب في نفس المغارة التي كان اسحاق قد دفن فيها والده إبراهيم عليهم الصلاة والسلام.
ولا يجب أبدا الى الالتفات الى اى من اكاذيب اليهود السخيفة فيما يخص نبى الله اسحاق عليه السلام الا فيما سبق ذكره
ايات القران التى ذكرت قصة نبى الله اسحاق عليه السلام
 اسم النبي (إسحاق) ورد بلفظ إسحاق في القرآن الكريم سبع عشرة مرة: ثلاث مرات في سورة البقرة: [قَالُوا نَعْبُدُ إِلَهَكَ وَإِلَهَ آبَائِكَ إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ ] (البقرة: 133)
[وَمَا أُنْزِلَ إِلَيْنَا وَمَا أُنْزِلَ إِلَى إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ وَيَعْقُوبَ وَالْأَسْبَاطِ] (البقرة: 136)
[أَمْ تَقُولُونَ إِنَّ إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ وَيَعْقُوبَ وَالْأَسْبَاطَ كَانُوا هُوداً أَوْ نَصَارَى] (البقرة: 140)
وواحدة في سورة آل عمران: [قُلْ آمَنَّا بِاللَّهِ وَمَا أُنْزِلَ عَلَيْنَا وَمَا أُنْزِلَ عَلَى إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ ]
(آل عمران: 84)
وفي سورة النساء واحدة: [ وَأَوْحَيْنَا إِلَى إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ وَيَعْقُوبَ وَالْأَسْبَاطِ وَعِيسَى ]
(النساء: 163)
وفي الأنعام واحدة: [وَوَهَبْنَا لَهُ إِسْحَاقَ وَيَعْقُوبَ كُلّاً هَدَيْنَا ](الأنعام: 84)
واثنتان في هود: [ فَبَشَّرْنَاهَا بِإِسْحَاقَ وَمِنْ وَرَاءِ إِسْحَاقَ يَعْقُوبَ](هود: 71)
واثنتان في سورة يوسف: [كَمَا أَتَمَّهَا عَلَى أَبَوَيْكَ مِنْ قَبْلُ إِبْرَاهِيمَ وَإِسْحَاقَ](يوسف: 6)
[وَاتَّبَعْتُ مِلَّةَ آبَائي إِبْرَاهِيمَ وَإِسْحَاقَ وَيَعْقُوبَ](يوسف: 38)
وفي سورة إبراهيم واحدة: [الْحَمْدُ لِلَّهِ الَّذِي وَهَبَ لِي عَلَى الْكِبَرِ إِسْمَاعِيلَ وَإِسْحَاقَ ] (إبراهيم: 39)
وفي سورة مريم واحدة: [وَهَبْنَا لَهُ إِسْحَاقَ وَيَعْقُوبَ وَكُلّاً جَعَلْنَا نَبِيّاً](مريم: 49)
وواحدة في سورة الأنبياء: [وَوَهَبْنَا لَهُ إِسْحَاقَ وَيَعْقُوبَ نَافِلَةً](الأنبياء: 72)
وفي سورة العنكبوت واحدة: [وَوَهَبْنَا لَهُ إِسْحَاقَ وَيَعْقُوبَ وَجَعَلْنَا فِي ذُرِّيَّتِهِ النُّبُوَّةَ وَالْكِتَابَ] (العنكبوت: 27)
واثنتان في سورة الصافات: [وَبَشَّرْنَاهُ بِإِسْحَاقَ نَبِيّاً مِنَ الصَّالِحِينَ] (الصافات:112) 
[وَبَارَكْنَا عَلَيْهِ وَعَلَى إِسْحَاقَ] (الصافات: 113) 
وواحدة في سورة صّ: [وَاذْكُرْ عِبَادَنَا إِبْرَاهِيمَ وَإِسْحَاقَ وَيَعْقُوبَ](صّ: 45)
 ابناء النبي اسحق, ابناء سيدنا اسماعيل, ام النبي اسحق, تاريخ بني اسرائيل, شخصية اسحق في الكتاب المقدس, قصة سيدنا ابراهيم, قصة سيدنا اسماعيل, قصة سيدنا يعقوب, قصة من قصص الانبياء, قصص اطفال الانبياء, قصص الانبياء, قصص الانبياء للاطفال مكتوبة, قصص الانبياء مختصرة, قصص الانبياء مكتوبة, قصص الانبياء مكتوبة بالتفصيل, كم كان عمر اسحق عندما مات, من قصص الانبياء
""" ;

/// YaQoobStory
const String yaQoobStory =
"""روى البخاري في (صحيحه) عن ابن عمر رضي الله عنهما عن النبي صلى الله عليه وسلم، قال: (الكريم ابن الكريم ابن الكريم ابن الكريم يوسف بن يعقوب بن إسحاق بن إبراهيم عليهم السلام)، فقد وصف صلى الله عليه وسلم النبي يعقوب بأنه (الكريم)، وأدرجه في سلسلة آبائه الأنبياء الكرام إبراهيم وإسحاق عليهما السلام. وحديث القرآن الكريم عن النبي يعقوب عليه السلام جاء مقتضباً، وغاية ما ذكره بخصوص هذا النبي الكريم الآيات التالية: 
قوله سبحانه: {ووصى بها إبراهيم بنيه ويعقوب يا بني إن الله اصطفى لكم الدين فلا تموتن إلا وأنتم مسلمون} (البقرة:132). 
وقوله تعالى: {أم كنتم شهداء إذ حضر يعقوب الموت إذ قال لبنيه ما تعبدون من بعدي قالوا نعبد إلهك وإله آبائك إبراهيم وإسماعيل وإسحاق إلها واحدا ونحن له مسلمون} (البقرة:133). 
وقوله عز وجل: {واذكر عبادنا إبراهيم وإسحاق ويعقوب أولي الأيدي والأبصار} (ص:45).
وذكر القرآن الكريم يعقوب عليه السلام في معرض الحديث عن قصة ابنه يوسف، وسوف نقف عليها بالتفصيل في مقال آخر.
وقد أطلق القرآن الكريم على يعقوب عليه السلام اسم إسرائيل، وجاء ذلك في موضعين: 
أحدهما: قوله تبارك وتعالى: {كل الطعام كان حلا لبني إسرائيل إلا ما حرم إسرائيل على نفسه من قبل أن تنزل التوراة} (آل عمران:93). 
الثاني: قوله عز وجل: {أولئك الذين أنعم الله عليهم من النبيين من ذرية آدم وممن حملنا مع نوح ومن ذرية إبراهيم وإسرائيل وممن هدينا واجتبينا} (مريم:58). ولفظ إسرائيل معناه: صفوة الله، أو عبد الله. 
وقد حفل القرآن الكريم بالعديد من الآيات التي تخاطب ذرية إسرائيل عليه السلام، حيث ورد هذا الخطاب في نحو أربعين موضعاً في القرآن الكريم، نحو قوله تعالى: {يا بني إسرائيل اذكروا نعمتي التي أنعمت عليكم وأوفوا بعهدي أوف بعهدكم وإياي فارهبون} (البقرة:40).
والآيات التي ذكرها القرآن الكريم عن النبي يعقوب عليه السلام كلها تدل على أنه كان على ملة أبيه إبراهيم عليه السلام، وقد أوصى بنيه من بعده باتباع ملة أبية إبراهيم حنيفاً، وعدم الحيد عنها؛ لأنها هي ملة الإسلام لله وحده.
كما أخبرنا القرآن الكريم أن يعقوب عليه السلام كان من أهل العمل الصالح، والعلم النافع، والقوة في العبادة، والبصيرة النافذة. وقد ذكر ابن كثير في (البداية والنهاية) قصة يعقوب مفصلة، وحاصل ما جاء فيها: إن إسحاق عليه السلام لما تزوج رُزق بولدين، أحدهما: سماه عيصو. والثاني: خرج وهو آخذ بعقب أخيه، فسموه يعقوب، وهو إسرائيل، الذي ينتسب إليه بنو إسرائيل. ثم إن يعقوب لما كبر قَدِمَ على خاله لابان في أرض حران، وكانت له ابنتان: اسم الكبرى ليا ، واسم الصغرى راحيل، وكانت أحسنهما، وأجملهما، فطلب يعقوب الزواج بالصغرى من خاله، فأجابه إلى ذلك بشرط أن يرعى على غنمه سبع سنين، فلما مضت المدة على خاله لابان صنع طعاماً، وجمع الناس عليه، وزف إليه ليلاً ابنته الكبرى ليا. فلما أصبح يعقوب إذا هي ليا، فقال لخاله: لم غدرت بي؟! وأنت إنما خطبت إليك راحيل، فقال: إنه ليس من سنتنا أن نزوج الصغرى قبل الكبرى، فان أحببت أختها فاعمل سبع سنين أخرى وازوجكها، فعمل سبع سنين، وادخلها عليه مع أختها، وكان ذلك سائغاً في ملتهم، ثم نُسخ في شريعة التوراة.
ثم إن راحيل دعت الله تعالى وسألته أن يهب لها غلاماً من يعقوب، فسمع الله ندائها، وأجاب دعائها، فحملت من نبي الله يعقوب، فولدت له غلاماً عظيماً شريفاً حسناً جميلاً، سمته يوسف، كل هذا وهم مقيمون بأرض حران، وهو يرعى على خاله غنمه بعد دخوله على البنتين ست سنين أخرى، فصار مدة مقامه عشرين سنة، فطلب يعقوب من خاله لابان أن يسرحه ليمر إلى أهله، فقال له خاله: إني قد بورك لي بسببك، فسلني من مالي ما شئت.
وأوحى الله تعالى إلى يعقوب عليه السلام أن يرجع إلى بلاد أبيه وقومه، ووعده بأن يكون معه، فعرض ذلك على أهله، فأجابوه مبادرين إلى طاعته، فحمل أهله وماله، وقفل قاصداً بلاده.
ثم مر يعقوب على أورشليم قرية شخيم، فنزل قبل القرية، واشترى مزرعة شخيم بن جمور بمائة نعجة، فضرب هنالك فسطاطه، وابتنى ثَمَّ مذبحاً، فسماه إيل إله إسرائيل، وأمر الله ببنائه ليستعلن له فيه، وهو بيت المقدس اليوم الذي جدده بعد ذلك سليمان بن داود عليهما السلام.
وذكر أصحاب السير أن أولاد يعقوب عليه السلام الذكور كانوا اثني عشر رجلاً؛ فمن (ليا): روبيل، وشمعون، ولاوي، ويهوذا، وايساخر، وزايلون. ومن (راحيل): يوسف وبنيامين. 
وجاء يعقوب إلى أبيه إسحاق فأقام عنده بقرية (حبرون) التي في أرض كنعان حيث كان يسكن إبراهيم عليه السلام، ثم مرض إسحاق ومات عن مائة وثمانين سنة، ودفنه ابناه العيص ويعقوب مع أبيه إبراهيم الخليل.
وقد قص علينا القرآن الكريم أن يعقوب وأولاده استدعاهم يوسف عليه السلام للحضور إلى مصر، فتركوا فلسطين، ولبوا دعوته، وحضروا إلى مصر، قال تعالى: {فلما دخلوا على يوسف آوى إليه أبويه وقال ادخلوا مصر إن شاء الله آمنين * ورفع أبويه على العرش وخروا له سجدا وقال يا أبت هذا تأويل رؤياي من قبل قد جعلها ربي حقا وقد أحسن بي إذ أخرجني من السجن وجاء بكم من البدو من بعد أن نزغ الشيطان بيني وبين إخوتي إن ربي لطيف لما يشاء إنه هو العليم الحكيم} (يوسف:99-100). 
وذكر أهل السير أن يعقوب عندما دخل مصر كان عمره مائة وثلاثين سنة، وأقام بمصر سبع عشرة سنة. ثم لحق بربه، وسنُّه مائة وسبعة وأربعون عاماً، فاستأذن يوسف عليه السلام ملك مصر في الخروج مع أبيه يعقوب ليدفنه عند أهله بفلسطين، فأذن له، وتم دفن يعقوب عليه السلام ببلدة (حبرون) المسماة بالخليل اليوم، بجوار جده إبراهيم وأبيه إسحاق عليهما السلام.
""" ;
/// YoussefStory
const String youssefStory =
"""
""";

/// ShoaibStory
const String shoaibStory =
"""
""";

/// AiobStory
const String aiobStory =
""" " وأيوب إذ نادى ربه أني مسني الضر وأنت أرحم الراحمين "
يقول البشر عن صبر أعظم الصابرين ، إنه كصبر أيوب ، إذ ذهب أيوب مثالا على الصبر فى كل زمان. ذكر الله سبحانه وتعالي قصة أيوب عليه السلام وابتلاء الله له بأنواع المحن إذ دعا ربه بخشوع وتضرع ، فقال يارب أني قد نالني البلاء والمرض والشدة والكرب العظيم ، فكان له مال كثير وأولاد. أذهب الله المال وأهلك الأولاد فصبر سيدنا أيوب ، ثم سلط الله سبحانه وتعالى المرض والبلاء الشديد علي جسمه فصبر أيضاً وحين مر عليه قومه قالوا - ما أصابه كل هذا إلا أنه ارتكب الذنوب العظيمة - فقال لهم أيوب إن بى قلبا شاكراً وحامداً لله وجسداً على البلاء صابراً ، عندئذ تضرع إلى الله عز وجل وتوسل إليه أن ينجيه من هذا العذاب فكشف الله عنه ضره ، وحين قال يارب أنت أرحم الراحمين فارحمني ووصف نفسه بالضعف والعجز ووصف ربه القادر بالرحمة ، أجاب الله تضرعه وقبل دعاءه وأزال ما أصابه من ضر وبلاء « وأيوب إذ نادى ربه أني مسنى الضر وأنت أرحم الراحمين.
ويقول ابن مسعود رضي الله عنه لقد مات أولاده السبعة من الذكور ومثلهم من الإناث ، فلما عوفى ولدت له زوجته سبعة بنين وسبع بنات وعوضه الله خيراً. ولقد فعل الله به ذلك من أجل رحمته به بعد امتحانه وابتلائه ليكون عبرة لغيره من المؤمنين المتقين الصالحين ليصبروا كما صبر سيدنا أيوب عليه السلام ، ويقول بعض العلماء أن أيوب عليه السلام مكث فى البلاء ثماني عشرة سنة.
كان الشيطان كلما يرى أيوب عليه السلام شاكرا لله يزداد غيظه ، بعد أنحدار أيوب من قمة الثراء إلى شدة الفقر ، شكر أيوب ربه وخر ساجدا له وقال إن الله يؤتى الملك من يشاء وينزع الملك ممن يشاء ، فلم يجد الشيطان أمامه إلا أولاد أيوب فأباحهما الله له لكى يثبت الله له أن أيوب عبد مؤمن خالص الإيمان ، فمات أولاد أيوب جميعا ، وهنا سجد لله ، وقال فله الحمد معطيها وسالبها ، وعاد الشيطان يدعو الله ويقول إن أيوب لم يزل صابرا لأنه معافى فى جسده ولو أنك سلطتني يارب على بدنه فسوف يكف عن صبره. ونزل المرض على جسد أيوب وظل على صبره وشكره لله تعالى ، يحمد الله على أيام الصحة ويحمده سبحانه وتعالى على بلاء المرض ، فهو يشكر الله في الحالتين.
ازداد غيظ الشيطان فلم يعرف ماذا يفعل فهو يريد إغواء سيدنا أيوب وإخراجه من صبره وشكره لله بأى طريقة ، وعندما يئس من إغواء سيدنا أيوب فكر الشيطان أن يملأ قلب إمرأة أيوب باليأس ، حتي ذهبت إلى زوجها ، وقالت له حتى متى يعذبك الله ، فأين المال والأولاد والصديق والرفيق وأين شبابك وعزك القديم ، لو دعوت الله عز وجل رحمك مما أنت فيه ، فقال لها كم لبثنا في الرخاء ، فقالت ثمانين سنة ، فقال لها أيوب عليه السلام إني لأستحي من الله أن أدعوه وما مكثت في بلائي المدة التي مكثتها في رخائي.
لقد بدأ إيمانك يضعف ، وضاق بقضاء الله قلبك لئن برئت وعادت إلي القوة لأضربنك مائة عصا وحرام بعد اليوم أن آكل من يديك طعاماً أو شراباً أو أكلفك أمراً فاذهبي عني. وذهبت زوجته وبقي سيدنا أيوب عليه السلام وحيدا صابرا يحتمل ما لا يحتمله الجبال .
سيدنا أيوب عليه السلام العبد الصالح الذي ابتلي بأنواع البلاء الشديد فصبر ، وأخيراً فزع سيدنا أيوب عليه السلام إلى الله داعيا الله أن يشفيه فاستجاب له الله « وأيوب إذا نادى ربه أني مسني الضر وأنت أرحم الراحمين ہ فاستجبنا له فكشفنا ما به من ضرû ، فقد نادى سيدنا أيوب ربه متضرعاً خاشعاً متوسلاً إليه قائلاً إني مسني الشيطان بمشقة وألم شديد في بدني وأصبت في مالي وأهلي .« واذكر عبدنا أيوب إذ نادي ربه أني مسني الشيطان بنصب وعذاب û ، فمد الله إليه يد مساعدته وأرشده إلى أن يضرب الأرض برجله فضربها فتفجرت أمامه عينا ماء فأمره الله أن من عين يغتسل ومن عين يشرب «أركض برجلك هذا مغتسل بارد وشراب û فذهب ما كان بجسده وذهب كل مرض كان بداخل جسمه ، وشفي ظاهره وباطنه ومتعه الله بصحته وماله وقواه حتى كثر نسله وذلك جزاء لصبره ، «ووهبنا له أهله ومثلهم معهم رحمة منا وذكرى لأولي الألباب .
وهبه الله أضعاف ثروته كرماً من عنده ، فلم يعد أيوب عليه السلام فقيراً ، عادت إليه صحته بعد طول المرض وشكر أيوب الله. وكان قد أقسم أن يضرب أمراته مائة ضربة بالعصا عندما يشفى ، وها هو قد شفى ، كان الله سبحانه وتعالى يعلم أنه لا يقصد ضرب امرأته ولكي لا يرجع في قسمه أو يكذب فيه ، أمره الله أن يجمع حزمه من أعواد الريحان عددها مائة ، ويضرب بها امرأته ضربة واحدة ، وبذلك يكون قد نفذ قسمه ولم يكذب. وجزى الله سيدنا أيوب عليه السلام علي صبره أن مدحه فى القرآن الكريم « إنا وجدناه صابرا نعم العبد إنه أواب .
  
    """ ;

/// ZoElKiflStory
const String zoElKiflStory =
"""
""";

/// mousaStory
const String mousaStory =
"""
""";

/// haroonStory
const String haroonStory =
"""
""";

/// dawoodStory
const String dawoodStory =
"""
""";

/// solimanStory
const String solimanStory =
"""
""";

/// eliasStory
const String eliasStory =
"""
""";

/// eliasaaStory
const String eliasaaStory =
"""
""";

/// yonosStory
const String yonosStory =
"""
""";

/// zakriaStory
const String zakriaStory =
"""
""";

/// yahiaStory
const String yahiaStory =
"""
""";

/// easaaStory
const String easaaStory =
"""
""";

/// mohammedStory
const String mohammedStory =
"""
""";









