// قصة حرية الذئب
const String foxStory =
"""
كان يا ما كان في احدى القرى البعيدة ، القريبة من الغابة كان هناك ذئب جائع لم يذق طعم اللحم منذ أيام ويشعر بالجوع الشديد ، أخذ يبحث في الغابة عن حيوان يأكله لكنه كان منهك فلم يستطع اصطياد أي حيوان ، فذهب للقرية لعله يجد بعض الطعام ليسد به جوعه ، وهناك وجد كلبا سمين جدا وكان سعيد جدا وكان يجلس ويحرس منزل صاحبة .
فكر الذئب بالانقضاض على الكلب والتهامه ولكن الكلب كان سمين جدا وضخم ، فخاف الذئب من الانقضاض ، اقترب منه وقال له صباح الخير ايها الكلب الوسيم ، فما اروعك كلب سمين وجميل ، لابد إنك تأكل كثير جدا .
فرد الكلب بفخر قائلا : صباح الخير أيها الذئب شكرا لك ، فهل تود الطعام  مثلي والأكل الكثير وتكون بصحة جيدة ، بدل ذلك الهزال والضعف في جسدك.
فقال الذئب بحماس كبير ، وكيف أكون مثلك أيها الكلب السمين قل لي ، رد الكلب بفخر ، لن تفعل شيء صعب فما عليك إلا أن تطارد اللصوص والمتسللين إلى منزل سيدك ، وان ترضي سيدك وتتبعه باستمرار يا صديقي ، وسيقدم لك كل فضلات الطعام واللحوم وبعض المرح ولن يمنع عنك شيء .
اخذ الذئب يتخيل السعادة التي سيكون فيها  ، بالكثير من الطعام والشراب واللعب والرحة ولا احد يزعجة ياكل الكثير والكثير من بواقي الطعام لصاحبه.
ثم شاهد الذئب عنق الكلب وكان خالى من الشعر تماما ، فقال له ، ما هذا ايها الكلب في رقبتك لما هي خالية من الشعر ، فقال الكلب ، انها شيء ليس مهم ابدا فهي  مكان الرباط الذي يقيدني به سيدي كما ترى امام المنزل.
قال الذئب هذا يعني بانك لن تجري وقتما شئت فرد الكلب لا ،ولكن لا يهم اجري عندما يريد سيدي الجري ايها الذئب الهزيل ، وهنا عاد الذئب للخلف بسرعة وركض مسرعا وهو يقول : لا ان الحرية شيء مهم جدا ايها الكلب السمين ولن استبدل حريتي من اجل بواقي الطعام فالجوع افضل بكثير من الشبع مع عدم الحرية والقيد ، وبعدها ركض الذئب بعيدا عن الكلب عائدا للغابة ليبحث عن أي طعام يسد به جوعه .
""";

// قصة القرد والسلحفاة
const String monkeyAndTurtleStory =
"""
كان يا ما كان كان هناك قردا جميل يعيش في مملكة القرود ويتولى الحكم ، ولكن جاء قرد شاب وطرد القرد من الحكم وأخذ مكانه وبعدها طرده من بيت القرود للابد ، وذهب القرد العجوز ليعيش على ضفة نهر فوق أحد الاشجار ، واثناء اكله التين  سقطت تينه  كبيرة من يده ، فاعجبه صوت ارتطامها وسقوطها بالماء ، وأخذ يلقى بالمزيد من التين وهو يضحك مستمتعا بالصوت في الماء ، وكان في ذلك الوقت سلحفاة في الماء ، فلما وجدت التين اخذته واكلته باستمتاع و اعتقدت السلحفاة ، ان القرد يفعل ذلك من اجلها ويلقي لها التين ففرحت بشدة  .
فرعبت السلحفاة في مصاحبة القرد ، فخرجت اليه وصادقته في مودة وحب ، ولم تعد السلحفاة الى منزلها ، فقلق عليها الزوج واطفالها ، وعندما تذكرت اطفالها قررت العودة ، اشتكى الزوج زوجته لاحد اصدقائه فقال له اطلب منها قلب قرد وقل بان احد اطفالها مريض ،  عادت السلحفاة للمنزل فوجدت الزوج حزينا وأحد اطفالها مريض ، قال الزوج بان احد الاطفال مريض ويحتاج الى قلب قرد حتى يشفى ،هكذا قال الطبيب المعالج ذلك ، وهنا فكرت السلحفاة فيما يقوله الزوج .
وكيف تحضر قلب قرد من اجل طفلها ، فكرت هل اغدر بصديقي القرد واقتله لاحصل على قلبه ، من اجل طفلي الوحيد وزوجي ، ولكنها فكرت بانها تعاهدت على الوفاء ، فقالت السلحفاة لنفسها ، هذا محال لن افعل ، ولكن ماذا عن طفلي الوحيد سيموت ، فقررت ان تقتل القرد وتاخذ قلبه .
تركت زوجها وطفلها المريض ، فذهبت للقرد فوق الشجرة وقالت له ، كيف حالك يا صديقي انا ادعوك لزيارة منزلي في جزيرة الفاكهة وسوف تعجبك كثيرا ، رد القرد وفرح وذهب فوق ظهر السلحفاة في الماء ، ولما شاهدها مهمومة وحزينة جدا سالها القرد ، ا بك يا صديقتي لماذا انت حزينة ، قالت السلحفاة انا حزينة لان ابني مريض بشدة وسيموت ، ان لم اعالجه .
قال القرد وما علاجه ، قالت السلحفاة قال الطبيب ان دوائه قلب قرد ، وانا اخجل منك يا صديقي ، وهنا فهم القرد الحيلة ، وبان السلحفاة سوف تقتله من اجل قلبه، فقال لها : وهو يفكر في حيلة ينجو منها ، ولما لم تخبريني يا صديقتي السلحفاة ، قبل ان اغادر منزلي وشجرتي ، الا تعلم باننا معشر القرده اذا سافرنا نترك قلوبنا عند اهلنا او في مساكننا ، قالت السلحفاة : وأين قلبك الان ايها القرد ، قال القرد ، ان قلبي فوق الشجرة يا صديقتي ، قالت السلحفاة بفرح وهي تصدق القرد ، هيا بنا نذهب اذا لنعود به ، عاد الاثنان معا ، الى الشجرة  وصعد القرد متسلقا ، فصاحت السلحفاة بصوت عالي : هيا يا صديقي احضر قلبك وانزل يا صديقي ، وهنا ضحك القرد بقوة وهو يقول : هيهات يا صديقتي ، لقد خدعتني وكنت تريد قتلي  وخنت صداقتي ، فخدعتك انا الاخر ، ولن نعود الى ما كنا عليه من قبل ابدا.
""";

// حدوتة لم كان للأرنب أذان طويلة
const String rabbiteStory =
"""
حكى في قديم الزمان عن عائلة صغيرة من الأرانب تعيش في جحر جميل، ولها من الأطفال اثنان: أرنب وأرنوبة.. وذات يوم قالت الأم لولديها: إني ذاهبة لآتيكما بجزرة كبيرة من الحقل الذي بقربنا.. وصيتي لكما ألا تغادرا المنزل لأنكما صغيران.. والعالم الذي حولنا كبير.
وما أن ابتعدت الأم..حتى أسرعا إلى الباب ينظران من ثقبه.. قال أرنب لأخته أرنوب: إن أمنا على حق فالعالم كبير، ونحن مازلنا صغيرين.
ردت أرنوبة: هذا صحيح.. ولكن نحن مثل أمنا، لنا من الأرجل أريعة، وذيل مثل ذيلها.. هيا لنخرج لنرى قليلاً من هذا العالم، فوافقها أرنب..وخرجا.. ثم أخذا يعدوان في الحقل الواسع يمرحان ويقفزان في كل مكان بين الخضرة والفواكه، وفجأة وقع بصرهما على قفص من الفواكه ذات الرائحة الشهية.. اقتربا منه. قالت أرنوبة إنه جزر.. تعال يا أرنب أسرع.. إنها فرصة لا تعوض .
وما إن قفزالاثنان على القفص، حتى وقع وتناثر ما بداخله. أراد الهروب بسرعة لكنهما فوجئا بفتاة جميلة أمامها.. قبضت عليهما..ورفعتهما من آذنيهما إلى أعلى وهى تهزهما بقوة: لقد أضعتما جهد يوم كامل من العمل المضني..
وألقت بهما في حديقة المنزل وهى تقول: ابقيا هنا.. وتذكرا أنكما خرجتما إلى العالم مبكرين.
هذا ما قالته الفتاة.
ونظر الاثنان أحدهما إلى الأخر، وقد أطالت آذنيهما. ولأول مرة في حياتهم سمعا همساً خفيفاً حولهما، ثم سمعا باب الحديقة يفتح عندئذ.. وفي لمح البصر كانا خارج الحديقة يقفزان بقوة في طريقهما إلى البيت..
وهنا أدركا أن أذنيهما قد أصبحت طويلة وصارا يقفزان لأفل حركة
""";

// الكتكوت المغرور
const String katkotStory =
"""
صَوْصَوْ كتكوت شقي، رغم صغر سنه يعاكس إخوته، ولا يطيق البقاء في المنزل، وأمه تحذره من الخروج وحده، حتى لا تؤذيه الحيوانات والطيور الكبيرة.
غافل صَوْصَوْ أمّه وخرج من المنزل وحده، وقال في نفسه : صحيح أنا صغير وضعيف، ولكني سأثبت لأمي أني شجاع وجرئ.
قابل الكتكوت في طريقه الوزّة الكبيرة، فوقف أمامها ثابتاً، فمدّت رقبتها وقالت : كاك كاك.
قال لها: أنا لا أخافك .. وسار في طريقه وقابل صَوْصَوْ بعد ذلك الكلب، ووقف أمامه ثابتاً كذلك .. فمدّ الكلب رأسه، ونبح بصوت عال: هو .. هو ..، التفت إليه الكتكوت وقال: أنا لا أخافك.
ثم سار صَوْصَوْ حتى قابل الحمار …. وقال له: صحيح أنك أكبر من الكلب، ولكني .. كما ترى لا أخافك! فنهق الحمار: هاء.. هاء ..! وترك الكتكوت وانصرف.
ثم قابل بعد ذلك الجمل، فناداه بأعلى صوته وقال: أنت أيها الجمل أكبر من الوزة والكلب والحمار، ولكني لا أخافك.
سار كتكوت مسروراً، فرحان بجرأته وشجاعته، فكل الطيور والحيوانات التي قابلها، انصرفت عنه ولم تؤذه، فلعلها خافت جُرْأته.
ومرّ على بيت النحل، فدخله ثابتاً مطمئناً، وفجأة سمع طنيناً مزعجاً، وهجمت عليه نحلة صغيرة، ولسعته بإبرتها في رأسه، فجرى مسرعاً وهي تلاحقه، حتى دخل المنزل، وأغلق الباب على نفسه.
قالت أم صَوْصَوْ له : لا بد أن الحيوانات الكبيرة قد أفزعتك . فقال وهو يلهث : لقد تحديت كل الكبار، ولكن هذه النحلة الصغيرة عرفتني قدر نفسي.
""";

// حارس المرمى
const String goalKeeperStory =
"""
سعد فتى كسول، خامل، أصدقاؤه يعملون ويجتهدون وهو نائم، وجميع أصدقائه يتمنون الوصول لكأس العالم، ولكنه غير مهتم بما يقولونه، وغافل عما يفعلونه.
ولكن عندما جاءت مباراتهم مع نادٍ آخر، تدرب الجميع عدا سعد فقد كان نائماً، يحلم أن يفوز، ولكن من دون أن يبذل ولا حتى ذرة مجهود، اقتربت المباراة، واقتربت، لكن سعد لم يواظب على التدريب كحارس مرمى.
وجاءت المباراة ولم يتدرب سعد على عمله، لأنه في المباراة كان يستند على الحائط وينام ويحلم بفوز فريقه.
ثم يأتي صديقه بدر ويقول له: هيي.. سعد استيقظ ألا ترى أننا في مباراة؟! فيستيقظ ثم يعود للنوم، ويأتي صديقه راشد ويقول له: أوووف.. ما زلت نائماً؟ يا ربي… متى ستستيقظ.
ويستيقظ ثم يعود للنوم واستمر الحال هكذا فترة من المباراة إلى أن أصبح الفريق المنافس ثمانية وهم صفر .. حتى إن المدرب غضب من تصرفات سعد الطائشة فأخرجه، وأدخل بدلاً منه اللاعب حسن، لأنه نشيط ومفعم بالحيوية كالمعتاد.
فتعدلت النتيجة، وأصبحت ثمانية مقابل ستة.. إلى أن أصبح فريق سعد تسعة والفريق الآخر ثمانية واستمر الحال إلى أن انتهت المباراة، وعندها كافأ المدرب اللاعب حسن على أدائه الرائع كحارس للمرمى، وطبعاً كافأ بقية اللاعبين على مجهودهم ومنهم راشد وبدر ومحمد وغيرهم.
واستمرت عدة مباريات على هذه الحالة ويتبدل سعد بلاعب آخر ولكن المدرب اضطجر من تصرفات سعد التي لا يحسد عليها.
فطرده من الفريق أجمع، وحزن سعد على تلك الأعمال التي كان يقوم بها أمام الجمهور، فمؤكد أن نصف الجمهور كان يضحك على تصرفاته، لا ولماذا نصف الجمهور فقط؟ بل الجمهور كله يضحك عليه، فهو يسمع دائماً في الأخبار فوز فريق النمور فهو فريقه، ولكنه أراد أن يشعر بذلك الفخر والاعتزاز أمام الجميع، الذي يشعر به أصدقاؤه الآن، ولكنه الآن تغيّر بعدما طرده المدرب، فقد أصبح نشيطاً على غير العادة، رشيق الحركة عكس طبعه، فقد بدأ التدريب وبعزيمة ونشاط، فقد ظل ساهراً طوال الليل يتدرب على مباراة فريقه القادمة.. فذهب عند المدرب وطلب منه إرجاعه لمكانه، فقبل المدرب ولكن .. شرط عليه أن لا يعود مرة ثانية وينام على حواف المرمى، وفعلاً تغيّر سعد كثيراً وأصبح نجم.
""";

// قصة سعاد والتلفاز للاطفال قبل النوم
const String kidsStory =
"""
سعاد بنت ذكية، ومجدة في دروسها،تحبها معلمتها كثيراً، وتفتخر بها أمام زميلاتها، المسألة الواحدة في الرياضيات، لا تستغرق معها إلا وقتاً قصيراً، تسبق زميلاتها في حلها، فتبتسم لها معلمتها مشجعة وتربت على كتفها قائلة لزميلاتها:
– أتمنى أن تقتدين بزميلتكن سعاد، وتنافسنها في الدروس والتحصيل، فأنتن لستن أقل منها ذكاء وفطنة، ولكنها نشيطة مجدة في الدراسة، وأنتن تتراخين في تأدية الواجبات التي عليكن.
رن جرس المدرسة، لتقضي الطالبات فرصة قصيرة، يسترحن فيها، ويلعبن، ويتبادلن الآراء والأفكار فيما بينهن.
تحلقت الطالبات حول سعاد، هذه تسألها في مسألة صعبة، وتلك تسألها كيف توفق بين اللعب والدراسة.. وعن بُعد وقفت هندُ ترمق سعاد بحسد وغيرة، تقضم أظافرها من الغيظ، وهي تفكر بطريقة تبعد سعاد عن الجد والاجتهاد، فتنفر صديقاتها منها، وتبتعد عنها معلمتها فيخلوا لها الجو، لتحتل مكانة سعاد…
اقتربت هند من سعاد وسألتها:
ما رأيك في الفيلم الكرتوني الذي عرض في التلفاز البارحة ؟
أجابت سعاد في تساؤل :
أيَّ فيلم هذا ؟ أنا لا أتابع مثل هذه الأفلام حتى لا أضيع وقتي.
ضحكت هند وقالت:
– ماذا .. ماذا تقولين، لا تتابعين برامج التلفاز ما هذا الجهل ؟! ألا تدرين أن في هذه البرامج متعة كبيرة و…
قاطعتها سعاد:
– متعة كبيرة وفائدة قليلة..
ردت هند ضاحكة:
– لابد أنّ أمك تمنعك من مشاهدة التلفاز، لكي تساعديها في بعض أعمال التنظيف، وتحرمك من متعة التلفاز، كم أشفق عليك يا صديقتي..
انزعجت سعاد من كلام صديقتها، وفضلت تركها والذهاب إلى مكان آخر.. ولكن هنداً أخذت تطاردها من مكان إلى مكان آخر، وتزين لها التلفاز وتسليته الجميلة، وتقلل لها من أهمية الواجبات المتعبة التي تتفنن المعلمة في زيادتها وصعوبتها…
بدأت سعاد تميل إلى هند وإلى أفكارها ومناقشاتها…
ورويداً رويداً أخذت تقتنع بكلامها المعسول، ونصائحها الخاطئة، فأهملت بعض واجباتها المدرسية والمنزلية، وتابعت الفيلم الأول في التلفاز، ثم الفيلم الثاني وهكذا، حتى كادت لا تفارق التلفاز إلا قليلاً.. لاحظت أمها هذا التقصير والإهمال، فنصحتها فلم تأبه لنصح أمها، فاضطرت الأم إلى تأنيبها ومعاقبتها فلم تفلح، وأما معلمة سعاد فقد تألمت كثيراً لتراجع سعاد في دراستها، وحاولت نصحها ولكن بلا فائدة .. حينئذ قررت المعلمة مقاطعتها في الصف، وكذلك قاطعتها أمها في البيت وأهملتها..
شعرت سعاد بالخجل الشديد والحرج أمام زميلاتها في الصف، وإخوتها في البيت، فأدركت خطأها الكبير وقررت الابتعاد عن هند ووسوستها، فنالت رضى أمها ومعلمتها وحبهما.
""";
// قصة السلحفاة التي فقدت درعه
const String turtleStory =
"""
كانت هناك سلحفاة تأكل ورقة خس مرمية في أحد الحقول،وفجأة سمعت صوتاً مزمجراً:
أخيراً.. عرفت من أتلف لي حقلي..!
نظرت السلحفاة إلى أعلى، فرأت رجلاً عابس الوجه، فقالت:
أرجوك يا سيدي، سامحني، لقد كنت جائعة جداً.
جائعة.. هه.. أنت سارقة، حتى وإن أكلت مجرد ورقة خس صغيرة.
يا لك من رجل بخيل..
دمدمت السلحفاة يانسة.. وهنا غضب الرجل لسماع هذه الكلمات حسناً إذن.. سأجعلك تدفعين ثمن كلماتك هذه .. سأنزع عنك هذا الترس الذي يغطي ظهرك..
وقبل أن تتمكن السلحفاة من فتح فمها انتزع الرجل درعها بقسوة وهو يضحك فيما كانت السلحفاة تبكي، لتمضي بعدها زاحفة وهي ترتجف من البرد، والخوف، صوب الغابة القريبة، حيث أخذت تنتحب بصوت مرتجف، أيقظ الغراب والقنفذ اللذان كانا يهجعان قريباً منها..
لماذا تبكين أيتها السلحفاة؟
سألها القنفذ.. مسحت السلحفاة دموعها بيدها، وأخذت تقص عليهما حكايتها مع الرجل القاسي الذي انتزع درعها.. وحين انتهت من سرد حكايتها قال لها الغراب:
لا بأس.. سأذهب حالاً إلى حقل الخس.. وأجلب لك درعك.
أما القنفذ فقد قال لها:
أما أنا فسوف أخيط لك الدرع ثانية، بواحدة من إبري القوية هذه.
وبعد قليل عاد للسلحفاة درعها الجميل، وعادت أنيقة مرة أخرى.
""";
