// خديجة بنت خويلد
const String khadigaStory =
"""
كانت السيدة خديجة بنت خويلد رضي الله عنها وأرضاها في أيام الجاهلية وقبل لقاءها برسول الله صلى الله عليه وسلم  كانت – امرأة ذات نفوذ وتمتلك مالها وتجارتها الرابحة الخاصة بها، فكانت تستأجر من الرجال أكثرهم أمانة وترسلهم فى قوافل تجارتها إلى بلاد الشام.
وذات يوم ووصل إلى مسامعها ذكر أخلاق وأمانة “محمد بن عبد الله”، والذى لقبه قومه بالصادق الأمين، وقد كان نادرا فى مثل تلك الفترة فى الجاهلية أن تجد رجلا تجتمع فيه مثل تلك الصفات.
فأرسلت السيدة خديجة بنت خويلد رضي الله عنها إلي نبينا محمد صلى الله عليه وسلم، وعرضت عليه أن يقود قوافلها التجارية إلى بلاد الشام، مقابل أن تعطيه أكثر حتى مما كانت تعطي من مثله من التجار.
قبل سيدنا محمد صلى الله عليه وسلم عرض السيدة خديجة بنت خويلد رضي الله عنها، وخرج في قافلتها ومع مالها يرافقه خادمها “ميسرة” حتى وصل القافلة إلى بلاد الشام، وهناك جلس رسول الله عليه الصلاة والسلام يستظل بشجرة قريبة من صومعة أحد الرهبان، فجاء الراهب إلى ميسرة وسأله: من هذا الرجل الذي نزل تحت هذه الشجرة؟
قال ميسرةللراهب: هذا أحد رجال قريش من أهل الحرم.
فقال الراهب لميسرة: هذه الشجرة لم يجلس تحتها أبدا إلا الأنبياء.
أكمل محمدا صلى الله عليه وسلم رحلته وباع سلعته التي خرج بها فى القافلة واشترى ما ذهب لشراءه، وحين وصل عليه الصلاة والسلام إلى مكة، ذهب ليعطى السيدة خديجة مالها وبضائعها، فباعت السيدة خديجة بنت خويلد تلك البضاعة بأضعاف أرباحها المعتادة عن ذى قبل.
وكان غلامها ميسرة قد حكى لها ماكان فى رحلته مع محمد صلى الله عليه وسلم من كرم أخلاق وصفات حميدة وأمانة، فرغبت أم المؤمنين خديجة بنت خويلد رضي الله عنها في الزواج منه، وبالفعل تزوجها سيدنا محمد صلى الله عليه وسلم وهو فى عمر الخامسة والعشرين، وكانت السيدة خديجة حينها فى عمر الأربعين عاما.
وقد كانت السيدة خديجة بنت خويلد رضي الله عنها قد سبق لها الزواج مرتين قبل زواجها برسول الله صلى الله عليه وسلم وقد توفى الله زوجاها.
فترة زواج النبى صلى الله عليه وسلم بأمنا السيدة خديجة بنت خويلد رضي الله عنها
تزوج النبي محمد صلى الله عليه وسلم السيدة خديجة بنت خويلد رضي الله عنها وأرضاها قبل ان يتنزل إليه الوحى.
واستمر زواجهما خمسة وعشرون عاما، الى ان توفاها الله عن عمر يناهز الخامسة والستين وكان النبي محمد صلى الله عليه وسلم فى الخمسون من العمر.
وتعد فترة زواجه مع السيدة خديجة رضي الله عنها هى الأطول بين زوجاته صلى الله عليه وسلم.
وكانت رضي الله عنها ورغم فارق السن بينها وبين النبي صلى الله عليه وسلم، إلا أنها كانت الأقرب إليه، حتى أنه لم يتزوج غيرها طوال حياتها.
وقد أنجب منها القاسم وعبدالله وزينب ورقية وأم كلثوم.
إسلام السيدة خديجة بنت خويلد رضي الله عنها
كانت السيدة خديجة بنت خويلد رضي الله عنها- قد حباها الله بصفاء الروح، ونقاء السريرة، والاستعداد لتقبُّل الحق، فحين تنزل الوحى على رسول الله صلى الله عليه وسلم في غار حراء وقال له جبريل {اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ} [العلق: 1]، رجع النبي صلى الله عليه وسلم إلى السيدة خديجة مرتجفا فقال: “زملوني زملوني“. فزملوه حتى هدأ وذهب عنه الروع.
فقال لخديجة رضي الله عنها: “أَيْ خديجة، ما لي لقد خشيت على نفسي“. وأخبرها بما حدث، فما كان منها رضي الله عنها وأرضاها إلا أن قالت: “كلا أبشر، فوالله لا يخزيك الله أبدًا، فوالله إنك لتصل الرحم، وتصدق الحديث، وتحمل الكلَّ، وتكسب المعدوم، وتقري الضيف، وتعين على نوائب الحق”.
ثم انطلقت السيدة خديجة بنت خويلد رضي الله عنها يرافقها النبي صلى الله عليه وسلم الى ابن عمها ورقة بن نوفل، وقد كان نصرانيا مؤمنا بكتاب الله وقد كان شيخا كبيرا، فحكوا لورقة بن نوفل مارأى الرسول صلى الله عليه وسلم، فأخبره ورقة أن هذا هو الناموس اى الوحى الذي أُنزل على موسى عليه السلام من قبل.
فكانت السيدة خديجة بنت خويلد رضي الله عنها هى أول من آمن بالنبى صلى الله عليه وسلم.
مساندة السيدة خديجة بنت خويلد رضي الله عنها لرسول الله بعد نزول الوحي
وهبت السيدة خديجة بنت خويلد رضي الله عنها نفسها ومالها وكلّ ما تملك لله ولرسوله صلى الله عليه وسلم، فآمنت به وآزرته ونصرته في أصعب الظروف.
-ورضت ان تنتقل مع رسول الله صلى الله عليه وسلم من حياة الغنى والاستقرار إلى حياة الكفاح والجهاد، بل ان كل تلك المحن لم تزدها إلا حبًّا لمحمد  وحبا وتفانيا للاسلام.
وعند خروج رسول الله صلى الله عليه وسلم مع بني هاشم وبني عبد المطلب إلى شعاب مكة في عام المقاطعة، خرجت معه السيدة خديجة بنت خويلد رضي الله عنها رغم كبر سنها وتحملت كشاق وأعباءو عظيمة من أمر الرسالة الإلهية التي يحملها النبى صلى الله عليه وسلم، وأقامت السيدة خديجة في شعاب مكة مع النبي صلى الله عليه وسلم لمدة ثلاث سنوات وهي صابرة محتسبة.
وكأن الله قد اختارها بقوة شخصيتها وعزيمتها تلك لتكون سندًا وعونًا للرسول عليه الصلاة والسلام فى أصعب أوقات الرسالة. ولتحمل معه وتآنس وح، وتشاركه بنفسها واموالها فداء للاسلام.
فضائل السيدة خديجة بنت خويلد رضي الله عنها وأرضاها
خديجة بنت خويلد هى خير نساء الجنة
لا شك أن امرأة بمثل تلك الصفات الفريدة والشريفة فى مثل تلك الحقبة المظلمة والفاسدة من ايام الجاهلية السوداء،  فلابد أن تكون لها منزلة شديدة الرفعة.
فكان الرسول صلى الله عليه وسلم مايلبث ان يعلن فى العديد من المناسبات المختلفة عن علو منزلتها و انها خير نساء الجنة.
فقد روي عن أنس بن مالك رضي الله عنه أن النبي صلى الله عليه وسلم قال: “حسبك من نساء العالمين: مريم بنت عمران، وخديجة بنت خويلد، وفاطمة بنت محمد، وآسية امرأة فرعون“.
السيدة خديجة بنت خويلد رضي الله عنها يقرئها ربها السلام
عن أبي هريرة رضي الله عنه أنه قال: أتى جبريلٌ النبيَّ صلى الله عليه وسلم فقال: “يَا رَسُولَ اللَّهِ، هَذِهِ خَدِيجَةُ قَدْ أَتَتْ مَعَهَا إِنَاءٌ فِيهِ إِدَامٌ أَوْ طَعَامٌ أَوْ شَرَابٌ، فَإِذَا هِيَ أَتَتْكَ فَاقْرَأْ عَلَيْهَا السَّلاَمَ مِنْ رَبِّهَا وَمِنِّي، وَبَشِّرْهَا بِبَيْتٍ فِي الْجَنَّةِ مِنْ قَصَبٍ، لاَ صَخَبَ فِيهِ وَلاَ نَصَبَ“.
حب النبي للسيدة خديجة ووفائه لها
قد كان للسيدة خديجة بنت خويلد رضي الله عنها وأرضاها من عظيم الصفات ماخول لها أن تنال لمثل تلك المكانة العظيمة فى قلب رسول الله صلى الله عليه وسلم.
فكانت علاقته صلى الله عليه وسلم بالسيدة خديجة علاقة سامية طاهرة قائمة على الحب والاحترام والوفاء والإخلاص، بل ويعلنها النبى صلى الله عليه وسلم على الملأ وبعد وفاتها؛ قائلا: “إني قد رزقت حبها“.
حتى وبعد وفاتها رضي الله عنها  ينسها ابدا صلى الله عليه و،  فكان يكثر ذكرها بالخير دائما ويتصدق عليها.
تروي السيدة عائشة -رضي الله عنها- فتقول: ما غِرْتُ على أحد من نساء النبي صلى الله عليه وسلم ما غرت على خديجة رضي الله عنها، وما رأيتها، ولكن كان النبي صلى الله عليه وسلم يكثر ذكرها، وربما ذبح الشاة ثم يقطعها أعضاء، ثم يبعثها في صدائق خديجة رضي الله عنها، فربما قلت له: كأنه لم يكن في الدنيا امرأة إلا خديجة. فيقول: “إنها كانت وكانت، وكان لي منها ولد“.
وفاة السيدة خديجة بنت خويلد رضي الله عنها
قبل الهجرة النبوية الشريفة إلى المدينة كانت روح السيدة خديجة -رضي الله عنها- قد تاقت إلى بارئها، وقد كانت فى الخامسة والستين من العمر، وقام النبي صلى الله عليه وسلم بدفنها بيديه الكريمتين.
ويشاء الله أن يكون وقت وفاتها هو نفس العام الذي تُوفِّي فيه أبو طالب عم النبى صلى الله عليه وسلم وهو الشخص الوحيد الذي كان يدفع عنه شر كفار قريش ويحميه ويسانده مثلما كانت السيدة خديجة بنت خويلد رضي الله عنها تفعل.
حزن الرسول صلى الله عليه وسلم ذلك العام حزنًا شديدًا حتى سُمي “عام الحزن”، وقد خُشي عليه صلى الله عليه وسلم من شدة حزنه حينها، ومكث فترة بعدها بدون زواج.
""";

// علي بن أبي طالب
const String aliStory =
"""
التعريف بعلي بن أبي طالب رضي الله عنه
هو عليُّ بن أبي طالب بن عبد المطلب بن هاشم بن عبد مناف بن قُصي، ابن عمِّ النبيِّ صلى الله عليه وسلم: يُكنى بأبي تراب، وهو أبو الحسن الهاشمي، وأمُّه فاطمة بنت أسد بن هاشم بن عبد مناف[1].
وُلد عليٌّ رضي الله عنه في مكَّة قبل البعثة بعشر سنين ونشأ في حجر النبيِّ صلى الله عليه وسلم؛ وذلك أنَّ أبا طالب كان كثير العيال، فلمَّا أصاب مكَّة جدب، طلب النبيُّ صلى الله عليه وسلم من عمِّه العباس رضي الله عنه أن يُخفِّف عن أبي طالب مشقَّة العيش بأن يعول بعض ولده، فذهبا إليه وعرضا عليه المساعدة فقَبِل، فضمَّ العباس رضي الله عنه إليه جعفرًا وضمَّ النبيُّ صلى الله عليه وسلم عليًّا رضي الله عنه[2]. ولمـَّا بُعث النبيُّ صلى الله عليه وسلم كان عليٌّ رضي الله عنه أوَّل من آمن به من الصبيان، وهو ابن عشر سنين[3]، وتجري روايات المصادر أنَّ النبيَّ صلى الله عليه وسلم عندما دعا قريشًا إلى دينه الجديد، أحجموا عن الاستجابة، وقرَّروا عدم مناصرته، فصاح عليٌّ رضي الله عنه في حماسة الصبيِّ قائلًا: "أنا يا نبيَّ الله أكون وزيرك عليه"[4].
عُرف عليٌّ رضي الله عنه بالشجاعة والبطولة، وليس أدلَّ على ذلك من تعرُّضه للخطر في الليلة التي هاجر فيها النبيُّ صلى الله عليه وسلم؛ إذ لبس ثوبه وبات في فراشه، مع أنَّه كان يعلم عزم المشركين على قتله فى تلك الليلة، ثُمَّ لحق به إلى المدينة بعد أن أدَّى الودائع التي كانت عند النبيِّ صلى الله عليه وسلم لأصحابها[5].
قد زوَّجه النبيُّ صلى الله عليه وسلم من ابنته فاطمة رضي الله عنها في السنة الثانية للهجرة، فولدت له الحسن والحسين ومحسنًا -وقد مات صغيرًا- وزينب وأم كلثوم رضي الله عنهم، ثُمَّ تزوج أمَّ البنين بنت حزام رضي الله عنها -بعد وفاة فاطمة رضي الله عنها- فأنجبت له العباس وجعفرًا وعبد الله وعثمان، وقد قُتلوا مع الحسين بكربلاء ولا بقيَّة لهم غير العبَّاس، وتزوَّج ليلى ابنة مسعود بن خالد النهشلي رضي الله عنها، فولدت له عبيد الله وأبا بكر، وقد قُتلا كذلك فى كربلاء. وتزوَّج أسماء ابنة عميسٍ الخثعمية رضي الله عنها فولدت له يحيى ومحمَّدًا الأصغر[6]، وعلى عادة العرب فقد كانت له عدَّة زوجاتٍ كما كان له تسع عشرة سرية، وقد بلغ عدد أولاده الذكور أربعة عشر ولدًا، والإناث سبع عشرة، وقد تُوفِّيت بعض زوجاته في حياته وطلَّق بعضهن، وتُوفِّي وفي بيته أربع منهن[7].
اشترك عليٌّ في جميع الغزوات باستثناء تبوك؛ لأنَّ النبيَّ صلى الله عليه وسلم خلَّفه على المدينة، وقد روى كثيرًا عن النبيِّ صلى الله عليه وسلم، كما روى عنه عددٌ من الصحابة مثل: عبد الله بن مسعود وعبد الله بن عباس رضي الله عنهما، بالإضافة إلى ابنيه الحسن والحسين رضي الله عنهما.
اشتهر عليٌّ رضي الله عنه بشجاعته في الحروب، وموقفه يوم خيبر معروف، ودفع إليه النبيُّ صلى الله عليه وسلم براية القيادة وهو ابن عشرين سنة، وكانت شجاعته تُصيب أعداءه بالهلع والارتباك، ولكنَّه كان يفتقد إلى حزم الحاكم ودهائه، وتنقصه الحنكة السياسية وعدم التردُّد في اختيار الوسائل لتثبيت مركزه، وقد سمح هذا لمنافسيه بالتغلُّب عليه.
لمـَّا تُوفِّي النبيُّ صلى الله عليه وسلم انهمك عليٌّ رضي الله عنه في تجهيزه ودفنه، وكان يرى أنَّه أحقُّ المسلمين بالخلافة بعد النبيِّ صلى الله عليه وسلم؛ لِما له من السابقة في الإسلام ولأنَّه أقرب الناس إلى النبيِّ صلى الله عليه وسلم نَسبًا وصهرًا، فلمَّا آلت الخلافة إلى أبي بكرٍ رضي الله عنه بايعه بغضِّ النظر عن المدَّة التي بقي فيها بدون بيعة.
كان عليٌّ رضي الله عنه موضع ثقة أبي بكر الصديق رضي الله عنه، يستشيره في الأمور المهمَّة، وكذلك كان في أيام عمر رضي الله عنه الذي لم يكن يقدم على عملٍ إلا بعد استشارته، وكان أحد أعضاء مجلس الشورى الستَّة الذين اختارهم عمر بن الخطاب رضي الله عنه لانتخاب أحدهم لخلافته.
""";

// أبو بكر الصديق
const String aboBakrStory =
"""
اسمه – على الصحيح - :
عبد الله بن عثمان بن عامر بن عمرو بن كعب بن سعد بن تيم بن مرة بن كعب بن لؤي القرشي التيمي .
كنيته :
أبو بكر
لقبه :
عتيق ، والصدِّيق .
قيل لُقّب بـ " عتيق " لأنه :
= كان جميلاً
= لعتاقة وجهه
= قديم في الخير
= وقيل : كانت أم أبي بكر لا يعيش لها ولد ، فلما ولدته استقبلت به البيت ، فقالت : اللهم إن هذا عتيقك من الموت ، فهبه لي .
وقيل غير ذلك
ولُقّب بـ " الصدّيق " لأنه صدّق النبي صلى الله عليه وسلم ، وبالغ في تصديقه كما في صبيحة الإسراء وقد قيل له : إن صاحبك يزعم أنه أُسري به ، فقال : إن كان قال فقد صدق !
وقد سماه الله صديقا فقال سبحانه : ( وَالَّذِي جَاء بِالصِّدْقِ وَصَدَّقَ بِهِ أُوْلَئِكَ هُمُ الْمُتَّقُونَ )
جاء في تفسيرها : الذي جاء بالصدق هو النبي صلى الله عليه وسلم ، والذي صدّق به هو أبو بكر رضي الله عنه .
ولُقّب بـ " الصدِّيق " لأنه أول من صدّق وآمن بالنبي صلى الله عليه وسلم من الرجال .
وسماه النبي صلى الله عليه وسلم " الصدّيق "
روى البخاري عن أنس بن مالك رضي الله عنه أن النبي صلى الله عليه وسلم صعد أُحداً وأبو بكر وعمر وعثمان ، فرجف بهم فقال : اثبت أُحد ، فإنما عليك نبي وصديق وشهيدان .
وكان أبو بكر رضي الله عنه يُسمى " الأوّاه " لرأفته
مولده :
ولد بعد عام الفيل بسنتين وستة أشهر
صفته :
كان أبو بكر رضي الله عنه أبيض نحيفاً ، خفيف العارضين ، معروق الوجه ، ناتئ الجبهة ، وكان يخضب بالحناء والكَتَم .
وكان رجلاً اسيفاً أي رقيق القلب رحيماً .
فضائله :
ما حاز الفضائل رجل كما حازها أبو بكر رضي الله عنه
• فهو أفضل هذه الأمة بعد نبيها صلى الله عليه وسلم
قال ابن عمر رضي الله عنهما : كنا نخيّر بين الناس في زمن النبي صلى الله عليه وسلم ، فنخيّر أبا بكر ، ثم عمر بن الخطاب ، ثم عثمان بن عفان رضي الله عنهم . رواه البخاري .
وروى البخاري عن أبي الدرداء رضي الله عنه قال : كنت جالسا عند النبي صلى الله عليه وسلم إذ أقبل أبو بكر آخذا بطرف ثوبه حتى أبدى عن ركبته فقال النبي صلى الله عليه وسلم : أما صاحبكم فقد غامر . وقال : إني كان بيني وبين ابن الخطاب شيء ، فأسرعت إليه ثم ندمت فسألته أن يغفر لي فأبى عليّ ، فأقبلت إليك فقال : يغفر الله لك يا أبا بكر - ثلاثا - ثم إن عمر ندم فأتى منزل أبي بكر فسأل : أثَـمّ أبو بكر ؟ فقالوا : لا ، فأتى إلى النبي فجعل وجه النبي صلى الله عليه وسلم يتمعّر ، حتى أشفق أبو بكر فجثا على ركبتيه فقال : يا رسول الله والله أنا كنت أظلم - مرتين - فقال النبي صلى الله عليه وسلم : إن الله بعثني إليكم فقلتم : كذبت ، وقال أبو بكر : صَدَق ، وواساني بنفسه وماله ، فهل أنتم تاركو لي صاحبي – مرتين - فما أوذي بعدها .
فقد سبق إلى الإيمان ، وصحب النبي صلى الله عليه وسلم وصدّقه ، واستمر معه في مكة طول إقامته رغم ما تعرّض له من الأذى ، ورافقه في الهجرة .
• وهو ثاني اثنين في الغار مع نبي الله صلى الله عليه وسلم
قال سبحانه وتعالى : ( ثَانِيَ اثْنَيْنِ إِذْ هُمَا فِي الْغَارِ إِذْ يَقُولُ لِصَاحِبِهِ لاَ تَحْزَنْ إِنَّ اللّهَ مَعَنَا )
قال السهيلي : ألا ترى كيف قال : لا تحزن ولم يقل لا تخف ؟ لأن حزنه على رسول الله صلى الله عليه وسلم شغله عن خوفه على نفسه .
وفي الصحيحين من حديث أنس بن مالك رضي الله عنه أن أبا بكر الصديق رضي الله عنه حدّثه قال : نظرت إلى أقدام المشركين على رؤوسنا ونحن في الغار فقلت : يا رسول الله لو أن أحدهم نظر إلى قدميه أبصرنا تحت قدميه . فقال : يا أبا بكر ما ظنك باثنين الله ثالثهما .
ولما أراد النبي صلى الله عليه وسلم أن يدخل الغار دخل قبله لينظر في الغار لئلا يُصيب النبي صلى الله عليه وسلم شيء .
ولما سارا في طريق الهجرة كان يمشي حينا أمام النبي صلى الله عليه وسلم وحينا خلفه وحينا عن يمينه وحينا عن شماله .
ولذا لما ذكر رجال على عهد عمر رضي الله عنه فكأنهم فضّـلوا عمر على أبي بكر رضي الله عنهما ، فبلغ ذلك عمر رضي الله عنه فقال : والله لليلة من أبي بكر خير من آل عمر ، وليوم من أبي بكر خير من آل عمر ، لقد خرج رسول الله صلى الله عليه وسلم لينطلق إلى الغار ومعه أبو بكر ، فجعل يمشي ساعة بين يديه وساعة خلفه ، حتى فطن له رسول الله صلى الله عليه وسلم فقال : يا أبا بكر مالك تمشي ساعة بين يدي وساعة خلفي ؟ فقال : يا رسول الله أذكر الطلب فأمشي خلفك ، ثم أذكر الرصد فأمشي بين يديك . فقال :يا أبا بكر لو كان شيء أحببت أن يكون بك دوني ؟ قال : نعم والذي بعثك بالحق ما كانت لتكون من مُلمّة إلا أن تكون بي دونك ، فلما انتهيا إلى الغار قال أبو بكر : مكانك يا رسول الله حتى استبرئ الجحرة ، فدخل واستبرأ ، قم قال : انزل يا رسول الله ، فنزل . فقال عمر : والذي نفسي بيده لتلك الليلة خير من آل عمر . رواه الحاكم والبيهقي في دلائل النبوة .
• ولما هاجر مع رسول الله صلى الله عليه وسلم أخذ ماله كله في سبيل الله .
• وهو أول الخلفاء الراشدين
وقد أُمِرنا أن نقتدي بهم ، كما في قوله عليه الصلاة والسلام : عليكم بسنتي وسنة الخلفاء الراشدين المهديين من بعدي عضوا عليها بالنواجذ . رواه الإمام أحمد والترمذي وغيرهما ، وهو حديث صحيح بمجموع طرقه .
واستقر خليفة للمسلمين دون مُنازع ، ولقبه المسلمون بـ " خليفة رسول الله صلى الله عليه وسلم "
• وخلافته رضي الله عنه منصوص عليها
فقد أمره النبي صلى الله عليه وسلم وهو في مرضه أن يُصلي بالناس
في الصحيحين عن عائشةَ رضي اللّهُ عنها قالت : لما مَرِضَ النبيّ صلى الله عليه وسلم مرَضَهُ الذي ماتَ فيه أَتاهُ بلالٌ يُؤْذِنهُ بالصلاةِ فقال : مُروا أَبا بكرٍ فلْيُصَلّ . قلتُ : إنّ أبا بكرٍ رجلٌ أَسِيفٌ [ وفي رواية : رجل رقيق ] إن يَقُمْ مَقامَكَ يبكي فلا يقدِرُ عَلَى القِراءَةِ . قال : مُروا أَبا بكرٍ فلْيُصلّ . فقلتُ مثلَهُ : فقال في الثالثةِ - أَوِ الرابعةِ - : إِنّكنّ صَواحبُ يوسفَ ! مُروا أَبا بكرٍ فلْيُصلّ ، فصلّى .
ولذا قال عمر رضي الله عنه : أفلا نرضى لدنيانا من رضيه رسول الله صلى الله عليه وسلم لديننا ؟!
وروى البخاري ومسلم عن عائشة رضي الله عنها قالت : قال لي رسول الله صلى الله عليه وسلم في مرضه : ادعي لي أبا بكر وأخاك حتى اكتب كتابا ، فإني أخاف أن يتمنى متمنٍّ ويقول قائل : أنا أولى ، ويأبى الله والمؤمنون إلا أبا بكر .
وجاءت امرأة إلى النبي صلى الله عليه وسلم فكلمته في شيء فأمرها بأمر ، فقالت : أرأيت يا رسول الله إن لم أجدك ؟ قال : إن لم تجديني فأتي أبا بكر . رواه البخاري ومسلم .
• وقد أُمرنا أن نقتدي به رضي الله عنه
قال عليه الصلاة والسلام : اقتدوا باللذين من بعدي أبي بكر وعمر . رواه الإمام أحمد والترمذي وابن ماجه ، وهو حديث صحيح .
• وكان أبو بكر ممن يُـفتي على عهد النبي صلى الله عليه وسلم
ولذا بعثه النبي صلى الله عليه وسلم أميراً على الحج في الحجّة التي قبل حجة الوداع
روى البخاري ومسلم عن أبي هريرة رضي الله عنه قال : بعثني أبو بكر الصديق في الحجة التي أمره عليها رسول الله صلى الله عليه وسلم قبل حجة الوداع في رهط يؤذنون في الناس يوم النحر : لا يحج بعد العام مشرك ، ولا يطوف بالبيت عريان .
وأبو بكر رضي الله عنه حامل راية النبي صلى الله عليه وسلم يوم تبوك .
• وأنفق ماله كله لما حث النبي صلى الله عليه وسلم على النفقة
قال عمر بن الخطاب رضي الله عنه : أمرنا رسول الله صلى الله عليه وسلم أن نتصدق ، فوافق ذلك مالاً فقلت : اليوم أسبق أبا بكر إن سبقته يوما . قال : فجئت بنصف مالي ، فقال رسول الله صلى الله عليه وسلم : ما أبقيت لأهلك ؟ قلت : مثله ، وأتى أبو بكر بكل ما عنده فقال : يا أبا بكر ما أبقيت لأهلك ؟ فقال : أبقيت لهم الله ورسوله ! قال عمر قلت : والله لا أسبقه إلى شيء أبدا . رواه الترمذي .
• ومن فضائله أنه أحب الناس إلى رسول الله صلى الله عليه وسلم
قال عمرو بن العاص لرسول الله صلى الله عليه وسلم : أي الناس أحب إليك ؟ قال : عائشة . قال : قلت : من الرجال ؟ قال : أبوها . رواه مسلم .
• ومن فضائله رضي الله عنه أن النبي صلى الله عليه وسلم اتخذه أخـاً له .
روى البخاري ومسلم عن أبي سعيد الخدري رضي الله عنه قال : خطب رسول الله صلى الله عليه وسلم الناس وقال : إن الله خير عبدا بين الدنيا وبين ما عنده فاختار ذلك العبد ما عند الله . قال : فبكى أبو بكر ، فعجبنا لبكائه أن يخبر رسول الله صلى الله عليه وسلم عن عبد خير ، فكان رسول الله صلى الله عليه وسلم هو المخير ، وكان أبو بكر أعلمنا . فقال رسول الله صلى الله عليه وسلم : إن مِن أمَنّ الناس عليّ في صحبته وماله أبا بكر ، ولو كنت متخذاً خليلاً غير ربي لاتخذت أبا بكر ، ولكن أخوة الإسلام ومودته ، لا يبقين في المسجد باب إلا سُـدّ إلا باب أبي بكر .
• ومن فضائله رضي الله عنه أن الله زكّـاه
قال سبحانه وبحمده : ( وَسَيُجَنَّبُهَا الأَتْقَى * الَّذِي يُؤْتِي مَالَهُ يَتَزَكَّى * وَمَا لأَحَدٍ عِندَهُ مِن نِّعْمَةٍ تُجْزَى * إِلا ابْتِغَاء وَجْهِ رَبِّهِ الأَعْلَى * وَلَسَوْفَ يَرْضَى )
وهذه الآيات نزلت في ابي بكر رضي الله عنه .
وهو من السابقين الأولين بل هو أول السابقين
قال سبحانه : ( وَالسَّابِقُونَ الأَوَّلُونَ مِنَ الْمُهَاجِرِينَ وَالأَنصَارِ وَالَّذِينَ اتَّبَعُوهُم بِإِحْسَانٍ رَّضِيَ اللّهُ عَنْهُمْ وَرَضُواْ عَنْهُ وَأَعَدَّ لَهُمْ جَنَّاتٍ تَجْرِي تَحْتَهَا الأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ذَلِكَ الْفَوْزُ الْعَظِيمُ )
• وقد زكّـاه النبي صلى الله عليه وسلم
فلما قال رسول الله صلى الله عليه وسلم : من جرّ ثوبه خيلاء لم ينظر الله إليه يوم القيامة . قال أبو بكر : إن أحد شقي ثوبي يسترخي إلا أن أتعاهد ذلك منه فقال رسول الله صلى الله عليه وسلم : إنك لست تصنع ذلك خيلاء . رواه البخاري في فضائل أبي بكر رضي الله عنه .
• ومن فضائله رضي الله عنه أنه يُدعى من أبواب الجنة كلها
قال عليه الصلاة والسلام : من أنفق زوجين من شيء من الأشياء في سبيل الله دُعي من أبواب الجنة : يا عبد الله هذا خير ؛ فمن كان من أهل الصلاة دعي من باب الصلاة ، ومن كان من أهل الجهاد دُعي من باب الجهاد ، ومن كان من أهل الصدقة دُعي من باب الصدقة ، ومن كان من أهل الصيام دُعي من باب الصيام وباب الريان . فقال أبو بكر : ما على هذا الذي يدعى من تلك الأبواب من ضرورة ، فهل يُدعى منها كلها أحد يا رسول الله ؟ قال : نعم ، وأرجو أن تكون منهم يا أبا بكر . رواه البخاري ومسلم .
• ومن فضائله أنه جمع خصال الخير في يوم واحد
روى مسلم عن أبي هريرة رضي الله عنه قال : قال رسول الله صلى الله عليه وسلم : من أصبح منكم اليوم صائما ؟
قال أبو بكر رضي الله عنه : أنا .
قال : فمن تبع منكم اليوم جنازة ؟
قال أبو بكر رضي الله عنه : أنا .
قال : فمن أطعم منكم اليوم مسكينا ؟
قال أبو بكر رضي الله عنه : أنا .
قال : فمن عاد منكم اليوم مريضا ؟
قال أبو بكر رضي الله عنه : أنا .
فقال رسول الله صلى الله عليه وسلم : ما اجتمعن في امرىء إلا دخل الجنة .
• ومن فضائله رضي الله عنه أن وصفه رجل المشركين بمثل ما وصفت خديجة رضي الله عنها رسول الله صلى الله عليه وسلم .
لما ابتلي المسلمون في مكة واشتد البلاء خرج أبو بكر مهاجراً قِبل الحبشة حتى إذا بلغ بَرْك الغماد لقيه ابن الدغنة وهو سيد القارَة ، فقال : أين تريد يا أبا بكر ؟ فقال أبو بكر : أخرجني قومي فأنا أريد أن أسيح في الأرض فأعبد ربي . قال ابن الدغنة : إن مثلك لا يخرج ولا يخرج فإنك تكسب المعدوم وتصل الرحم وتحمل الكَلّ وتقري الضيف وتعين على نوائب الحق ، وأنا لك جار فارجع فاعبد ربك ببلادك ، فارتحل ابن الدغنة فرجع مع أبي بكر فطاف في أشراف كفار قريش فقال لهم : إن أبا بكر لا يَخرج مثله ولا يُخرج ، أتُخرجون رجلا يكسب المعدوم ويصل الرحم ويحمل الكل ويقري الضيف ويعين على نوائب الحق ؟! فأنفذت قريش جوار ابن الدغنة وآمنوا أبا بكر وقالوا لابن الدغنة : مُر أبا بكر فليعبد ربه في داره فليصل وليقرأ ما شاء ولا يؤذينا بذلك ولا يستعلن به ، فإنا قد خشينا أن يفتن أبناءنا ونساءنا قال ذلك ابن الدغنة لأبي بكر فطفق أبو بكر يعبد ربه في داره ولا يستعلن بالصلاة ولا القراءة في غير داره ، ثم بدا لأبي بكر فابتنى مسجدا بفناء داره وبرز فكان يصلي فيه ويقرأ القرآن فيتقصف عليه نساء المشركين وأبناؤهم يعجبون وينظرون إليه وكان أبو بكر رجلاً بكّاءً لا يملك دمعه حين يقرأ القرآن فأفزع ذلك أشراف قريش من المشركين فأرسلوا إلى ابن الدغنة فقدم عليهم فقالوا له : إنا كنا أجرنا أبا بكر على أن يعبد ربه في داره وإنه جاوز ذلك فابتنى مسجدا بفناء داره وأعلن الصلاة والقراءة وقد خشينا أن يفتن أبناءنا ونساءنا فأته فإن أحب أن يقتصر على أن يعبد ربه في داره فعل وإن أبى إلاّ أن يعلن ذلك فَسَلْهُ أن يرد إليك ذمتك فإنا كرهنا أن نخفرك ، ولسنا مقرين لأبي بكر الاستعلان . قالت عائشة فأتى ابن الدغنة أبا بكر فقال : قد علمت الذي عقدت لك عليه فإما أن تقتصر على ذلك وإما أن ترد إلي ذمتي فإني لا أحب أن تسمع العرب أني أخفرت في رجل عقدت له قال أبو بكر : إني أرد إليك جوارك وأرضى بجوار الله . رواه البخاري .
• وكان عليّ رضي الله عنه يعرف لأبي بكر فضله
قال محمد بن الحنفية : قلت لأبي – علي بن أبي طالب رضي الله عنه - : أي الناس خير بعد رسول الله صلى الله عليه وسلم ؟ قال : أبو بكر . قلت : ثم من ؟ قال : ثم عمر ، وخشيت أن يقول عثمان قلت : ثم أنت ؟ قال : ما أنا إلا رجل من المسلمين . رواه البخاري .
وقال عليّ رضي الله عنه : كنت إذا سمعت من رسول الله صلى الله عليه وسلم حديثا نفعني الله به بما شاء أن ينفعني منه ، وإذا حدثني غيره استحلفته ، فإذا حلف لي صدقته ، وحدثني أبو بكر وصدق أبو بكر . قال : قال رسول الله صلى الله عليه وسلم : ما من عبد مؤمن يذنب ذنبا فيتوضأ فيحسن الطهور ثم يصلي ركعتين فيستغفر الله تعالى إلا غفر الله له ثم تلا : ( والذين إذا فعلوا فاحشة أو ظلموا أنفسهم ) الآية . رواه أحمد وأبو داود .
• ولم يكن هذا الأمر خاص بعلي رضي الله عنه بل كان هذا هو شأن بنِيـه
قال الإمام جعفر لصادق : أولدني أبو بكر مرتين .
وسبب قوله : أولدني أبو بكر مرتين ، أن أمَّه هي فاطمة بنت القاسم بن محمد بن أبي بكر ، وجدته هي أسماء بنت عبد الرحمن بن أبي بكر .
فهو يفتخر في جّـدِّه ثم يأتي من يدّعي اتِّباعه ويلعن جدَّ إمامه ؟
قال جعفر الصادق لسالم بن أبي حفصة وقد سأله عن أبي بكر وعمر ، فقال : يا سالم تولَّهُما ، وابرأ من عدوهما ، فإنهما كانا إمامي هدى ، ثم قال جعفر : يا سالم أيسُبُّ الرجل جده ؟ أبو بكر جدي ، لا نالتني شفاعة محمد صلى الله عليه وسلم يوم القيامة إن لم أكن أتولاهما وأبرأ من عدوهما .
وروى جعفر بن محمد – وهو جعفر الصادق - عن أبيه – وهو محمد بن علي بن الحسين بن علي – رضي الله عنهم أجمعين ، قال : جاء رجل إلى أبي – يعني علي بن الحسين ، المعروف والمشهور بزين العابدين - فقال : أخبرني عن أبي بكر ؟ قال : عن الصديق تسأل ؟ قال : وتسميه الصديق ؟! قال : ثكلتك أمك ، قد سماه صديقا من هو خير مني ؛ رسولُ الله صلى الله عليه وسلم والمهاجرون والأنصار ، فمن لم يُسمه صدِّيقا ، فلا صدّق الله قوله ، اذهب فأحب أبا بكر وعمر وتولهما ، فما كان من أمـر ففي عنقي .
ولما قدم قوم من العراق فجلسوا إلى زين العابدين ، فذكروا أبا بكر وعمر فسبوهما ، ثم ابتـركوا في عثمان ابتـراكا ، فشتمهم .
وابتركوا : يعني وقعوا فيه وقوعاً شديداً .
وما ذلك إلا لعلمهم بمكانة وزيري رسول الله صلى الله عليه وسلم ، وبمكانة صاحبه في الغار ، ولذا لما جاء رجل فسأل زين العابدين : كيف كانت منزلة أبي بكر وعمر عند رسول الله صلى الله عليه وسلم ؟ فأشار بيده إلى القبر ثم قال : لمنزلتهما منه الساعة .
قال بكر بن عبد الله المزني رحمه الله :
ما سبقهم أبو بكر بكثرة صلاة ولا صيام ، ولكن بشيء وَقَـرَ في قلبه .
وقال شيخ الإسلام ابن تيمية رحمه الله :
يا سَائِلي عَنْ مَذْهَبِي وعَقيدَتِي = رُزِقَ الهُدى مَنْ لِلْهِدايةِ يَسأَلُ
اسمَعْ كَلامَ مُحَقِّقٍ في قَولِه = لا يَنْثَني عَنهُ ولا يَتَبَدَّل
حُبُّ الصَّحابَةِ كُلُّهُمْ لي مَذْهَبٌ = وَمَوَدَّةُ القُرْبى بِها أَتَوَسّل
وَلِكُلِّهِمْ قَدْرٌ وَفَضْلٌ ساطِعٌ = لكِنَّما الصِّديقُ مِنْهُمْ أَفْضَل
• وجمع بيت أبي بكر وآل أبي بكر من الفضائل الجمة الشيء الكثير الذي لم يجمعه بيت في الإسلام
فقد كان بيت أبي بكر رضي الله عنه في خدمة النبي صلى الله عليه وسلم ، كما في الاستعداد للهجرة ، وما فعله عبد الله بن أبي بكر وأخته أسماء في نقل الطعام والأخبار لرسول الله صلى الله عليه وسلم وصاحبه في الغار
وعائشة زوج النبي صلى الله عليه وسلم هي بنت أبي بكر رضي الله عنه وعنها
قال ابن الجوزي رحمه الله :
أربعة تناسلوا رأوا رسول الله صلى الله عليه وسلم :
أبو قحافة
وابنه أبو بكر
وابنه عبد الرحمن
وابنه محمد
أعماله :
من أعظم أعماله سبقه إلى الإسلام وهجرته مع النبي صلى الله عليه وسلم ، وثباته يوم موت النبي صلى الله عليه وسلم .
ومن أعماله قبل الهجرة أنه أعتق سبعة كلهم يُعذّب في الله ، وهم : بلال بن أبي رباح ، وعامر بن فهيرة ، وزنيرة ، والنهدية وابنتها ، وجارية بني المؤمل ، وأم عُبيس .
ومن أعظم أعماله التي قام بها بعد تولّيه الخلافة حرب المرتدين
فقد كان رجلا رحيما رقيقاً ولكنه في ذلك الموقف ، في موقف حرب المرتدين كان أصلب وأشدّ من عمر رضي الله عنه الذي عُرِف بالصلابة في الرأي والشدّة في ذات الله
روى البخاري ومسلم من حديث أبي هريرة رضي الله عنه قال : لما توفى النبي صلى الله عليه وسلم واستُخلف أبو بكر وكفر من كفر من العرب قال عمر : يا أبا بكر كيف تقاتل الناس وقد قال رسول الله صلى الله عليه وسلم : أمِرت أن أقاتل الناس حتى يقولوا لا إله إلا الله ، فمن قال لا إله إلا الله عصم مني ماله ونفسه إلا بحقه وحسابه على الله ؟ قال أبو بكر : والله لأقاتلن من فرق بين الصلاة والزكاة ، فإن الزكاة حق المال ، والله لو منعوني عناقا كانوا يؤدونها إلى رسول الله صلى الله عليه وسلم لقاتلتهم على منعها . قال عمر : فو الله ما هو إلا أن رأيت أن قد شرح الله صدر أبي بكر للقتال فعرفت أنه الحق .
لقد سُجِّل هذا الموقف الصلب القوي لأبي بكر رضي الله عنه حتى قيل : نصر الله الإسلام بأبي بكر يوم الردّة ، وبأحمد يوم الفتنة .
فحارب رضي الله عنه المرتدين ومانعي الزكاة ، وقتل الله مسيلمة الكذاب في زمانه .
ومع ذلك الموقف إلا أنه أنفذ جيش أسامة الذي كان النبي صلى الله عليه وسلم أراد إنفاذه نحو الشام .
وفي عهده فُتِحت فتوحات الشام ، وفتوحات العراق
وفي عهده جُمع القرآن ، حيث أمر رضي الله عنه زيد بن ثابت أن يجمع القرآن
وكان عارفاً بالرجال ، ولذا لم يرضَ بعزل خالد بن الوليد ، وقال : والله لا أشيم سيفا سله الله على عدوه حتى يكون الله هو يشيمه . رواه الإمام أحمد وغيره .
وفي عهده وقعت وقعة ذي القَصّة ، وعزم على المسير بنفسه حتى أخذ عليّ بن أبي طالب رضي الله عنه بزمام راحلته وقال له : إلى أين يا خليفة رسول الله صلى الله عليه وسلم ؟ أقول لك ما قال لك رسول الله صلى الله عليه وسلم يوم أُحد : شِـمْ سيفك ولا تفجعنا بنفسك . وارجع إلى المدينة ، فو الله لئن فُجعنا بك لا يكون للإسلام نظام أبدا ، فرجع أبو بكر رضي الله عنه وأمضى الجيش .
وكان أبو بكر رضي الله عنه أنسب العرب ، أي أعرف العرب بالأنساب .
زهـده :
مات أبو بكر رضي الله عنه وما ترك درهما ولا دينارا
عن الحسن بن علي رضي الله عنه قال : لما احتضر أبو بكر رضي الله عنه قال : يا عائشة أنظري اللقحة التي كنا نشرب من لبنها والجفنة التي كنا نصطبح فيها والقطيفة التي كنا نلبسها فإنا كنا ننتفع بذلك حين كنا في أمر المسلمين ، فإذا مت فاردديه إلى عمر ، فلما مات أبو بكر رضي الله عنه أرسلت به إلى عمر رضي الله عنه فقال عمر رضي الله عنه : رضي الله عنك يا أبا بكر لقد أتعبت من جاء بعدك .
ورعـه :
كان أبو بكر رضي الله عنه ورعاً زاهداً في الدنيا حتى لما تولى الخلافة خرج في طلب الرزق فردّه عمر واتفقوا على أن يُجروا له رزقا من بيت المال نظير ما يقوم به من أعباء الخلافة
قالت عائشة رضي الله عنها : كان لأبي بكر غلام يخرج له الخراج ، وكان أبو بكر يأكل من خراجه ، فجاء يوماً بشيء ، فأكل منه أبو بكر ، فقال له الغلام : تدري ما هذا ؟ فقال أبو بكر : وما هو ؟ قال : كنت تكهّنت لإنسان في الجاهلية وما أحسن الكهانة إلا أني خدعته ، فلقيني فأعطاني بذلك فهذا الذي أكلت منه ، فأدخل أبو بكر يده فقاء كل شيء في بطنه . رواه البخاري .
وفاته :
توفي في يوم الاثنين في جمادى الأولى سنة ثلاث عشرة من الهجرة ، وه ابن ثلاث وستين سنة .
فرضي الله عنه وأرضاه
وجمعنا به في دار كرامته
""";

// زيد بن حارثة
const String zaidStory =
"""
لقب زيد بن حارثة ب «حِب رسول الله»، حيث أحبه النبي حباً عظيماً، حتى أسماه الصحابة «زيد الحب»، وقالت السيدة عائشة رضي الله عنها: ما بعث رسول الله زيد بن حارثة في جيش قط إلا أمّره عليهم، ولو بقي حياً بعد الرسول لاستخلفه.
كان زيد بن حارثة أقرب الناس إلى النبي عليه الصلاة والسلام، وقد التقيا قبل أن بعثه النبي، وكان زيد صغير السن عمره لا يزيد على ثماني سنوات، فكان مع أمه في زيارة بيت جده، وجاءت غارة فأخذته وباعته في سوق عكاظ عبداً، واشتراه حكيم بن حزام بن خويلد بأربع مئة درهم، واشترى معه طائفةً من الغلمان وعاد بهم إلى مكة، فلما عرفت عمته خديجة بنت خوَيلد بمقدمه زارته، فقال: يا عمة، لقد ابتعت من سوق عكاظٍ طائفةً من الغلمان، فاختاري أياً منهم تشاءين فهو هدية لكِ، فاختارت زيداً لِما بدا لها من نجابته، وبعد أن تزوجت النبي صلى الله عليه وسلم، أهدت له غلامها زيد، فأعتقه النبي، ولكنه بقي عنده حراً ليس عبداً، وفي موسمٍ من مواسم الحج قصد البيتَ الحرام نفر من قوم زيد، فعرفوه وعرفهم، وقال لهم زيد: أخبروا أبي أني مع أكرمِ والد.
لما علم حارثة أن ابنه بمكة توجه إليها ومعه أخوه، وطلباً من النبي أن يستردا ابنهما بأي مبلغ من المال، فقال النبي: أدعوه لكم فخيروه بيني وبينكم، فإن اختاركم، فهو لكم بِغير مال، وإن اختارني، فما أنا بالذي يرغب عمن اختاره، فاختار زيد النبي قائلاً: بل أُقيم معك، وما أنا بالذي أختار عليك أحداً أنت الأب والعم، وعندما نهره أبوه قال: إني رأيت من هذا الرجل شيئاً أنساني كل إنسان، ما أنا بالذي يفارقه أبداً.
ولما رأى النبي عليه الصلاة والسلام من زيد ما رأى أخذ بِيده وأخرجه إلى البيت الحرام، ووقف به بِالحجر على ملأ من قريش، وقال: يا معشر قريش، اِشهدوا أن هذا ابني يرثني وأرثه، فلما بُعث النبي، وأبطل الإسلام التبني عاد النبي وناداه زيد بن حارثة امتثالاً لأمر الله، وتطيباً لخاطره ذكر الله اسمه في القرآن الكريم.
أحب النبي زيداً وخلطه بِأهله وبنيه وكان يشتاق إليه إذا غاب عنه، ويفرح بقدومه إذا عاد إليه، ويلقاه لقاء، لا يحظى بِمثله أحد، فاحتل زيد عند النبي صلى الله عليه وسلم مكانة كبيرة، وكان أمين سره رغم صغر سنه، وكان الرسول صلى الله عليه وسلم يقول: «لا تلومونا على حب زيد».
وتروي أم المؤمنين السيدة عائشة رضي الله عنها مشهداً يدل على حب النبي العظيم لزيد قائلة: قدم زيد بن حارِثة المدينة ورسول الله صلى الله عليه وسلم في بيتي فقرعَ الباب، وكان رسول الله متخففاً من ثيابه، فلما علِمَ أن زيداً قد جاء فمن شِدة شوقه لِزيد واهتِمامه به نسِيَ أن يرتدي ثِيابه الخارِجِية، فلما قرع الباب قام إليه النبي بِثيابه الخفيفة، ومضى نحو الباب يجر ثوبه فاعتنقه وقبله، ووالله ما رأيت رسول الله يستقبل أحداً قبله ولا بعده بِهذه الثِّياب.
استشهد زيد بن حارثة في غزوة مؤتة في العام الثامن للهجرة، وكان النبي عليه الصلاة والسلام قد عينه القائِد الأول للجيش، وحزن على زيد وبكاه، فقال له سعد بن عبادة: ما هذا يا رسول الله؟، قال: «شوق الحبيب إلى حبيبه».
""";

// عثمان بن عفان
const String osmanStory =
"""
من هو عثمان بن عفان؟
عثمان بن عفان هو ثالث الخلفاء الراشدين بعد أبو بكر الصديق وعمر بن الخطاب، ومن العشرة المبشرين بالجنة ولد في مكة المكرمة عام 557 م  بعد مولد الرسول محمد صلى الله عليه وسلم بست سنوات وبعد عام الفيل بست سنين، لقب بذي النورين و لقب بذلك بسبب زواجه من ابنتي الرسول صلى الله عليه وسلم رقية والسيدة أم كلثوم.
صفات عثمان بن عفان
عُرِف عثمان بن عفان بأخلاقه الحميدة حيث كان شديد الحياء، كريمًا، كثير الإنفاق في سبيل الله، وتقيًا، وطيب المعاملة ، ولين المعشر، كما كان عثمان رضي الله عنه، كان رجلاً ليس بالطويل ولا بالقصر، وكان أسمر اللون، حسن الوجه، أصلع، رقيق البشرة، كثَّ اللحية كثير شعر الرأس.
مكانة عثمان في الجاهلية
كان عثمان بن عفان من أفضل الناس في قومه أيام الجاهلية، فكان قومه يحبونه أشد الحبّ كما أنه لم يسجد في الجاهلية لصنم قط ولم يقترف فاحشة قط ولم يشرب خمراً قبل الإسلام.  
لقب عثمان بن عفان
لقب عثمان بن عفان بذي النورين، والمراد بالنورين ابنتا النبي صلى الله عليه وسلم “رقية” و”أم كلثوم” رضي الله عنهما؛ حيث زوجه النبي صلى الله عليه وسلم ابنته رقية، وحين توفيت زوجه ابنته الثانية أم كلثوم رضي الله عنهما
إسلام عثمان بن عفان
استجاب عثمان بن عفان لدعوة أبو بكر الصديق له إلى الإسلام، فأسلم في سن الرابعة والثلاثين من عمره وكان بذلك أول الناس إسلامًا بعد أبي بكر وعلي وزيد بن حارثة عثمان فكان بذلك رابع من أسلم من الرجال.
أسرة عثمان بن عفان
زوجات عثمان بن عفان
تزوج عثمان بن عفان ثماني زوجات بعد الإسلام وهنَّ: رقية وأم كلثوم ابنتا رسول الله صلى الله عليه وسلم، فاطمة بنت الوليد، كما تزوج من فاختة بنت غزوان، وأم البنين بنت عيينة، رملة بنت شيبة، نائلة بنت الفرافصة أنجب منهم عدداً من الأولاد والبنات.
ابناء عثمان بن عفان
عبد الله بن عثمان، وأمه رقية بنت الرسول صلى الله عليه وسلم.
 عبد الله الأصغر من فاختة بنت غزوان.
عمرو وخالد وأبان وعمر ومريم، وأمهم أم عمرو بنت جندب الأزدية .
الوليد وسعيد وأم سعد، وأمهم فاطمة بنت الوليد بن عبد شمس.
عبد الملك وأمه أم البنين بنت عيينة بن حصن الفزارية.
 عائشة وأم أبان وأم عمرو وأمهنَّ رملة بنت شيبة بن ربيعة.
اسمها مريم وامها نائلة.
 هجرة عثمان بن عفان إلى الحبشة
بعدما ضاقت الأحوال على المسلمين في مكة، أذن لهم الرسول صلى الله عليه وسلم بالهجرة إلى الحبشة في العام الخامس للهجرة، وكانوا  عشرة رجال وأربع نسوة وهم: عثمان بن عفان، وامرأته رقية بنت رسول الله ﷺ، وأبو حذيفة بن عتبة، وامرأته سهلة بنت سهيل، والزبير بن العوام، ومصعب بن عمير، وعبد الرحمن بن عوف، وأبو سلمة بن عبد الأسد، وامرأته أم سلمة بنت أبى أمية، وعثمان بن مظعون، وعامر بن ربيعة العنزي، وامرأته ليلى بنت أبى حثمة، وأبو سبرة بن أبى رهم، وحاطب بن عمرو، وسهيل بن بيضاء، وعبد الله بن مسعود رضي الله عنهم أجمعين.
مساهمات عثمان بن عفان الاقتصادية في بناء الدولة
كان عثمان بن عفان صاحب تجارة ومن الأغنياء وكان يملك أموال طائلة و أستخدم تلك الأموال في طاعة الله عز وجل وكان سباقًا للخير لايخشى الفقر ومن الأمور الذي ساهم بها من ماله الخاص:
بئر رومة ( وقف عثمان بن عفان )
بعدما هاجر المسلمون إلى المدينة المنورة لم يستسيغوا ماءها وكان بئر رومة من أعذب مياه الآبار في المدينة وكانوا يشربون منه بأجرٍ مدفوع و أرهقهم ذلك، وبعد ذلك حث الرسول صلى الله عليه وسلم أصحابه على شراء البئر والتبرع به للمسلمين مقابل عين في الجنة فاشتراه عثمان بن عفان وجعل البئر وقفًا للمسلمين.
توسعة المسجد النبوي
بعد بناء المسجد النبوي في المدينة صار المسلمون يجتمعون داخله في أوقات الصلوات وخطب الرسول كما كانوا يأتون إليه بهدف تعلم تعاليم دينهم و ينطلقون منه إلى الغزوات وبسبب ذلك ضاق المسجد بالناس فقرر الرسول شراء بقعة بجانب المسجد بهدف توسعته فاشتراها عثمان بن عفان وأضيفت للمسجد النبوي.
تجهز جيش العسرة
عندما أراد الرسول صلى الله عليه وسلم الخروج إلى غزوة تبوك حث الأغنياء على البذل لتجهيز جيش العسرة الذي أعده الرسول لغزو الروم فقام الصحابة بالتبرع كل حسب طاقته وجهده أما عثمان فقد تبرع بنفقة عظيمة لم يتبرع أحد مثله.
عثمان بن عفان في عهد رسول الله
من الأحاديث التي ذكرها الرسول صلى الله عليه وسلم في عثمان بن عفان:
اهدأ فما عليك إلا نبي أو صديق أو شهيد:
عن أبي هريرة رضي الله عنه: أن رسول الله صلى الله عليه وسلم كان على حراء، وأبو بكر، وعمر وعثمان، وعلي وطلحة، والزبير، فتحركت الصخرة، فقال رسول الله صلى الله عليه وسلم : إهدأ فما عليك إلا نبيُ أو صديقُ أو شهيدُ.
 أصدقها حياءً عثمان:
عن أنس بن مالك قال: أرحم أمتي أبو بكر وأشدها في دين الله عمر، وأصدقها حياء عثمان، وأعلمها بالحلال والحرام معاذ بن جبل، وأقرؤها لكتاب الله أُبَيْ وأعلمها بالفرائض زيد بن ثابت، ولكل أمة أمين وأمين هذه الأمة أبو عبيدة بن الجراح
افتح له وبشره بالجنة على بلوى تصيبه:
روي عن أبي موسى الأشعري رضي الله عنه أنه قال : كنت مع النبي في حائط من حيطان المدينة فجاء رجل فاستفتح، فقال النبي صل الله عليه وسلم : افتح له وبشره بالجنة ففتحت له فإذا هو أبو بكر فبشرته بما قال رسول الله فحمد الله ثم جاء رجل فاستفتح فقال النبي : افتح له وبشره بالجنة ففتحت له فإذا هو عمر فأخبرته بما قال رسول الله فحمد الله ثم جاء رجل فاستفتح فقال لي : افتح له وبشره بالجنة على بلوى تصيبه فإذا عثمان فأخبرته بما قال رسول الله فحمد الله ثم قال : الله المستعان.
عثمان بن عفان في عهد الخلفاء الراشدين
عثمان بن عفان في عهد أبي بكر الصديق
كان عثمان بن عفان من الصحابة الذي له شأن كبير بين أفراد قومه وكان له رأيُ و مشورى في الكثير من المسائل وأهمها خلافة أبو بكر واختيار عمر بن الخطاب خليفة بعده، حيث لما أشتد المرض بأبي بكر قام باستشارة الناس فيمن يحبون أن يقوم بأمر الخلافة بعده فاختاروا عمر كما أختار عثمان رضي الله عنه عمر بن الخطاب.
أستمع الى : سيرة الصحابي أبو بكر الصديق
عثمان بن عفان في عهد عمر الفاروق
   حظي عثمان بن عفان بمكانة متميزة في عهد عمر بن الخطاب وكان مقامه كمقام الوزير من الخليفة، كما أشار عثمان رضي الله عنه على عمر بفكرة الديوان وكتابة التاريخ كما جاء في بعض الروايات.
خلافة عثمان بن عفان 
بعد مرض عمر بن الخطاب  قام  بترشيح ست أسماء للخلافة من بعده وهم: علي بن ابي طالب، وعثمان بن عفان، وعبد الرحمن بن عوف، وسعد بن أبي وقاص، والزبير بن العوام، وطلحة بن عبيد الله رضي الله عنهم جميعًا، وأمرهم أن يجتمعوا في بيت أحدهم ويتشاوروا فيما بينهم، وفيهم عبد الله بن عمر يحضر معهم مشيراً فقط وفي حال عدم الرضى بما حكمه أمرهم بأن  يكونوا مع الّذين فيهم عبد الرَّحمن بن عوف، ويصلِّي بالناس أثناء التَّشاور صهيب الرُّوميُّ، حتَّى لا يولِّي إمامة الصلاة أحداً من السِّتَّة، وأمر المقداد بن الأسود، وأبا طلحة الأنصاريَّ أن يرقبا سير الانتخابات، وبعد مشاورات دامت ثلاثة أيام تم أختيار عثمان بن عفان خليفة على المسلمين.
منهج عثمان بن عفان في الحكم
بعد تسلم عثمان بن عفان الخلافة خطب خطبتًا وأعلن فيها عن منهجه السياسي في إدارة الحكم ويمكن ذكرها على النحو التالي:
المرجعية العليا للدولة
أعلن ذو النورين أن المرجعية الأساسية لقيادة الدولة كتاب الله وسنة رسوله صلى الله عليه وسلم و الاقتداء بأبي بكر وعمر.
حق الأمة في محاكمة الخليفة
سلطة الخليفة ليست مطلقة وإنما مقيدة بعدم مخالفة ما جاء في القرآن الكريم والسنة وألا تخالف ما اتفقت عليه الأمة الإسلامية.
الشورى مع المسلمين 
من قواعد الدولة الإسلامية حتمية تشاور قادة الدولة  والمسلمين والوصول إلى حكم يرضي جميع الأطراف.
العدل والمساواة
من أهداف الحكم الإسلامي الحرص على إقامة قواعد النظام الإسلامي وأهم القواعد: العدل والمساواة حيث كانت سياسته قائمة على العدل بأسمى صوره.
الحريات 
مبدأ الحرية من المبادئ الأساسية التي قام عليها الحكم في عهد الخلفاء الراشدين والذي يحث على تأمين وكفالة الحرية العامة للناس كافة ضمن  حدود الشريعة الإسلامية.
جمع القرآن الكريم في عهد عثمان بن عفان
المراحل التي مرت بها كتابة القرآن الكريم
في العهد النبوي:
اكتمل نزول القرآن الكريم في زمن الرسول صلى الله عليه وسلم، لكنه لم يُجمع في مصحف واحد في عهده، وكان الصحابة يكتبون ما ينقله الرسول لهم من آيات وسور قرأنية.
في عهد أبي بكر الصديق:
في عهد أبو بكر استشهد خمسمائة حافظ للقرآن في معركة اليمامة  فقرر الخليفة ابو بكر جمع الآيات والسور في كتاب موحد، حرصًا منه على حفظ القرآن من الضياع، فأوكل مهمة كتابة القرآن وجمعه إلى زيد بن ثابت بشرط وجود شاهدين لكل آية يتم كتابتها وبذلك تم نقل الآيات بعناية وحذر.
في عهد عثمان بن عفان:
قرر الخليفة عثمان إعادة توحيد المسلمين على مصحف واحد (المصحف الإمام)  بسبب انتشار الكثير من النسخ المكتوبة والمنقولة بشكل خاطئ مما أدى إلى وقوع خلافات بين الناس على المصحف الصحيح وتم طباعة ستة نسخ وتوزيع نسخة لكل دولة وهم، افريقيا، ومصر، الشام، العراق، بلاد فارس ونسخة بقيت لدى عثمان بن عفان، وأمر بحرق جميع النسخ الأخرى الموجودة مع الناس بهدف التأكد من عدم وجود أي نسخ خاطئة من القرآن الكريم.
أهم الفتوحات التي حصلت في عهد عثمان بن عفان
قسم عثمان الجبهات العسكرية إلى ثلاثة أقسام
الجبهة الشرقية: حصل العديد من الفتوحات في هذه الجبهة وتم تقسيمها الى معسكرين وهما، معسكر البصرى و معسكر الكوفة، ومن الفتوحات التي حصلت فيها فتوحات أهل الكوفة، وغزو سعيد بن العاص طبرستان.
الجبهة الشمالية: مركزها دمشق ومنها ينطلق المسلمون لقتال الروم، حصل فيها العديد من الفتوحات كـ فتوحات حبيب بن مسلمة الفهري وغزو القبرص.
الجبهة الغربية: مركزها مدينة الفسطاط و التي بناها عمرو بن العاص، وحالياً هي مدينة مصر، من الفتوحات التي حصلت فيها، فتح بلاد النوبة، وفتح إفريقيا.
الفتنة التي حصلت ضد عثمان بن عفان
الشبهات التي طُعن بها عثمان: 
استلم عثمان الحكم اثنتي عشرة سنة أميراً للمؤمنين، أول ست سنين منها لم ينقم الناس على عثمان بشيء لكن في النصف الثاني من ولايته بدأت الفتنة، وبدأت الدعاوى تروج ضده ويمكن تقسيم الشبهات التي وجهت لعثمان على النحو التالي:
مواقف شخصية له قبل توليه الخلافة كـ تغيبه عن بعض الغزوات والمواقع ..
سياسته المالية: الأعطيات..
سياسته الإدارية: تولية أقربائه، طريقته في التولية..
اجتهادات خاصة به، أو بمصلحة الأمة كـ إتمام الصلاة بمنى، جمع القرآن، الزيادة في المسجد..
معاملته لبعض الصحابة كـ عمار و أبي ذر وابن مسعود..
استشهاد عثمان بن عفان
نشبت فتنة في النصف الثاني من خلافة عثمان بن عفان، وقُتل ظلماً على إثرها في اليوم الثامن عشر، من ذي الحِجّة، من السنة الخامسة والثلاثين للهجرة، بعدما مُنِع الطعام والشراب عنه وتم حصاره وقتله في منزله، وبعد وفاته حزن الصحابة والصحابيات حزناً شديداً عليه ومنهم، السيدة عائشة وعلي بن أبي طالب رضوان الله عليهم.
""";

// الزبير بن العوام
const String elZobirStory =
"""
«إنَّ لِكلّ نبيّ حَواريًا، وحَوَارِييّ الزُّبَيرُ»، هذا وصف رسول الله صلى الله عليه وسلم للزبير بن العوام رضي الله عنه؛ والحواري هو "الناصر"؛ فمن هو الزبير رضي الله عنه، الذي عاش مُناصرًا لرسول الله صلى الله عليه وسلم؟
هو أبو عبد الله الزبير بن العوام بن خويلد بن أسد بن عبد العزى بن قصي بن كلاب القرشي الأسدي[1]، ويجتمع مع النبي صلى الله عليه وسلم في قصي وعدد ما بينهما من الآباء سواء[2]، وهو حواري رسول الله صلى الله عليه وسلم وابن عمته، أمه صفية بنت عبد المطلب، وهي التي قامت على تربيته بعد وفاة أبيه العوام بن خويلد رضي الله عنه، وأبوه العوام هو أخ لأم المؤمنين السيدة خديجة بن خويلد رضي الله عنها.
والزبير بن العوام هو أحد العشرة المشهود لهم بالجنة، وأحد الستة أصحاب الشورى بعد مقتل عُمر رضي الله عنه[3]، وهو أَوَّلُ مَنْ سَلَّ سَيْفَهُ فِي سَبِيلِ اللَّهِ[4]، فرضي الله عنه.
ولد الزبير بن العوام رضي الله عنه سنة 28 قبل الهجرة، وكان الزبير بن العوام في كنف ورعاية أمِّه السيدة صفية بنت عبد المطلب رضي الله عنها وكانت تُربيه تربيةً حازمة؛ كي يكون مُقاتلًا شُجاعًا، يستطيع أن يدافع عن قومه، كي يكون عوضًا عن أبيه الذي قُتل في حرب الفجار قبل الإسلام، وعندما بلغ عمر الزبير ست عشرة سنة أسلم[5]، وصار من أوائل من دخلوا في الإسلام، وتعرَّض للابتلاء في أول إسلامه؛ حيث تعرَّض لتعذيبٍ شديدٍ في سبيل دينه، وكان الذي تولى تعذيبه عمه؛ كان يلفه في حصير، ويدخن عليه بالنار كي تزهق أنفاسه، ويناديه وهو تحت وطأة العذاب: أكفر بربِّ محمدٍ أدرأ عنك العذاب، فيجيبُه الزبير في تحدٍّ رهيب: والله لا أعود لكفرٍ أبدًا[6].
ويهاجر الزبير رضي الله عنه الهجرتين الأولى والثانية، ثم يعود ليشهد المشاهد كلها مع رسول الله صلى الله عليه وسلم، لا تفتقده غزوة ولا معركة[7].
هجرة الزبير بن العوام
كان من المهاجرين بدينهم إلى الحبشة، تزوج أسماء بنت أبي بكر رضي الله عنها، وهاجرا إلى المدينة، فولدت له أول مولود للمسلمين في المدينة عبد الله بن الزبير رضي الله عنه، ثم مصعب رضي الله عنه.
وكان رضي الله عنه حريصًا على ملازمة رسول الله صلى الله عليه وسلم، إلا أنه لم يروِ الكثير من الأحاديث؛ فعن عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ رضي الله عنه، عَنْ أَبِيهِ قَالَ: قُلْتُ لِلزُّبَيْرِ رضي الله عنه: مَا لِي لاَ أَسْمَعُكَ تُحَدِّثُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم كَمَا أَسْمَعُ ابْنَ مَسْعُودٍ وَفُلاَنًا وَفُلاَنًا؟! قَالَ: أَمَا إِنِّي لَمْ أُفَارِقْهُ مُنْذُ أَسْلَمْتُ، وَلَكِنِّي سَمِعْتُ مِنْهُ كَلِمَةً «مَنْ كَذَبَ عَلَيَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنْ النَّارِ».[8]
من مناقب الزبير بن العوام:
كان أول من سلَّ سيفًا في سبيل الله؛ فعن عروة وابن المسيب قالا: أول رجل سلَّ سيفه في الله الزبير، وذلك أن الشيطان نفخ نفخة، فقال: أُخذ رسول الله صلى الله عليه وسلم. فأقبل الزبير رضي الله عنه يشق الناس بسيفه، والنبي صلى الله عليه وسلم بأعلى مكة.[9]
ومن مناقبه أنه حواري رسول الله صلى الله عليه وسلم؛ فعَنْ جَابِر بن عبد الله رضي الله عنه قَالَ: قَالَ النَّبِيُّ صلى الله عليه وسلم يَوْمَ الأَحْزَابِ: "مَنْ يَأْتِينِي بِخَبَرِ الْقَوْمِ؟" قَالَ الزُّبَيْرُ رضي الله عنه: أَنَا. ثُمَّ قَالَ: "مَنْ يَأْتِينِي بِخَبَرِ الْقَوْمِ؟" قَالَ الزُّبَيْرُ رضي الله عنه: أَنَا. فَقَالَ النَّبِيُّ صلى الله عليه وسلم: "إِنَّ لِكُلِّ نَبِيٍّ حَوَارِيًّا، وَحَوَارِيَّ الزُّبَيْرُ".[10]
ومن مناقبه ما رواه ابن سعد بإسناد صحيح عن هشام عن أبيه قال كانت على الزبير عمامة صفراء معتجرًا بها يوم بدر فقال النبي صلى الله عليه وسلم: «إِنَّ الْمَلائِكَةَ نَزَلَتْ عَلَى سِيمَاءِ الزُّبَيْرِ».[11]
وفي "يوم قريظة" جمع له رسول الله صلى الله عليه وسلم بين أبويه؛ فَعَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ -رضي الله عنهما- عَنِ الزُّبَيْرِ رضي الله عنه قَالَ: جَمَعَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم أَبَوَيْهِ يَوْمَ قُرَيْظَةَ، فَقَالَ: «بِأَبِي وَأُمِّي».[12]
ومن مناقبه رضي الله عنه أنه كان ممن استجاب لله والرسول من بعد ما أصابهم القرح يوم أحد. فقد روى الشيخان في (صحيحيهما) عن عائشة رضي الله عنها الَّذِينَ اسْتَجَابُواْ لِلّهِ وَالرَّسُولِ مِن بَعْدِ مَآ أَصَابَهُمُ الْقَرْحُ لِلَّذِينَ أَحْسَنُواْ مِنْهُمْ وَاتَّقَواْ أَجْرٌ عَظِيمٌ [آل عمران: 172] قالت لعروة: يا ابن أختي كان أبوك منهم: الزبير وأبو بكر لما أصاب رسول الله صلى الله عليه وسلم ما أصاب يوم أحد وانصرف عنه المشركون خاف أن يرجعوا قال: ((من يذهب في إثرهم؟)) فانتدب منهم سبعون رجلا قال: كان فيهم أبو بكر والزبير.[13]
ومن مناقبه رضي الله عنه أنه كان شجاعًا مقدامًا في ساحة القتال. فقد روى البخاري بإسناده إلى هشام بن عروة عن أبيه: أن أصحاب النبي صلى الله عليه وسلم قالوا للزبير يوم وقعة اليرموك: ألا تَشُدُّ فَنَشُدَّ معكَ، فَحَمَلَ عليهم، فَضَرَبُوهُ ضَرْبَتَيْنِ علَى عاتِقِهِ، بيْنَهُما ضَرْبَةٌ ضُرِبَها يَومَ بَدْرٍ قالَ عُرْوَةُ: فَكُنْتُ أُدْخِلُ أصابِعِي في تِلكَ الضَّرَباتِ ألْعَبُ وأنا صَغِيرٌ.[14]
وروى الترمذي بإسناده إلى هشام بن عروة قال: "أَوْصَى الزُّبَيْرُ إِلَى ابْنِهِ عَبْدِ اللَّهِ صَبِيحَةَ الْجَمَلِ فَقَالَ مَا مِنِّي عُضْوٌ إِلاَّ وَقَدْ جُرِحَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏ حَتَّى انْتَهَى ذَاكَ إِلَى فَرْجِهِ".[15]
الزبير بن العوام في غزوة بدر
كان الزبير رضي الله عنه أحد مغاوير الإسلام وأبطاله في يوم الفرقان، وكان على الميمنة، وقد قتل الزبير في هذا اليوم العظيم عبيدة بن سعيد بن العاص، كما قتل السائب بن أبي السائب بن عابد، ونوفل بن خويلد بن أسد عمه. 
الزبير بن العوام وقافا عند حدود الله
عَنْ عُرْوَةَ، عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ رضي الله عنهما أَنَّهُ حَدَّثَهُ أَنَّ رَجُلاً مِنَ الأَنْصَارِ خَاصَمَ الزُّبَيْرَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم فِي شِرَاجِ الْحَرَّةِ الَّتِي يَسْقُونَ بِهَا النَّخْلَ، فَقَالَ الأَنْصَارِيُّ: سَرِّحْ الْمَاءَ يَمُرُّ. فَأَبَى عَلَيْهِ، فَاخْتَصَمَا عِنْدَ النَّبِيِّ صلى الله عليه وسلم، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِلزُّبَيْرِ: «اسْقِ يَا زُبَيْرُ، ثُمَّ أَرْسِلْ الْمَاءَ إِلَى جَارِكَ». فَغَضِبَ الأَنْصَارِيُّ فَقَالَ: أَنْ كَانَ ابْنَ عَمَّتِكَ. فَتَلَوَّنَ وَجْهُ رَسُولِ اللَّهِ صلى الله عليه وسلم، ثُمَّ قَالَ: «اسْقِ يَا زُبَيْرُ، ثُمَّ احْبِسِ الْمَاءَ حَتَّى يَرْجِعَ إِلَى الْجَدْرِ». فَقَالَ الزُّبَيْرُ رضي الله عنه: وَاللَّهِ إِنِّي لأَحْسِبُ هَذِهِ الآيَةَ نَزَلَتْ فِي ذَلِكَ ﴿فَلاَ وَرَبِّكَ لاَ يُؤْمِنُونَ حَتَّى يُحَكِّمُوكَ فِيمَا شَجَرَ بَيْنَهُمْ﴾ [النساء: 65].[16] 
الزبير بن العوام متوكلا على الله
كان توكله على الله منطلق جوده وشجاعته وفدائيته، وحين كان يجود بروحه أوصى ولده عبد الله رضي الله عنه بقضاء ديونه قائلاً: " يا بُنَيِّ إنْ عَجَزْتَ عنْه في شَيءٍ، فَاسْتَعِنْ عليه مَوْلَايَ". فسأله عبد الله رضي الله عنه: "يا أَبَةِ مَن مَوْلَاكَ؟" فأجابه: "اللَّهُ"، نعم المولى ونعم النصير. يقول عبد الله رضي الله عنه فيما بعد: "فَوَاللَّهِ ما وقَعْتُ في كُرْبَةٍ مِن دَيْنِهِ، إلَّا قُلتُ: يا مَوْلَى الزُّبَيْرِ اقْضِ عنْه دَيْنَهُ، فَيَقْضِيهِ"[17].
الزبير بن العوام مع الخلفاء الراشدين:
انتقل رسول الله صلى الله عليه وسلم وهو راضٍ عن أصحابه ومن جملتهم الزبير بن العوام رضي الله عنه، وظلَّ الزبير على عهده مع خلفاء الرسول صلى الله عليه وسلم، فكان من قادة الجيوش في خلافة أبي بكر رضي الله عنه، فشارك في غزوة اليرموك التي كانت ضد الرُّومان، وحين رأى أكثر المقاتلين الذين كان على رأسهم يتقهقرون أمام جبال الروم الزاحفة، صاح هو: "الله أكبر"، واخترق تلك الجبال الزاحفة وحده، ضاربًا بسيفه، ثم قفل راجعًا وسط الصفوف الرهيبة ذاتها، حتى كتب الله النصر للمسلمين.
الزبير بن العوام وموقعة الجمل
بعد استشهاد عثمان بن عفان رضي الله عنه أتمَّ المبايعة الزبير وطلحة لعليٍّ رضي الله عنهم، وخرجوا إلى مكة معتمرين، ومن هناك خرجوا إلى البصرة للأخذ بثأر عثمان، وكانت وقعة الجمل عام 36هـ؛ طلحة والزبير رضي الله عنهما في فريق، وعليٌّ رضي الله عنه في الفريق الآخر.
وأقلع طلحة والزبير رضي الله عنهما عن الاشتراك في هذه الحرب، ولكن دفعا حياتهما ثمنًا لانسحابهما، ولقيا ربَّهما قريرة أعينهما بما قرَّرا.
""";
// سعد بن أبي وقاص
const String saadStory =
"""
  «هَذَا خَالِي، فَلْيُرِنِي امْرُؤٌ خَالَهُ»[1] بهذه الكلمات الحانية من رسول الله صلى الله عليه وسلم نتعرَّف على بطلٍ من أبطال الإسلام، ومن السابقين الأولين، فمن هو سعد بن أبي وقاصٍ؟
هو سَعْدُ بْنُ أَبِي وَقَّاصٍ، وَاسْمُ أَبِي وَقَّاصٍ مَالِكُ بْنُ أُهَيْبِ بْنِ عَبْدِ مَنَافِ بْنِ زُهْرَةَ بْنِ كِلَابِ بْنِ مُرَّةَ بْنِ كَعْبِ بْنِ لُؤَيِّ[2].
ولسعد من أبيه من الإخوة عامر وعمير وعتبة، فأما عامر وعمير فأسلما، واستشهد عمير في غزوة بدر وهو لم يجاوز العشرين عامًا.
ويُعَدُّ سعد بن أبي وقاص من أوائل من دخلوا في الإسلام، وكان عمره عندئذٍ سبعة عشر عاما، ولم يسبقه في الإسلام إلا أبو بكر الصديق وعلي بن أبي طالب وزيد بن حارثة، وهو أحد العشرة المبشرين بالجنة.
 
نشأة سعد بن أبي وقاص
وُلِدَ سعد بن أبي وقاص في مكة سنة 23 قبل الهجرة، نشأ سعدٌ في قريش من سادة العرب وأعزِّهم، واشتغل في بري السهام وصناعة القسيِّ، وهذا عمل يُؤَهِّل صاحبه للائتلاف مع الرمي، وحياة الصيد والغزو، وكان يمضي وقته وهو يُخالط شباب قريش وسادتهم، ويتعرَّف على الدنيا من خلال معرفته على الحجيج الوافد إلى مكة المكرمة في أيام الحجِّ ومواسمها المتباينة الأهداف والمتنوعة الغايات.
 
نسب سعد بن أبي وقاص الشريف
أبوه ابن سيد بني زهرة: مالك بن وهيب بن عبد مناف بن زهرة بن كلاب بن مرة بن كعب بن لؤي بن غالب بن فهر بن مالك بن النضر بن كنانة بن خزيمة بن مدركة عامر بن إلياس بن مضر بن نزار بن معد بن عدنان. ومالك هذا هو ابن عم آمنة بنت وهب أم رسول الله صلى الله عليه وسلم، وخال حمزة وصفية ابني عبد المطلب.
أُمُّه: حمنة بنت سفيان بن أمية الأكبر بن عبد شمس بن عبد مناف بن قصي بن كلاب بن مرة بن كعب بن لؤي بن غالب بن فهر بن مالك بن النضر بن كنانة بن خزيمة بن مدركة عامر بن إلياس بن مضر بن نزار بن معد بن عدنان.
فهو من بني زهرة أهل آمنة بنت وهب أُمِّ الرسول صلى الله عليه وسلم؛ فقد كان الرسول يعتزُّ بهذه الخُئُولة، فقد ورد أنه كان جالسًا مع نفر من أصحابه فرأى سعد بن أبي وقاص مقبلاً، فقال لمن معه: «هَذَا خَالِي فَلْيُرِنِي امْرُؤٌ خَالَهُ»[3].
 
إسلام سعد بن أبي وقاص
دخل سعد بن أبي وقاص رضي الله عنه الإسلام وهو ابن سبع عشرة سنة، وكان إسلامه مبكِّرًا، ويتحدث عن نفسه فيقول: «.. وَلَقَدْ مَكَثْتُ سَبْعَةَ أَيَّامٍ، وَإِنِّي لَثُلُثُ الإِسْلاَمِ[4]. يعني أنه كان ثالث أوَّل ثلاثة سارعوا إلى الإسلام، وقد أعلن إسلامَه مع الذين أعلنوه بإقناع أبي بكر الصديق إيَّاهم؛ وهم: عثمان بن عفان، والزبير بن العوام، وعبد الرحمن بن عوف، وطلحة بن عبيد الله.
 
محاولات ردّه عن الإسلام
أخفقت جميع محاولات ردِّه وصدِّه عن الإسلام؛ فلجأت أُمُّه إلى وسيلة لم يكن أحدٌ يشُكُّ في أنها ستَهزم رُوح سعدٍ وتردُّ عزمه إلى وثنية أهله وذويه، لقد أعلنت أُمُّه صومها عن الطعام والشراب؛ حتى يعود سعدٌ إلى دين آبائه وقومه، ومضت في تصميم مستميت تواصل إضرابها عن الطعام والشراب حتى قاربت على الهلاك.
عن مصعب بن سعد، عن أبيه رضي الله عنه أنه نزلت فيه آياتٌ من القرآن؛ قال: "حَلَفَتْ أمُّ سعدٍ أن لا تكلِّمه أبدًا حتى يَكْفُرَ بدِينه، ولا تأكل ولا تشرب، قالت: "زَعَمْتَ أنَّ اللهَ وصَّاك بوالدَيْك، وأنا أمُّكَ، وأنا آمُرُكَ بهذا"، قال: مَكَثَتْ ثلاثًا، حتى غُشِيَ عليها من الجَهْد، فقام ابنٌ لها يقال له: عُمارة، فسقاها، فجعلت تدعو على سعد، فأنزل الله عزَّ وجلَّ في القرآن هذه الآية: ﴿وَإِنْ جَاهَدَاكَ عَلَى أَنْ تُشْرِكَ بِي مَا لَيْسَ لَكَ بِهِ عِلْمٌ فَلَا تُطِعْهُمَا وَصَاحِبْهُمَا فِي الدُّنْيَا مَعْرُوفًا﴾ [لقمان:15]"[5].
وفي روايةٍ أنه قال: "يا أُمَّهْ، تعلمين واللهِ لو كانت لك مِائةُ نَفْسٍ، فخرجتْ نَفْسًا نَفْسًا؛ ما تركتُ ديني هذا؛ فإن شئتِ فَكُلي، وإن شئتِ لا تأكلي، فأَكَلَتْ"[6].
 
مكانة سعد بن أبي وقاص عند رسول الله
عن سعيد بن المسيب، عن سَعدٍ رضي الله عنه، قال: قُلْتُ: يا رسول الله! مَنْ أنا؟ قال: «سَعْدُ بْنُ مَالِكِ بْنِ وُهَيْبِ بْنِ عَبْدِ مَنَافِ بْنِ زُهْرَةَ، مَنْ قَالَ غَيْرَ هَذَا فَعَلَيْهِ لَعْنَةُ اللهِ»[7].
وعن عائشة رضي الله عنها قالت: أَرِقَ رسول الله صلى الله عليه وسلم ذات ليلة فقال: «لَيْتَ رَجُلًا صَالِحًا مِنْ أَصْحَابِي يَحْرُسُنِي اللَّيْلَةَ». قالت: فسمعنا صَوْت السِّلاح، فقال رسول الله: «مَنْ هَذَا؟». قال سعد بن أبي وقاص: أنا يا رسول الله! جئتُ أحرسك. فنام رسول الله صلى الله عليه وسلم حتى سمعتُ غَطِيطَهُ[8].
وقال سعد بن أبي وقاص رضي الله عنه: اشتكيتُ بمكة، فدخل عليَّ رسول الله صلى الله عليه وسلم يعودني، فمسح وجهي وصدري وبطني، وقال: «اللَّهُمَّ اشْفِ سَعْدًا». فما زِلْتُ يُخَيَّلُ إليَّ أَنِّي أَجدُ برد يده صلى الله عليه وسلم على كبدي حتى الساعة[9].
 
الدعوة المجابة
كان سعد بن أبي وقاص رضي الله عنه إذا رمى عدوًّا أصابه، وإذا دعا اللهَ دعاءً أجابه، وكان الصحابة يردُّون ذلك إلى دعوة الرسول صلى الله عليه وسلم له: «اللَّهُمَّ سَدِّدْ رَمَيْتَهُ، وَأَجِبْ دَعْوَتَهُ»[10].
ويُرْوَى أنه رأى رجلاً يسبُّ طلحة وعليًّا والزبير فنهاه فلم ينتهِ، فقال له: «إذن أدعو عليك». فقال الرجل: «أراك تهدِّدني كأنك نبي!». فانصرف سعدٌ وتوضَّأ وصلَّى ركعتين، ثم رفع يديه قائلاً: «اللهم إن كنتَ تعلم أن هذا الرجل قد سبَّ أقوامًا سبقت لهم منك الحسنى، وأنه قد أسخطك سبُّه إيَّاهم، فاجعله آية وعبرة». فلم يمضِ غير وقت قصير حتى خرجت من إحدى الدُّور ناقة نادَّة (شاردة) لا يردُّها شيء، حتى دخلت في زحام الناس، ثم اقتحمت الرجل فأخذته بين قوائمها، وما زالت تتخبَّطه حتى مات.
 
جهاد سعد بن أبي وقاص
يُعتبر سعد بن أبي وقاص رضي الله عنه أول مَنْ رمى بسهم في سبيل الله، وأنه الوحيد الذي افتداه الرسول صلى الله عليه وسلم بأبويه؛ فقال له يومَ أحد: «ارْمِ سَعْدُ فِدَاكَ أَبِي وَأُمِّي». ويقول علي بن أبي طالب رضي الله عنه: ما سمعتُ رسول الله صلى الله عليه وسلم يفدي أحدًا بأبويه إلا سعدًا، فإني سمعته يوم أحد يقول: «ارْمِ سَعْدُ فِدَاكَ أَبِي وَأُمِّي»[11].
وقد كان سعد يُعَدُّ من أشجع فرسان العرب والمسلمين، وكان له سلاحان: رمحه ودعاؤه، وكان مجاهدًا في غزوة بدر، وشارك في غزوة أحد، وتفرَّق الناس أول الأمر عن رسول الله صلى الله عليه وسلم ووقف سعد يُجاهد ويقاتل، فلمَّا رآه الرسول صلى الله عليه وسلم يرمي جعل يُحَرِّضه ويقول له: «يا سَعْدُ؛ ارْمِ فِدَاكَ أَبِي وَأُمِّي». وظلَّ سعدٌ يفتخر بهذه الكلمة طوال حياته.
 
فتوحات سعد بن أبي وقاص
قاد سعد بن أبي وقاص المسلمين في معركة القادسية حيث خرج في ثلاثين ألف مقاتل، وكان عدد الفرس أكثر من مائة ألف من المقاتلين المدرَّبين المدجَّجين بأنواعٍ متطوِّرة من عتاد وسلاح، وكان يتولَّى قيادة الفرس رستم، وقبل المعركة كانت هناك رسائل بين سعدٍ وأمير المؤمنين الخليفة الراشد الفاروق عمر بن الخطاب رضي الله عنه؛ منها: «يا سعد بن وهيب.. لا يغرَّنَّك من الله أن قيل: خال رسول الله وصاحبه. فإن الله ليس بينه وبين أحد نسب إلَّا بطاعته.. والناس شريفهم ووضيعهم في ذات الله سواء.. الله ربهم، وهم عباده.. يتفاضلون بالعافية، ويدركون ما عند الله بالطاعة، فانظر الأمر الذي رأيتَ رسول الله صلى الله عليه وسلم منذ بُعِثَ إلى أن فارَقَنَا عليه فالزمه؛ فإنه الأمر». ثم يقول له: «اكتب إليَّ بجميع أحوالكم، وكيف تنزلون، وأين يكون عدوُّكم منكم.. واجعلني بكتبك إليَّ كأني أنظر إليكم!».
ويكتب سعد إلى أمير المؤمنين فيصف له كل شيء؛ حتى إنه ليكاد يُحَدِّد له موقف كل جندي ومكانه، وقد أوصى عمر سعدًا بدعوتهم إلى الإسلام، ويُنَفِّذ سعد وصية عمر، فيُرسل إلى رستم قائد الفرس نفرًا من أصحابه يدعونه إلى الله وإلى الإسلام.
وكان المرض قد اشتدَّ على سعد، وملأت الدمامل جسده؛ حتى ما كان يستطيع أن يجلس، مفضلاً أن يعلو صهوة جواده ويخوض عليه معركة، عندئذٍ وقف في جيشه خطيبًا، مستهلاً خطابه بالآية الكريمة: ﴿وَلَقَدْ كَتَبْنَا فِي الزَّبُورِ مِنْ بَعْدِ الذِّكْرِ أَنَّ الْأَرْضَ يَرِثُهَا عِبَادِيَ الصَّالِحُون﴾ [الأنبياء:105]، وبعد فراغه من خطبته، صلَّى بالجيش صلاة الظهر، ثم استقبل جنوده مكبِّرًا أربعًا: الله أكبر.. الله أكبر.. الله أكبر.. الله أكبر.. واستطاع جيش سعد هزيمة الفرس وقائدها رستم، ووصل الجيش إلى المدائن.
وكانت موقعة المدائن بعد موقعة القادسية بقرابة عامين؛ حيث جرت خلالهما مناوشات مستمرَّة بين الفرس والمسلمين، وقد استطاع سعد هزيمة الفرس؛ وذلك بقيادة الجيش وعبور نهر دجلة، وقد جهَّز كتيبتين؛ الأولى: واسمها كتيبة الأهوال، وأمَّر سعدٌ عليها عاصم بن عمرو التميمي، والثانية: اسمها الكتيبة الخرساء، وأمَّر عليها القعقاع بن عمرو التميمي، وقد نجحا في العبور وهزيمة الفرس.
 
إمارة العراق
ولَّاه الخليفة عمر ‎بن الخطاب رضي الله عنه إمارة العراق، فراح سعد رضي الله عنه يبني ويُعمِّر في الكوفة، وذات يوم اشتكاه أهل الكوفة لأمير المؤمنين؛ فقالوا: «إن سعدًا لا يُحسن الصلاة». واستدعاه عمر رضي الله عنه إلى المدينة فلَّبى مسرعًا، ويضحك سعدًا حين علم بشكوى أهل الكوفة قائلاً: «والله إني لأُصَلِّي بهم صلاة رسول الله، أُطيل في الركعتين الأوليين وأقصر في الآخرين». وحين أراد عمر ‎بن الخطاب أن يُعيده إلى الكوفة ضحك سعدٌ قائلاً: «أتأمرني أن أعود إلى قوم يزعمون أَنِّي لا أُحسن الصلاة؟!» وفضَّل البقاء في المدينة.
وعندما حضرت عمرَ رضي الله عنه الوفاةُ بعد أن طعنه المجوسي جعل الأمر من بعده إلى الستة الذين مات النبي وهو عنهم راضٍ؛ وأحدهم سعد بن أبي وقاص، وقال عمر: إن وليها سعد فذاك، وإن وليها غيره فليستعن بسعد.
 
اعتزاله الفتنة
اعتزل سعد رضي الله عنه الفتنة الكبرى بين علي بن أبي طالب ومعاوية بن أبي سفيان، وأمر أهله وأولاده ألَّا ينقلوا إليه شيئًا من أخبارها، وقد ذهب إليه ابن أخيه هاشم بن عتبة بن أبي وقاص يقول له: «يا عم، ها هنا مائة ألف سيف يروك أحقَّ الناس بهذا الأمر». فيُجيبه سعد‎ٌ رضي الله عنه: «أُريد من مائة ألف سيف سيفًا واحدًا؛ إذا ضربتُ به المؤمن لم يصنع شيئًا، وإذا ضربتُ به الكافر قطع». فيتركه هاشم وعزلته، وحين انتهى الأمر لمعاوية بعد الاتفاق الشائك الذي تمَّ بعد معركة صفين، واستقرَّت بيده مقاليد الحكم سأل سعدًا: «ما لكَ لَمْ تُقاتِل معنا؟»
فأجابه: «إني مررت بريح مظلمة، فقلتُ: أخ.. أخ.. واتَّخذت من راحلتي حتى انجلت عني».
فقال معاوية: «ليس في كتاب الله أخ.. أخ.. ولكن قال الله: ﴿وَإِنْ طَائِفَتَانِ مِنَ المُؤْمِنِينَ اقْتَتَلُوا فَأَصْلِحُوا بَيْنَهُمَا فَإِنْ بَغَتْ إِحْدَاهُمَا عَلَى الْأُخْرَى فَقَاتِلُوا الَّتِي تَبْغِي حَتَّى تَفِيءَ إِلَى أَمْرِ اللهِ﴾ [الحجرات:9]. وأنت لم تكن مع الباغية على العادلة، ولا مع العادلة على الباغية».
فأجابه سعد رضي الله عنه قائلاً: ما كنتُ لأقاتل رجلاً قال له رسول الله صلى الله عليه وسلم: «أَنْتَ مِنِّي بِمَنْزِلَةِ هَارُونَ مِنْ مُوسَى، إِلَّا أَنَّهُ لَا نَبِيَّ بَعْدِي[12].
 
وفاة سعد بن أبي وقاص
كان عمر سعد بن أبي وقاص طويلًا، وأفاء الله عليه من المال الكثير؛ لكنه حين أدركته الوفاة دعا بجبة من صوف بالية، وقال: «كفنوني بها؛ فإني لقيت بها المشركين يوم بدر، وإني أريد أن ألقى بها الله عز وجل أيضًا». وكان رأسه بحِجْر ابنه الباكي، فقال له: «ما يُبكيك يا بني؟! إن الله لا يُعَذِّبني أبدًا، وإني من أهل الجنة».
لقد كان إيمانه بصدق بشارة رسول الله صلى الله عليه وسلم كبيرًا، كانت وفاته سنة خمس وخمسين من الهجرة النبوية، وكان آخر المهاجرين وفاة، ودُفِن في البقيع[13].
""";

// طلحة بن عبيد الله
const String talhaStory =
"""
«مَنْ سَرَّهُ أَنْ يَنْظُرَ إِلَى شَهِيدٍ يَمْشِي عَلَى وَجْهِ الأَرْضِ فَلْيَنْظُرْ إِلَى طَلْحَةَ بْنِ عُبَيْدِ اللهِ»[1]، هكذا وصف رسول الله صلى الله عليه وسلم طلحة بن عبيد الله رضي الله عنه، مبينًا مكانته في الإسلام وفضله، فمن هو طلحة بن عبيد الله؟
هو أبو محمد طلحة بن عبيد الله بن عثمان بن عمرو بن كعب بن سعد بن تيم بن مرة بن كعب بن لؤي بن غالب القرشي التيمي[2]، ويجتمع مع النبي صلى الله عليه وسلم في مرة بن كعب ومع أبي بكر الصديق في تيم بن مرة وعدد ما بينهم من الآباء سواء[3]، ويعرف بطلحة الخير، وطلحة الفياض[4]، وقال عنه صلى الله عليه وسلم: «طَلْحَةُ مِمَّنْ قَضَى نَحْبَهُ»[5].
وأمه رضي الله عنه هي الصَّعْبَةُ ابْنَةُ عَبْدِ اللَّهِ الْحَضْرَمِيِّ، امرأة من أهل اليمن وهي أخت العلاء بن الحضرمي[6] أسلمت ولها صحبة وظفرت بشرف الهجرة.
وطلحة بن عبيد الله هو أحد العشرة الذين شهد لهم رسول الله صلى الله عليه وسلم بالجنة، وأحد الثمانية الذين سبقوا إلى الإسلام، وأحد الخمسة الذين أسلموا على يد أبي بكر رضي الله عنه، وأحد الستة أهل الشورى الذين تُوُفِّي رسول الله صلى الله عليه وسلم وهو عنهم راضٍ، وأحد الذين كانوا مع رسول الله صلى الله عليه وسلم على الجبل فتحرَّك بهم.[7]
 
نشأته وإسلامه:
وُلِد طلحة رضي الله عنه في مكة، قبل البعثة بخمسة عشر عامًا، في بيئة قرشيَّة، وعمل كمعظم أهل قريش بالتجارة؛ حيث كان يذهب إلى الشام لشراء البضائع من هناك، ليتَّجر فيها عند عودته لمكة، التي تعتبر مقصدًا للعرب قبل الإسلام لوجود الكعبة فيها.
وفي إحدى أسفاره إلى الشام حصلت له قصة عجيبة يقصها هو بنفسه؛ فيقول: حضرت سوق بُصرى، فإذا راهب في صومعته يقول: سَلُوا أَهْلَ هَذَا الْمَوْسِمِ، أَفِيهِمْ أَحَدٌ مِنْ أَهْلِ الْحَرَمِ؟ قَالَ طَلْحَةُ: أَنَا، فَقَالَ: هَلْ ظَهَرَ أَحْمَدُ بَعْدُ؟ قُلْتُ: وَمَنْ أَحْمَدُ؟ قَالَ: ابْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْمُطَّلِبِ هَذَا شَهْرُهُ الَّذِي يَخْرُجُ فِيهِ، وَهُوَ آخِرُ الْأَنْبِيَاءِ مَخْرَجُهُ مِنَ الْحَرَمِ، وَمُهَاجَرُهُ إِلَى نَخْلٍ وَحَرَّةٍ وَسِبَاخٍ، فَإِيَّاكَ أَنْ تُسْبَقَ إِلَيْهِ، قَالَ طَلْحَةُ: فَوَقَعَ فِي قَلْبِي مَا قَالَ، فَخَرَجْتُ سَرِيعًا حَتَّى قَدِمْتُ مَكَّةَ، فَقُلْتُ: هَلْ كَانَ مِنْ حَدَثٍ؟ قَالُوا: نَعَمْ، مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْأَمِينُ تَنَبَّأَ، وَقَدْ تَبِعَهُ ابْنُ أَبِي قُحَافَةَ، قَالَ: فَخَرَجْتُ حَتَّى دَخَلْتُ عَلَى أَبِي بَكْرٍ فَقُلْتُ: اتَّبَعْتَ هَذَا الرَّجُلَ؟ قَالَ: نَعَمْ، فَانْطَلِقْ إِلَيْهِ، فَادْخُلْ عَلَيْهِ فَاتَّبِعْهُ، فَإِنَّهُ يَدْعُو إِلَى الْحَقِّ، فَأَخْبَرَهُ طَلْحَةُ بِمَا قَالَ الرَّاهِبُ: فَخَرَجَ أَبُو بَكْرٍ بِطَلْحَةَ، فَدَخَلَ بِهِ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَسْلَمَ طَلْحَةُ، وَأَخْبَرَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَا قَالَ الرَّاهِبُ، فَسُرَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَلَمَّا أَسْلَمَ أَبُو بَكْرٍ وَطَلْحَةُ أَخَذَهُمَا نَوْفَلُ بْنُ خُوَيْلِدِ بْنِ الْعَدَوِيَّةِ فَشَدَّهُمَا فِي حَبَلٍ وَاحِدٍ وَلَمْ يَمْنَعْهُمَا بَنُو تَيْمٍ، وَكَانَ نَوْفَلُ بْنُ خُوَيْلِدٍ يُدْعَى أَشَدَّ قُرَيْشٍ، فَلِذَلِكَ سُمِّيَ أَبُو بَكْرٍ وَطَلْحَةُ: الْقَرِينَيْنِ[8].
وفي قصة إسلام طلحة بن عبيد الله رضي الله عنه دليل من دلائل نبوة نبينا صلى الله عليه وسلم، وشاهد على معرفة اليهود بعلاماته وأماراته صلى الله عليه وسلم، فمن المعلوم أن اليهود أقاموا بالجزيرة العربية قبل بعثة النبي صلى الله عليه وسلم، وكانوا يفخرون على جيرانهم من العرب بأنهم من أهل الكتاب، وأنهم يعتنقون ديناً سماويا مُنزلاً من عند الله، وقد اقترب ظهور نبي آخر الزمان الذي بشرت به التوراة، وذكرت أوصافه، ومع أن البشارات والعلامات التي يعرفونها قد تجمعت في النبي محمد صلى الله عليه وسلم، فإنهم كتموا ما عندهم من آيات وبينات، ولم يؤمنوا به حقدًا وحسدًا واستكبارًا؛ لأنهم كانوا يتطلعون أن يكون هذا النبي من بينهم، قال الله تعالى: ﴿الَّذِينَ آَتَيْنَاهُمُ الكِتَابَ يَعْرِفُونَهُ كَمَا يَعْرِفُونَ أَبْنَاءَهُمْ وَإِنَّ فَرِيقًا مِنْهُمْ لَيَكْتُمُونَ الحَقَّ وَهُمْ يَعْلَمُونَ﴾ [البقرة:146]، وقال تعالى: ﴿وَدَّ كَثِيرٌ مِنْ أَهْلِ الْكِتَابِ لَوْ يَرُدُّونَكُمْ مِنْ بَعْدِ إِيمَانِكُمْ كُفَّارًا حَسَدًا مِنْ عِنْدِ أَنْفُسِهِمْ مِنْ بَعْدِ مَا تَبَيَّنَ لَهُمُ الْحَقُّ﴾ [البقرة: 109]، قال ابن كثير في تفسيره لهذه الآية: "من بعد ما أضاء لهم الحق لم يجهلوا منه شيئاً، ولكن الحسد حملهم على الجحود"، وقال ابن تيمية: "والأخبار بمعرفة أهل الكتاب بصفة محمد صلى الله عليه وسلم عندهم في الكتب المتقدمة متواترة عنهم، وقال أبو العالية: من بعد ما تبين لهم أن محمدًا رسول الله يجدونه مكتوباً عندهم في التوراة والإنجيل، فكفروا به حسدًا وبغيًا، إذ كان من غيرهم".

مناقب طلحة بن عبيد الله
هاجر طلحة رضي الله عنه إلى المدينة، حين أُمر المسلمون بالهجرة، ثم شهد المشاهد كلها مع رسول الله صلى الله عليه وسلم، عدا غزوة بدر؛ لأنَّ النبي صلى الله عليه وسلم قد وجهه وسعيد بن زيد يتجسسان خبر العير قبل خروجه عليه الصلاة والسلام إلى بدر فلم يرجعا إلا وقد فرغ من موقعة بدر وضرب لهما رسول الله صلى الله عليه وسلم بسهمهما وأجرهما[9].
قال الواقدي: بعث رسول الله صلى الله عليه وسلم قبل أن يخرج من المدينة إلى بدر طلحة بن عبيد الله وسعيد بن زيد إلى طريق الشام يتحسسان الأخبار ثم رجعا إلى المدينة فقدماها يوم وقعة بدر[10]، فخروجهما لجس الأخبار يعتبر في صالح المعركة وهو نوع من المشاركة فيها.
ولَمَّا كان يوم غزوة أحد أبلى فيه طلحة بن عبيد الله رضي الله عنه بلاءً حسنًا، وبايع رسول الله صلى الله عليه وسلم على الموت، وحماه من الكفار، واتّقى عنه النبل بيده حتى أصيبت، قَالَ ابن أبي خالد عن قيس: "رَأَيْتُ يَدَ طَلْحَةَ الَّتِي وَقَى بِهَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ أُحُدٍ شَلَّاءَ"[11]؛ ولذا كان جماعة من الصحابة يقولون عن يوم أحد: ذاك يوم كله لِطلحة، ولما طأطأ لِرسول الله صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ لِينهضَ على تلك الصخرةِ يومَ أحدٍ قال: «أَوْجَبَ طَلْحَةُ»[12].
 
عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ: لَمَّا كَانَ يَوْمُ أُحُدٍ وَوَلَّى النَّاسُ، كَانَ رَسُولُ اللَّهِ فِي نَاحِيَةٍ فِي اثْنَيْ عَشَرَ رَجُلاً مِنَ الأَنْصَارِ، وَفِيهِمْ طَلْحَةُ بْنُ عُبَيْدِ اللَّهِ، فَأَدْرَكَهُمْ الْمُشْرِكُونَ، فَالْتَفَتَ رَسُولُ اللَّهِ، وَقَالَ: «مَنْ لِلْقَوْمِ؟» فَقَالَ طَلْحَةُ: أَنَا. قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: «كَمَا أَنْتَ». فَقَالَ رَجُلٌ مِنَ الأَنْصَارِ: أَنَا يَا رَسُولَ اللَّهِ. فَقَالَ: «أَنْتَ». فَقَاتَلَ حَتَّى قُتِلَ، ثُمَّ الْتَفَتَ فَإِذَا الْمُشْرِكُونَ، فَقَالَ: «مَنْ لِلْقَوْمِ؟»
فَقَالَ طَلْحَةُ: أَنَا. قَالَ: «كَمَا أَنْتَ». فَقَالَ رَجُلٌ مِنَ الأَنْصَارِ: أَنَا. فَقَالَ: «أَنْتَ». فَقَاتَلَ حَتَّى قُتِلَ، ثُمَّ لَمْ يَزَلْ يَقُولُ ذَلِكَ وَيَخْرُجُ إِلَيْهِمْ رَجُلٌ مِنَ الأَنْصَارِ فَيُقَاتِلُ قِتَالَ مَنْ قَبْلَهُ حَتَّى يُقْتَلَ، حَتَّى بَقِيَ رَسُولُ اللَّهِ وَطَلْحَةُ بْنُ عُبَيْدِ اللَّهِ، فَقَالَ رَسُولُ اللَّهِ: «مَنْ لِلْقَوْمِ؟» فَقَالَ طَلْحَةُ: أَنَا. فَقَاتَلَ طَلْحَةُ قِتَالَ الأَحَدَ عَشَرَ حَتَّى ضُرِبَتْ يَدُهُ فَقُطِعَتْ أَصَابِعُهُ، فَقَالَ: حَسِّ. فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: «لَوْ قُلْتَ بِاسْمِ اللَّهِ لَرَفَعَتْكَ الْمَلاَئِكَةُ وَالنَّاسُ يَنْظُرُونَ»، ثُمَّ رَدَّ اللَّهُ الْمُشْرِكِينَ[14].
وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم كان على حراء هو وأبو بكر وعمر وعثمان وعلي وطلحة والزبير، فتحركت الصخرة، فقال رسول الله: «اهْدَأْ، فَمَا عَلَيْكَ إِلاَّ نَبِيٌّ أَو صِدِّيقٌ أَو شَهِيدٌ»[15].
وقد دَخَلَ طَلْحَةُ بْنُ عُبَيْدِ اللَّهِ عَلَى أَبِي بَكْرٍ، فَقَالَ: اسْتَخْلَفْتَ عَلَى النَّاسِ عُمَرَ وَقَدْ رَأَيْتَ مَا يَلْقَى النَّاسُ مِنْهُ وَأَنْتَ مَعَهُ، فَكَيْفَ بِهِ إِذَا خَلا بِهِمْ وَأَنْتَ لاقٍ رَبِّكَ فَسَائِلُكَ عَنْ رَعِيَّتِكَ؟ فَقَالَ أَبُو بَكْرٍ وَكَانَ مُضْطَجِعًا: أَجْلِسُونِي فَأَجْلَسُوهُ. فَقَالَ لِطَلْحَةَ: أَبِاللَّهِ تَفْرُقُنِي؟، أَوْ أَبِاللَّهِ تُخَوِّفُنِي؟ إِذَا لَقِيتُ اللَّهَ رَبِّي فَسَاءَلَنِي، قُلْتُ: اسْتَخْلَفْتُ عَلَى أَهْلِكَ خَيْرَ أَهْلِكَ[16].

ومن مناقبه الرفيعة أن رسول الله صلى الله عليه وسلم توفي وهو عنه راض. قال الإمام البخاري رحمه الله تعالى: (باب ذكر مناقب طلحة بن عبيد الله، وقال عمر: توفي النبي صلى الله عليه وسلم وهو عنه راض)[13]

من كلمات طلحة بن عبيد الله
عن طلحة بن عبيد الله رضي الله عنه قال: "لَقَدْ أُعْطِيَ ابْنُ عَبَّاسٍ فَهْمًا، وَلَقْنًا، وَعِلْمًا، مَا كُنْتُ أَرَى عُمَرَ يُقَدِّمُ عَلَيْهِ أَحَدًا"[17].
وقال رضي الله عنه: "إنّا لَنَجِدُ بأمْوالنا ما يجدُ البخلاء لكننا نتصبّرُ"[18].
وقال أيضًا: "الكسوة تُظهِر النعمة، والدهن يذهب البؤس، والإحسان إلى الخادم يكبت الأعداء".
 
استشهاده رضي الله عنه:
عاش طلحة رضي الله عنه إلى زمن خلافة علي بن أبي طالب، ولَمَّا حدث الخلاف بين الصحابة حول أيهما أولى: استقرار الأمور وبيعة أمير المؤمنين رضي الله عنه، أم القصاص لعثمان رضي الله عنه، كان طلحة بن عبيد الله رضي الله عنه مع الرأي الثاني، الذي كان يميل إلى تقديم القصاص، ولكن ورغم ذلك جاء أمير المؤمنين علي بن أبي طالب رضي الله عنه، وناشد طلحة رضي الله عنه أن يرجع عن قتاله، وألَّا يؤذيه بذلك، فرجع طلحة رضي الله عنه، وقرَّرَ أن ينسحب عن المعركة، فلحقه سهمٌ غادرٌ، ممن يريدون إشعال الفتن، ويضرهم أن يتَّحدَ صحابة رسول الله صلى الله عليه  وسلم، فكان استشهاده يوم موقعة الجمل سنة 36هـ ليلحق بحبيبه صلى الله عليه  وأصحابه الأبرار.
وحين كان عليٌّ رضي الله عنه يستعرض شهداء المعركة، راح يصلي عليهم جميعًا، الذين كانوا معه، والذين كانوا ضدَّه، ولما فرغ من دفن طلحة رضي الله عنه، والزبير رضي الله عنه، وقف يودعهما بكلمات جليلة، اختتمها قائلًا: "إني لأرجو أن أكون أنا، وطلحة والزبير وعثمان من الذين قال الله فيهم: ﴿وَنَزَعْنَا مَا فِي صُدُورِهِمْ مِنْ غِلٍّ إِخْوَانًا عَلَى سُرُرٍ مُتَقَابِلِينَ﴾ [الحجر:47]، ثم ضمَّ قبريهما بنظراته الحانية الصافية وقال: "سمعت أذناي هاتان رسول الله صلى الله عليه  وسلم يقول: «طَلْحَةُ وَالزُّبَيْرُ جَارَايَ فِي الجَنَّةِ»[19]. فرضي الله عنهم أجمعين.
""";
